TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 13 15:31:34 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    1704                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1705                            .dwattr $C$DW$159, DW_AT_decl_line(0x65)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   32

    1706                            .dwattr $C$DW$159, DW_AT_decl_column(0x05)
    1707                    
    1708                    $C$DW$160       .dwtag  DW_TAG_enumerator
    1709                            .dwattr $C$DW$160, DW_AT_name("HW_PSC_SCRF1_SS")
    1710                            .dwattr $C$DW$160, DW_AT_const_value(0x19)
    1711                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1712                            .dwattr $C$DW$160, DW_AT_decl_line(0x66)
    1713                            .dwattr $C$DW$160, DW_AT_decl_column(0x05)
    1714                    
    1715                    $C$DW$161       .dwtag  DW_TAG_enumerator
    1716                            .dwattr $C$DW$161, DW_AT_name("HW_PSC_SCRF2_SS")
    1717                            .dwattr $C$DW$161, DW_AT_const_value(0x1a)
    1718                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1719                            .dwattr $C$DW$161, DW_AT_decl_line(0x67)
    1720                            .dwattr $C$DW$161, DW_AT_decl_column(0x05)
    1721                    
    1722                    $C$DW$162       .dwtag  DW_TAG_enumerator
    1723                            .dwattr $C$DW$162, DW_AT_name("HW_PSC_SCRF6_SS")
    1724                            .dwattr $C$DW$162, DW_AT_const_value(0x1b)
    1725                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1726                            .dwattr $C$DW$162, DW_AT_decl_line(0x68)
    1727                            .dwattr $C$DW$162, DW_AT_decl_column(0x05)
    1728                    
    1729                    $C$DW$163       .dwtag  DW_TAG_enumerator
    1730                            .dwattr $C$DW$163, DW_AT_name("HW_PSC_SCRF7_SS")
    1731                            .dwattr $C$DW$163, DW_AT_const_value(0x1c)
    1732                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1733                            .dwattr $C$DW$163, DW_AT_decl_line(0x69)
    1734                            .dwattr $C$DW$163, DW_AT_decl_column(0x05)
    1735                    
    1736                    $C$DW$164       .dwtag  DW_TAG_enumerator
    1737                            .dwattr $C$DW$164, DW_AT_name("HW_PSC_SCRF8_SS")
    1738                            .dwattr $C$DW$164, DW_AT_const_value(0x1d)
    1739                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1740                            .dwattr $C$DW$164, DW_AT_decl_line(0x6a)
    1741                            .dwattr $C$DW$164, DW_AT_decl_column(0x05)
    1742                    
    1743                    $C$DW$165       .dwtag  DW_TAG_enumerator
    1744                            .dwattr $C$DW$165, DW_AT_name("HW_PSC_BR_F7")
    1745                            .dwattr $C$DW$165, DW_AT_const_value(0x1e)
    1746                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1747                            .dwattr $C$DW$165, DW_AT_decl_line(0x6b)
    1748                            .dwattr $C$DW$165, DW_AT_decl_column(0x05)
    1749                    
    1750                    $C$DW$166       .dwtag  DW_TAG_enumerator
    1751                            .dwattr $C$DW$166, DW_AT_name("HW_PSC_SHRAM")
    1752                            .dwattr $C$DW$166, DW_AT_const_value(0x1f)
    1753                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1754                            .dwattr $C$DW$166, DW_AT_decl_line(0x6c)
    1755                            .dwattr $C$DW$166, DW_AT_decl_column(0x05)
    1756                    
    1757                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C
    1758                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x4e)
    1759                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x0e)
    1760                            .dwendtag $C$DW$T$61
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   33

    1761                    
    1762                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    1763                            .dwattr $C$DW$T$62, DW_AT_name("Psc1Peripheral")
    1764                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1765                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1766                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C
    1767                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x6d)
    1768                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    1769                    
    1770                    
    1771                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1772                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x190)
    1773                    $C$DW$167       .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    1775                            .dwattr $C$DW$167, DW_AT_name("REVID")
    1776                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("REVID")
    1777                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1779                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1780                            .dwattr $C$DW$167, DW_AT_decl_line(0x41)
    1781                            .dwattr $C$DW$167, DW_AT_decl_column(0x15)
    1782                    
    1783                    $C$DW$168       .dwtag  DW_TAG_member
    1784                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
    1785                            .dwattr $C$DW$168, DW_AT_name("RSVD0")
    1786                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("RSVD0")
    1787                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1788                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1790                            .dwattr $C$DW$168, DW_AT_decl_line(0x42)
    1791                            .dwattr $C$DW$168, DW_AT_decl_column(0x14)
    1792                    
    1793                    $C$DW$169       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    1795                            .dwattr $C$DW$169, DW_AT_name("DIEIDR0")
    1796                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("DIEIDR0")
    1797                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1798                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1799                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1800                            .dwattr $C$DW$169, DW_AT_decl_line(0x43)
    1801                            .dwattr $C$DW$169, DW_AT_decl_column(0x15)
    1802                    
    1803                    $C$DW$170       .dwtag  DW_TAG_member
    1804                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    1805                            .dwattr $C$DW$170, DW_AT_name("DIEIDR1")
    1806                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("DIEIDR1")
    1807                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1808                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1809                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1810                            .dwattr $C$DW$170, DW_AT_decl_line(0x44)
    1811                            .dwattr $C$DW$170, DW_AT_decl_column(0x15)
    1812                    
    1813                    $C$DW$171       .dwtag  DW_TAG_member
    1814                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    1815                            .dwattr $C$DW$171, DW_AT_name("DIEIDR2")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   34

    1816                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("DIEIDR2")
    1817                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1818                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1819                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1820                            .dwattr $C$DW$171, DW_AT_decl_line(0x45)
    1821                            .dwattr $C$DW$171, DW_AT_decl_column(0x15)
    1822                    
    1823                    $C$DW$172       .dwtag  DW_TAG_member
    1824                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    1825                            .dwattr $C$DW$172, DW_AT_name("DIEIDR3")
    1826                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("DIEIDR3")
    1827                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1828                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1829                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1830                            .dwattr $C$DW$172, DW_AT_decl_line(0x46)
    1831                            .dwattr $C$DW$172, DW_AT_decl_column(0x15)
    1832                    
    1833                    $C$DW$173       .dwtag  DW_TAG_member
    1834                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    1835                            .dwattr $C$DW$173, DW_AT_name("DEVIDR0")
    1836                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("DEVIDR0")
    1837                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1838                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1839                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1840                            .dwattr $C$DW$173, DW_AT_decl_line(0x47)
    1841                            .dwattr $C$DW$173, DW_AT_decl_column(0x15)
    1842                    
    1843                    $C$DW$174       .dwtag  DW_TAG_member
    1844                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$29)
    1845                            .dwattr $C$DW$174, DW_AT_name("RSVD1")
    1846                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("RSVD1")
    1847                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1848                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1849                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1850                            .dwattr $C$DW$174, DW_AT_decl_line(0x48)
    1851                            .dwattr $C$DW$174, DW_AT_decl_column(0x14)
    1852                    
    1853                    $C$DW$175       .dwtag  DW_TAG_member
    1854                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    1855                            .dwattr $C$DW$175, DW_AT_name("BOOTCFG")
    1856                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("BOOTCFG")
    1857                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1858                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1860                            .dwattr $C$DW$175, DW_AT_decl_line(0x49)
    1861                            .dwattr $C$DW$175, DW_AT_decl_column(0x15)
    1862                    
    1863                    $C$DW$176       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    1865                            .dwattr $C$DW$176, DW_AT_name("CHIPREVIDR")
    1866                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("CHIPREVIDR")
    1867                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1868                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1870                            .dwattr $C$DW$176, DW_AT_decl_line(0x4a)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   35

    1871                            .dwattr $C$DW$176, DW_AT_decl_column(0x15)
    1872                    
    1873                    $C$DW$177       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$30)
    1875                            .dwattr $C$DW$177, DW_AT_name("RSVD2")
    1876                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("RSVD2")
    1877                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1878                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1880                            .dwattr $C$DW$177, DW_AT_decl_line(0x4b)
    1881                            .dwattr $C$DW$177, DW_AT_decl_column(0x14)
    1882                    
    1883                    $C$DW$178       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    1885                            .dwattr $C$DW$178, DW_AT_name("KICK0R")
    1886                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("KICK0R")
    1887                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1888                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1890                            .dwattr $C$DW$178, DW_AT_decl_line(0x4c)
    1891                            .dwattr $C$DW$178, DW_AT_decl_column(0x15)
    1892                    
    1893                    $C$DW$179       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$23)
    1895                            .dwattr $C$DW$179, DW_AT_name("KICK1R")
    1896                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("KICK1R")
    1897                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1898                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1900                            .dwattr $C$DW$179, DW_AT_decl_line(0x4d)
    1901                            .dwattr $C$DW$179, DW_AT_decl_column(0x15)
    1902                    
    1903                    $C$DW$180       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    1905                            .dwattr $C$DW$180, DW_AT_name("RSVD3")
    1906                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("RSVD3")
    1907                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1908                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1910                            .dwattr $C$DW$180, DW_AT_decl_line(0x4e)
    1911                            .dwattr $C$DW$180, DW_AT_decl_column(0x14)
    1912                    
    1913                    $C$DW$181       .dwtag  DW_TAG_member
    1914                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
    1915                            .dwattr $C$DW$181, DW_AT_name("HOST1CFG")
    1916                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("HOST1CFG")
    1917                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1918                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1919                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1920                            .dwattr $C$DW$181, DW_AT_decl_line(0x4f)
    1921                            .dwattr $C$DW$181, DW_AT_decl_column(0x15)
    1922                    
    1923                    $C$DW$182       .dwtag  DW_TAG_member
    1924                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1925                            .dwattr $C$DW$182, DW_AT_name("RSVD4")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   36

    1926                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("RSVD4")
    1927                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1928                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1929                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1930                            .dwattr $C$DW$182, DW_AT_decl_line(0x50)
    1931                            .dwattr $C$DW$182, DW_AT_decl_column(0x14)
    1932                    
    1933                    $C$DW$183       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
    1935                            .dwattr $C$DW$183, DW_AT_name("IRAWSTAT")
    1936                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("IRAWSTAT")
    1937                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1938                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1940                            .dwattr $C$DW$183, DW_AT_decl_line(0x51)
    1941                            .dwattr $C$DW$183, DW_AT_decl_column(0x15)
    1942                    
    1943                    $C$DW$184       .dwtag  DW_TAG_member
    1944                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    1945                            .dwattr $C$DW$184, DW_AT_name("IENSTAT")
    1946                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("IENSTAT")
    1947                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1948                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1949                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1950                            .dwattr $C$DW$184, DW_AT_decl_line(0x52)
    1951                            .dwattr $C$DW$184, DW_AT_decl_column(0x15)
    1952                    
    1953                    $C$DW$185       .dwtag  DW_TAG_member
    1954                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    1955                            .dwattr $C$DW$185, DW_AT_name("IENSET")
    1956                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("IENSET")
    1957                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1958                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1959                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1960                            .dwattr $C$DW$185, DW_AT_decl_line(0x53)
    1961                            .dwattr $C$DW$185, DW_AT_decl_column(0x15)
    1962                    
    1963                    $C$DW$186       .dwtag  DW_TAG_member
    1964                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
    1965                            .dwattr $C$DW$186, DW_AT_name("IENCLR")
    1966                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("IENCLR")
    1967                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1968                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1969                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1970                            .dwattr $C$DW$186, DW_AT_decl_line(0x54)
    1971                            .dwattr $C$DW$186, DW_AT_decl_column(0x15)
    1972                    
    1973                    $C$DW$187       .dwtag  DW_TAG_member
    1974                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    1975                            .dwattr $C$DW$187, DW_AT_name("EOI")
    1976                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("EOI")
    1977                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1978                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1979                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1980                            .dwattr $C$DW$187, DW_AT_decl_line(0x55)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   37

    1981                            .dwattr $C$DW$187, DW_AT_decl_column(0x15)
    1982                    
    1983                    $C$DW$188       .dwtag  DW_TAG_member
    1984                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
    1985                            .dwattr $C$DW$188, DW_AT_name("FLTADDRR")
    1986                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("FLTADDRR")
    1987                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1988                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1989                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1990                            .dwattr $C$DW$188, DW_AT_decl_line(0x56)
    1991                            .dwattr $C$DW$188, DW_AT_decl_column(0x15)
    1992                    
    1993                    $C$DW$189       .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    1995                            .dwattr $C$DW$189, DW_AT_name("FLTSTAT")
    1996                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("FLTSTAT")
    1997                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1998                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2000                            .dwattr $C$DW$189, DW_AT_decl_line(0x57)
    2001                            .dwattr $C$DW$189, DW_AT_decl_column(0x15)
    2002                    
    2003                    $C$DW$190       .dwtag  DW_TAG_member
    2004                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
    2005                            .dwattr $C$DW$190, DW_AT_name("RSVD5")
    2006                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("RSVD5")
    2007                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2008                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2009                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2010                            .dwattr $C$DW$190, DW_AT_decl_line(0x58)
    2011                            .dwattr $C$DW$190, DW_AT_decl_column(0x14)
    2012                    
    2013                    $C$DW$191       .dwtag  DW_TAG_member
    2014                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
    2015                            .dwattr $C$DW$191, DW_AT_name("MSTPRI0")
    2016                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("MSTPRI0")
    2017                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2018                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2019                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2020                            .dwattr $C$DW$191, DW_AT_decl_line(0x59)
    2021                            .dwattr $C$DW$191, DW_AT_decl_column(0x15)
    2022                    
    2023                    $C$DW$192       .dwtag  DW_TAG_member
    2024                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
    2025                            .dwattr $C$DW$192, DW_AT_name("MSTPRI1")
    2026                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("MSTPRI1")
    2027                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2028                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2030                            .dwattr $C$DW$192, DW_AT_decl_line(0x5a)
    2031                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2032                    
    2033                    $C$DW$193       .dwtag  DW_TAG_member
    2034                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    2035                            .dwattr $C$DW$193, DW_AT_name("MSTPRI2")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   38

    2036                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("MSTPRI2")
    2037                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2038                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2039                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2040                            .dwattr $C$DW$193, DW_AT_decl_line(0x5b)
    2041                            .dwattr $C$DW$193, DW_AT_decl_column(0x15)
    2042                    
    2043                    $C$DW$194       .dwtag  DW_TAG_member
    2044                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
    2045                            .dwattr $C$DW$194, DW_AT_name("RSVD6")
    2046                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("RSVD6")
    2047                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2048                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2049                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2050                            .dwattr $C$DW$194, DW_AT_decl_line(0x5c)
    2051                            .dwattr $C$DW$194, DW_AT_decl_column(0x14)
    2052                    
    2053                    $C$DW$195       .dwtag  DW_TAG_member
    2054                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
    2055                            .dwattr $C$DW$195, DW_AT_name("PINMUX0")
    2056                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("PINMUX0")
    2057                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2058                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2059                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2060                            .dwattr $C$DW$195, DW_AT_decl_line(0x5d)
    2061                            .dwattr $C$DW$195, DW_AT_decl_column(0x15)
    2062                    
    2063                    $C$DW$196       .dwtag  DW_TAG_member
    2064                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
    2065                            .dwattr $C$DW$196, DW_AT_name("PINMUX1")
    2066                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("PINMUX1")
    2067                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2068                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2069                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2070                            .dwattr $C$DW$196, DW_AT_decl_line(0x5e)
    2071                            .dwattr $C$DW$196, DW_AT_decl_column(0x15)
    2072                    
    2073                    $C$DW$197       .dwtag  DW_TAG_member
    2074                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
    2075                            .dwattr $C$DW$197, DW_AT_name("PINMUX2")
    2076                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("PINMUX2")
    2077                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2078                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2079                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2080                            .dwattr $C$DW$197, DW_AT_decl_line(0x5f)
    2081                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    2082                    
    2083                    $C$DW$198       .dwtag  DW_TAG_member
    2084                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    2085                            .dwattr $C$DW$198, DW_AT_name("PINMUX3")
    2086                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("PINMUX3")
    2087                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2088                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2090                            .dwattr $C$DW$198, DW_AT_decl_line(0x60)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   39

    2091                            .dwattr $C$DW$198, DW_AT_decl_column(0x15)
    2092                    
    2093                    $C$DW$199       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$23)
    2095                            .dwattr $C$DW$199, DW_AT_name("PINMUX4")
    2096                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("PINMUX4")
    2097                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    2098                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2100                            .dwattr $C$DW$199, DW_AT_decl_line(0x61)
    2101                            .dwattr $C$DW$199, DW_AT_decl_column(0x15)
    2102                    
    2103                    $C$DW$200       .dwtag  DW_TAG_member
    2104                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$23)
    2105                            .dwattr $C$DW$200, DW_AT_name("PINMUX5")
    2106                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("PINMUX5")
    2107                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    2108                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2109                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2110                            .dwattr $C$DW$200, DW_AT_decl_line(0x62)
    2111                            .dwattr $C$DW$200, DW_AT_decl_column(0x15)
    2112                    
    2113                    $C$DW$201       .dwtag  DW_TAG_member
    2114                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    2115                            .dwattr $C$DW$201, DW_AT_name("PINMUX6")
    2116                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("PINMUX6")
    2117                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    2118                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2119                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2120                            .dwattr $C$DW$201, DW_AT_decl_line(0x63)
    2121                            .dwattr $C$DW$201, DW_AT_decl_column(0x15)
    2122                    
    2123                    $C$DW$202       .dwtag  DW_TAG_member
    2124                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$23)
    2125                            .dwattr $C$DW$202, DW_AT_name("PINMUX7")
    2126                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("PINMUX7")
    2127                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    2128                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2129                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2130                            .dwattr $C$DW$202, DW_AT_decl_line(0x64)
    2131                            .dwattr $C$DW$202, DW_AT_decl_column(0x15)
    2132                    
    2133                    $C$DW$203       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$23)
    2135                            .dwattr $C$DW$203, DW_AT_name("PINMUX8")
    2136                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("PINMUX8")
    2137                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    2138                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2140                            .dwattr $C$DW$203, DW_AT_decl_line(0x65)
    2141                            .dwattr $C$DW$203, DW_AT_decl_column(0x15)
    2142                    
    2143                    $C$DW$204       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$23)
    2145                            .dwattr $C$DW$204, DW_AT_name("PINMUX9")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   40

    2146                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("PINMUX9")
    2147                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    2148                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2150                            .dwattr $C$DW$204, DW_AT_decl_line(0x66)
    2151                            .dwattr $C$DW$204, DW_AT_decl_column(0x15)
    2152                    
    2153                    $C$DW$205       .dwtag  DW_TAG_member
    2154                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$23)
    2155                            .dwattr $C$DW$205, DW_AT_name("PINMUX10")
    2156                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("PINMUX10")
    2157                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    2158                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2159                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2160                            .dwattr $C$DW$205, DW_AT_decl_line(0x67)
    2161                            .dwattr $C$DW$205, DW_AT_decl_column(0x15)
    2162                    
    2163                    $C$DW$206       .dwtag  DW_TAG_member
    2164                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$23)
    2165                            .dwattr $C$DW$206, DW_AT_name("PINMUX11")
    2166                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("PINMUX11")
    2167                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    2168                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2169                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2170                            .dwattr $C$DW$206, DW_AT_decl_line(0x68)
    2171                            .dwattr $C$DW$206, DW_AT_decl_column(0x15)
    2172                    
    2173                    $C$DW$207       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$23)
    2175                            .dwattr $C$DW$207, DW_AT_name("PINMUX12")
    2176                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("PINMUX12")
    2177                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    2178                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2179                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2180                            .dwattr $C$DW$207, DW_AT_decl_line(0x69)
    2181                            .dwattr $C$DW$207, DW_AT_decl_column(0x15)
    2182                    
    2183                    $C$DW$208       .dwtag  DW_TAG_member
    2184                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$23)
    2185                            .dwattr $C$DW$208, DW_AT_name("PINMUX13")
    2186                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("PINMUX13")
    2187                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    2188                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2190                            .dwattr $C$DW$208, DW_AT_decl_line(0x6a)
    2191                            .dwattr $C$DW$208, DW_AT_decl_column(0x15)
    2192                    
    2193                    $C$DW$209       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
    2195                            .dwattr $C$DW$209, DW_AT_name("PINMUX14")
    2196                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("PINMUX14")
    2197                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    2198                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2200                            .dwattr $C$DW$209, DW_AT_decl_line(0x6b)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   41

    2201                            .dwattr $C$DW$209, DW_AT_decl_column(0x15)
    2202                    
    2203                    $C$DW$210       .dwtag  DW_TAG_member
    2204                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
    2205                            .dwattr $C$DW$210, DW_AT_name("PINMUX15")
    2206                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("PINMUX15")
    2207                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    2208                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2210                            .dwattr $C$DW$210, DW_AT_decl_line(0x6c)
    2211                            .dwattr $C$DW$210, DW_AT_decl_column(0x15)
    2212                    
    2213                    $C$DW$211       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$23)
    2215                            .dwattr $C$DW$211, DW_AT_name("PINMUX16")
    2216                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("PINMUX16")
    2217                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    2218                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2220                            .dwattr $C$DW$211, DW_AT_decl_line(0x6d)
    2221                            .dwattr $C$DW$211, DW_AT_decl_column(0x15)
    2222                    
    2223                    $C$DW$212       .dwtag  DW_TAG_member
    2224                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$23)
    2225                            .dwattr $C$DW$212, DW_AT_name("PINMUX17")
    2226                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("PINMUX17")
    2227                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    2228                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2229                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2230                            .dwattr $C$DW$212, DW_AT_decl_line(0x6e)
    2231                            .dwattr $C$DW$212, DW_AT_decl_column(0x15)
    2232                    
    2233                    $C$DW$213       .dwtag  DW_TAG_member
    2234                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
    2235                            .dwattr $C$DW$213, DW_AT_name("PINMUX18")
    2236                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("PINMUX18")
    2237                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    2238                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2240                            .dwattr $C$DW$213, DW_AT_decl_line(0x6f)
    2241                            .dwattr $C$DW$213, DW_AT_decl_column(0x15)
    2242                    
    2243                    $C$DW$214       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$23)
    2245                            .dwattr $C$DW$214, DW_AT_name("PINMUX19")
    2246                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("PINMUX19")
    2247                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    2248                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2250                            .dwattr $C$DW$214, DW_AT_decl_line(0x70)
    2251                            .dwattr $C$DW$214, DW_AT_decl_column(0x15)
    2252                    
    2253                    $C$DW$215       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
    2255                            .dwattr $C$DW$215, DW_AT_name("SUSPSRC")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   42

    2256                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("SUSPSRC")
    2257                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    2258                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2260                            .dwattr $C$DW$215, DW_AT_decl_line(0x71)
    2261                            .dwattr $C$DW$215, DW_AT_decl_column(0x15)
    2262                    
    2263                    $C$DW$216       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
    2265                            .dwattr $C$DW$216, DW_AT_name("CHIPSIG")
    2266                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("CHIPSIG")
    2267                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    2268                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2270                            .dwattr $C$DW$216, DW_AT_decl_line(0x72)
    2271                            .dwattr $C$DW$216, DW_AT_decl_column(0x15)
    2272                    
    2273                    $C$DW$217       .dwtag  DW_TAG_member
    2274                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
    2275                            .dwattr $C$DW$217, DW_AT_name("CHIPSIG_CLR")
    2276                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    2277                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    2278                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2279                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2280                            .dwattr $C$DW$217, DW_AT_decl_line(0x73)
    2281                            .dwattr $C$DW$217, DW_AT_decl_column(0x15)
    2282                    
    2283                    $C$DW$218       .dwtag  DW_TAG_member
    2284                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
    2285                            .dwattr $C$DW$218, DW_AT_name("CFGCHIP0")
    2286                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("CFGCHIP0")
    2287                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    2288                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2289                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2290                            .dwattr $C$DW$218, DW_AT_decl_line(0x74)
    2291                            .dwattr $C$DW$218, DW_AT_decl_column(0x15)
    2292                    
    2293                    $C$DW$219       .dwtag  DW_TAG_member
    2294                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
    2295                            .dwattr $C$DW$219, DW_AT_name("CFGCHIP1")
    2296                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("CFGCHIP1")
    2297                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2298                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2299                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2300                            .dwattr $C$DW$219, DW_AT_decl_line(0x75)
    2301                            .dwattr $C$DW$219, DW_AT_decl_column(0x15)
    2302                    
    2303                    $C$DW$220       .dwtag  DW_TAG_member
    2304                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$23)
    2305                            .dwattr $C$DW$220, DW_AT_name("CFGCHIP2")
    2306                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("CFGCHIP2")
    2307                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    2308                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2309                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2310                            .dwattr $C$DW$220, DW_AT_decl_line(0x76)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   43

    2311                            .dwattr $C$DW$220, DW_AT_decl_column(0x15)
    2312                    
    2313                    $C$DW$221       .dwtag  DW_TAG_member
    2314                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
    2315                            .dwattr $C$DW$221, DW_AT_name("CFGCHIP3")
    2316                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("CFGCHIP3")
    2317                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    2318                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2319                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2320                            .dwattr $C$DW$221, DW_AT_decl_line(0x77)
    2321                            .dwattr $C$DW$221, DW_AT_decl_column(0x15)
    2322                    
    2323                    $C$DW$222       .dwtag  DW_TAG_member
    2324                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    2325                            .dwattr $C$DW$222, DW_AT_name("CFGCHIP4")
    2326                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("CFGCHIP4")
    2327                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    2328                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2330                            .dwattr $C$DW$222, DW_AT_decl_line(0x78)
    2331                            .dwattr $C$DW$222, DW_AT_decl_column(0x15)
    2332                    
    2333                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2334                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x40)
    2335                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
    2336                            .dwendtag $C$DW$T$33
    2337                    
    2338                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    2339                            .dwattr $C$DW$T$65, DW_AT_name("CSL_SyscfgRegs")
    2340                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$33)
    2341                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2342                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2343                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x79)
    2344                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    2345                    
    2346                    $C$DW$T$66      .dwtag  DW_TAG_volatile_type
    2347                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2348                    
    2349                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    2350                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2351                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    2352                    
    2353                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    2354                            .dwattr $C$DW$T$68, DW_AT_name("CSL_SyscfgRegsOvly")
    2355                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2356                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2357                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2358                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x7e)
    2359                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x2e)
    2360                    
    2361                    $C$DW$T$69      .dwtag  DW_TAG_const_type
    2362                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2363                    
    2364                    
    2365                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   44

    2366                            .dwattr $C$DW$T$42, DW_AT_byte_size(0xa80)
    2367                    $C$DW$223       .dwtag  DW_TAG_member
    2368                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
    2369                            .dwattr $C$DW$223, DW_AT_name("REVID")
    2370                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("REVID")
    2371                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2373                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2374                            .dwattr $C$DW$223, DW_AT_decl_line(0x78)
    2375                            .dwattr $C$DW$223, DW_AT_decl_column(0x15)
    2376                    
    2377                    $C$DW$224       .dwtag  DW_TAG_member
    2378                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$32)
    2379                            .dwattr $C$DW$224, DW_AT_name("RSVD0")
    2380                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("RSVD0")
    2381                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2382                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2384                            .dwattr $C$DW$224, DW_AT_decl_line(0x79)
    2385                            .dwattr $C$DW$224, DW_AT_decl_column(0x14)
    2386                    
    2387                    $C$DW$225       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
    2389                            .dwattr $C$DW$225, DW_AT_name("INTEVAL")
    2390                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("INTEVAL")
    2391                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2392                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2394                            .dwattr $C$DW$225, DW_AT_decl_line(0x7a)
    2395                            .dwattr $C$DW$225, DW_AT_decl_column(0x15)
    2396                    
    2397                    $C$DW$226       .dwtag  DW_TAG_member
    2398                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$34)
    2399                            .dwattr $C$DW$226, DW_AT_name("RSVD1")
    2400                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("RSVD1")
    2401                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2402                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2403                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2404                            .dwattr $C$DW$226, DW_AT_decl_line(0x7b)
    2405                            .dwattr $C$DW$226, DW_AT_decl_column(0x14)
    2406                    
    2407                    $C$DW$227       .dwtag  DW_TAG_member
    2408                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    2409                            .dwattr $C$DW$227, DW_AT_name("MERRPR0")
    2410                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("MERRPR0")
    2411                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2412                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2413                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2414                            .dwattr $C$DW$227, DW_AT_decl_line(0x7c)
    2415                            .dwattr $C$DW$227, DW_AT_decl_column(0x15)
    2416                    
    2417                    $C$DW$228       .dwtag  DW_TAG_member
    2418                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$35)
    2419                            .dwattr $C$DW$228, DW_AT_name("RSVD2")
    2420                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("RSVD2")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   45

    2421                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2422                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2423                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2424                            .dwattr $C$DW$228, DW_AT_decl_line(0x7d)
    2425                            .dwattr $C$DW$228, DW_AT_decl_column(0x14)
    2426                    
    2427                    $C$DW$229       .dwtag  DW_TAG_member
    2428                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$23)
    2429                            .dwattr $C$DW$229, DW_AT_name("MERRCR0")
    2430                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("MERRCR0")
    2431                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2432                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2433                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2434                            .dwattr $C$DW$229, DW_AT_decl_line(0x7e)
    2435                            .dwattr $C$DW$229, DW_AT_decl_column(0x15)
    2436                    
    2437                    $C$DW$230       .dwtag  DW_TAG_member
    2438                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$35)
    2439                            .dwattr $C$DW$230, DW_AT_name("RSVD3")
    2440                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("RSVD3")
    2441                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2442                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2443                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2444                            .dwattr $C$DW$230, DW_AT_decl_line(0x7f)
    2445                            .dwattr $C$DW$230, DW_AT_decl_column(0x14)
    2446                    
    2447                    $C$DW$231       .dwtag  DW_TAG_member
    2448                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$23)
    2449                            .dwattr $C$DW$231, DW_AT_name("PERRPR")
    2450                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("PERRPR")
    2451                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2452                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2453                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2454                            .dwattr $C$DW$231, DW_AT_decl_line(0x80)
    2455                            .dwattr $C$DW$231, DW_AT_decl_column(0x15)
    2456                    
    2457                    $C$DW$232       .dwtag  DW_TAG_member
    2458                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$29)
    2459                            .dwattr $C$DW$232, DW_AT_name("RSVD4")
    2460                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("RSVD4")
    2461                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2462                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2463                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2464                            .dwattr $C$DW$232, DW_AT_decl_line(0x81)
    2465                            .dwattr $C$DW$232, DW_AT_decl_column(0x14)
    2466                    
    2467                    $C$DW$233       .dwtag  DW_TAG_member
    2468                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
    2469                            .dwattr $C$DW$233, DW_AT_name("PERRCR")
    2470                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("PERRCR")
    2471                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2472                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2473                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2474                            .dwattr $C$DW$233, DW_AT_decl_line(0x82)
    2475                            .dwattr $C$DW$233, DW_AT_decl_column(0x15)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   46

    2476                    
    2477                    $C$DW$234       .dwtag  DW_TAG_member
    2478                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$36)
    2479                            .dwattr $C$DW$234, DW_AT_name("RSVD5")
    2480                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("RSVD5")
    2481                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2482                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2483                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2484                            .dwattr $C$DW$234, DW_AT_decl_line(0x83)
    2485                            .dwattr $C$DW$234, DW_AT_decl_column(0x14)
    2486                    
    2487                    $C$DW$235       .dwtag  DW_TAG_member
    2488                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$23)
    2489                            .dwattr $C$DW$235, DW_AT_name("PTCMD")
    2490                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("PTCMD")
    2491                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2492                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2493                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2494                            .dwattr $C$DW$235, DW_AT_decl_line(0x84)
    2495                            .dwattr $C$DW$235, DW_AT_decl_column(0x15)
    2496                    
    2497                    $C$DW$236       .dwtag  DW_TAG_member
    2498                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$29)
    2499                            .dwattr $C$DW$236, DW_AT_name("RSVD6")
    2500                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("RSVD6")
    2501                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2502                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2503                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2504                            .dwattr $C$DW$236, DW_AT_decl_line(0x85)
    2505                            .dwattr $C$DW$236, DW_AT_decl_column(0x14)
    2506                    
    2507                    $C$DW$237       .dwtag  DW_TAG_member
    2508                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$23)
    2509                            .dwattr $C$DW$237, DW_AT_name("PTSTAT")
    2510                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("PTSTAT")
    2511                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2512                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2513                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2514                            .dwattr $C$DW$237, DW_AT_decl_line(0x86)
    2515                            .dwattr $C$DW$237, DW_AT_decl_column(0x15)
    2516                    
    2517                    $C$DW$238       .dwtag  DW_TAG_member
    2518                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$37)
    2519                            .dwattr $C$DW$238, DW_AT_name("RSVD7")
    2520                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("RSVD7")
    2521                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2522                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2523                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2524                            .dwattr $C$DW$238, DW_AT_decl_line(0x87)
    2525                            .dwattr $C$DW$238, DW_AT_decl_column(0x14)
    2526                    
    2527                    $C$DW$239       .dwtag  DW_TAG_member
    2528                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$23)
    2529                            .dwattr $C$DW$239, DW_AT_name("PDSTAT0")
    2530                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("PDSTAT0")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   47

    2531                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2532                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2533                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2534                            .dwattr $C$DW$239, DW_AT_decl_line(0x88)
    2535                            .dwattr $C$DW$239, DW_AT_decl_column(0x15)
    2536                    
    2537                    $C$DW$240       .dwtag  DW_TAG_member
    2538                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$23)
    2539                            .dwattr $C$DW$240, DW_AT_name("PDSTAT1")
    2540                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("PDSTAT1")
    2541                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
    2542                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2543                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2544                            .dwattr $C$DW$240, DW_AT_decl_line(0x89)
    2545                            .dwattr $C$DW$240, DW_AT_decl_column(0x15)
    2546                    
    2547                    $C$DW$241       .dwtag  DW_TAG_member
    2548                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$38)
    2549                            .dwattr $C$DW$241, DW_AT_name("RSVD8")
    2550                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("RSVD8")
    2551                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    2552                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2553                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2554                            .dwattr $C$DW$241, DW_AT_decl_line(0x8a)
    2555                            .dwattr $C$DW$241, DW_AT_decl_column(0x14)
    2556                    
    2557                    $C$DW$242       .dwtag  DW_TAG_member
    2558                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$23)
    2559                            .dwattr $C$DW$242, DW_AT_name("PDCTL0")
    2560                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("PDCTL0")
    2561                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    2562                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2563                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2564                            .dwattr $C$DW$242, DW_AT_decl_line(0x8b)
    2565                            .dwattr $C$DW$242, DW_AT_decl_column(0x15)
    2566                    
    2567                    $C$DW$243       .dwtag  DW_TAG_member
    2568                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$23)
    2569                            .dwattr $C$DW$243, DW_AT_name("PDCTL1")
    2570                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("PDCTL1")
    2571                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
    2572                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2573                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2574                            .dwattr $C$DW$243, DW_AT_decl_line(0x8c)
    2575                            .dwattr $C$DW$243, DW_AT_decl_column(0x15)
    2576                    
    2577                    $C$DW$244       .dwtag  DW_TAG_member
    2578                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$38)
    2579                            .dwattr $C$DW$244, DW_AT_name("RSVD9")
    2580                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("RSVD9")
    2581                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
    2582                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2583                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2584                            .dwattr $C$DW$244, DW_AT_decl_line(0x8d)
    2585                            .dwattr $C$DW$244, DW_AT_decl_column(0x14)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   48

    2586                    
    2587                    $C$DW$245       .dwtag  DW_TAG_member
    2588                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$23)
    2589                            .dwattr $C$DW$245, DW_AT_name("PDCFG0")
    2590                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("PDCFG0")
    2591                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
    2592                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2593                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2594                            .dwattr $C$DW$245, DW_AT_decl_line(0x8e)
    2595                            .dwattr $C$DW$245, DW_AT_decl_column(0x15)
    2596                    
    2597                    $C$DW$246       .dwtag  DW_TAG_member
    2598                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
    2599                            .dwattr $C$DW$246, DW_AT_name("PDCFG1")
    2600                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("PDCFG1")
    2601                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    2602                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2603                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2604                            .dwattr $C$DW$246, DW_AT_decl_line(0x8f)
    2605                            .dwattr $C$DW$246, DW_AT_decl_column(0x15)
    2606                    
    2607                    $C$DW$247       .dwtag  DW_TAG_member
    2608                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$39)
    2609                            .dwattr $C$DW$247, DW_AT_name("RSVD10")
    2610                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("RSVD10")
    2611                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    2612                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2614                            .dwattr $C$DW$247, DW_AT_decl_line(0x90)
    2615                            .dwattr $C$DW$247, DW_AT_decl_column(0x14)
    2616                    
    2617                    $C$DW$248       .dwtag  DW_TAG_member
    2618                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$40)
    2619                            .dwattr $C$DW$248, DW_AT_name("MDSTAT")
    2620                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("MDSTAT")
    2621                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
    2622                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2623                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2624                            .dwattr $C$DW$248, DW_AT_decl_line(0x91)
    2625                            .dwattr $C$DW$248, DW_AT_decl_column(0x15)
    2626                    
    2627                    $C$DW$249       .dwtag  DW_TAG_member
    2628                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$41)
    2629                            .dwattr $C$DW$249, DW_AT_name("RSVD11")
    2630                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("RSVD11")
    2631                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
    2632                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2633                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2634                            .dwattr $C$DW$249, DW_AT_decl_line(0x92)
    2635                            .dwattr $C$DW$249, DW_AT_decl_column(0x14)
    2636                    
    2637                    $C$DW$250       .dwtag  DW_TAG_member
    2638                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$40)
    2639                            .dwattr $C$DW$250, DW_AT_name("MDCTL")
    2640                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("MDCTL")
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   49

    2641                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
    2642                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2643                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2644                            .dwattr $C$DW$250, DW_AT_decl_line(0x93)
    2645                            .dwattr $C$DW$250, DW_AT_decl_column(0x15)
    2646                    
    2647                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2648                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x77)
    2649                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x11)
    2650                            .dwendtag $C$DW$T$42
    2651                    
    2652                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    2653                            .dwattr $C$DW$T$70, DW_AT_name("CSL_PscRegs")
    2654                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$42)
    2655                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2656                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2657                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x94)
    2658                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    2659                    
    2660                    $C$DW$T$71      .dwtag  DW_TAG_volatile_type
    2661                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2662                    
    2663                    $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    2664                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2665                            .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    2666                    
    2667                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    2668                            .dwattr $C$DW$T$73, DW_AT_name("CSL_PscRegsOvly")
    2669                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2670                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2671                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2672                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x9a)
    2673                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x2b)
    2674                    
    2675                    
    2676                    $C$DW$T$46      .dwtag  DW_TAG_union_type
    2677                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    2678                    $C$DW$251       .dwtag  DW_TAG_member
    2679                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$43)
    2680                            .dwattr $C$DW$251, DW_AT_name("f")
    2681                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("f")
    2682                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2684                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2685                            .dwattr $C$DW$251, DW_AT_decl_line(0xb6)
    2686                            .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    2687                    
    2688                    $C$DW$252       .dwtag  DW_TAG_member
    2689                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$45)
    2690                            .dwattr $C$DW$252, DW_AT_name("a")
    2691                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("a")
    2692                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2694                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2695                            .dwattr $C$DW$252, DW_AT_decl_line(0xb7)
TMS320C6x Assembler PC v8.1.3 Thu Apr 13 15:31:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AS4C16M16SA.asm                                                      PAGE   50

    2696                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    2697                    
    2698                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2699                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xb5)
    2700                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0f)
    2701                            .dwendtag $C$DW$T$46
    2702                    
    2703                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2704                            .dwattr $C$DW$T$74, DW_AT_name("xdc_FloatData")
    2705                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$46)
    2706                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2707                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2708                            .dwattr $C$DW$T$74, DW_AT_decl_line(0xb8)
    2709                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    2710                    
    2711                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2712                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2713                    
    2714                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2715                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2716                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2717                    
    2718                    $C$DW$T$75      .dwtag  DW_TAG_typedef
    2719                            .dwattr $C$DW$T$75, DW_AT_name("xdc_Ptr")
    2720                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$3)
    2721                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2722                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2723                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2e)
    2724                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x1a)
    2725                    
    2726                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    2727                            .dwattr $C$DW$T$76, DW_AT_name("Ptr")
    2728                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    2729                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2730                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2731                            .dwattr $C$DW$T$76, DW_AT_decl_line(0xf6)
    2732                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x19)
    2733                    
    2734                    $C$DW$T$83      .dwtag  DW_TAG_const_type
    2735                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$2)
    2736                    
    2737                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    2738                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2739                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    2740                    
    2741                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    2742                            .dwattr $C$DW$T$85, DW_AT_name("xdc_CPtr")
    2743                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
