TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 20 05:51:08 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    4777                            .dwattr $C$DW$379, DW_AT_decl_column(0x03)
    4778                    
    4779                    $C$DW$380       .dwtag  DW_TAG_enumerator
    4780                            .dwattr $C$DW$380, DW_AT_name("CSL_EDMATC_0")
    4781                            .dwattr $C$DW$380, DW_AT_const_value(0x00)
    4782                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    4783                            .dwattr $C$DW$380, DW_AT_decl_line(0x41a)
    4784                            .dwattr $C$DW$380, DW_AT_decl_column(0x03)
    4785                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   88

    4786                    $C$DW$381       .dwtag  DW_TAG_enumerator
    4787                            .dwattr $C$DW$381, DW_AT_name("CSL_EDMATC_1")
    4788                            .dwattr $C$DW$381, DW_AT_const_value(0x01)
    4789                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    4790                            .dwattr $C$DW$381, DW_AT_decl_line(0x41b)
    4791                            .dwattr $C$DW$381, DW_AT_decl_column(0x03)
    4792                    
    4793                            .dwattr $C$DW$T$686, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    4794                            .dwattr $C$DW$T$686, DW_AT_decl_line(0x418)
    4795                            .dwattr $C$DW$T$686, DW_AT_decl_column(0x0e)
    4796                            .dwendtag $C$DW$T$686
    4797                    
    4798                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    4799                            .dwattr $C$DW$T$687, DW_AT_name("CSL_EdmatcNum")
    4800                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$686)
    4801                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    4802                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    4803                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x41c)
    4804                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x03)
    4805                    
    4806                    
    4807                    $C$DW$T$688     .dwtag  DW_TAG_enumeration_type
    4808                            .dwattr $C$DW$T$688, DW_AT_byte_size(0x04)
    4809                    $C$DW$382       .dwtag  DW_TAG_enumerator
    4810                            .dwattr $C$DW$382, DW_AT_name("CSL_DAT_PRI_DEFAULT")
    4811                            .dwattr $C$DW$382, DW_AT_const_value(0x00)
    4812                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    4813                            .dwattr $C$DW$382, DW_AT_decl_line(0x449)
    4814                            .dwattr $C$DW$382, DW_AT_decl_column(0x05)
    4815                    
    4816                    $C$DW$383       .dwtag  DW_TAG_enumerator
    4817                            .dwattr $C$DW$383, DW_AT_name("CSL_DAT_PRI_0")
    4818                            .dwattr $C$DW$383, DW_AT_const_value(0x00)
    4819                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    4820                            .dwattr $C$DW$383, DW_AT_decl_line(0x44a)
    4821                            .dwattr $C$DW$383, DW_AT_decl_column(0x05)
    4822                    
    4823                    $C$DW$384       .dwtag  DW_TAG_enumerator
    4824                            .dwattr $C$DW$384, DW_AT_name("CSL_DAT_PRI_1")
    4825                            .dwattr $C$DW$384, DW_AT_const_value(0x01)
    4826                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    4827                            .dwattr $C$DW$384, DW_AT_decl_line(0x44b)
    4828                            .dwattr $C$DW$384, DW_AT_decl_column(0x05)
    4829                    
    4830                            .dwattr $C$DW$T$688, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    4831                            .dwattr $C$DW$T$688, DW_AT_decl_line(0x448)
    4832                            .dwattr $C$DW$T$688, DW_AT_decl_column(0x0e)
    4833                            .dwendtag $C$DW$T$688
    4834                    
    4835                    $C$DW$T$689     .dwtag  DW_TAG_typedef
    4836                            .dwattr $C$DW$T$689, DW_AT_name("CSL_DatPriority")
    4837                            .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$688)
    4838                            .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    4839                            .dwattr $C$DW$T$689, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    4840                            .dwattr $C$DW$T$689, DW_AT_decl_line(0x44c)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   89

    4841                            .dwattr $C$DW$T$689, DW_AT_decl_column(0x03)
    4842                    
    4843                    
    4844                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    4845                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x190)
    4846                    $C$DW$385       .dwtag  DW_TAG_member
    4847                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$155)
    4848                            .dwattr $C$DW$385, DW_AT_name("REVID")
    4849                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("REVID")
    4850                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4851                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4852                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4853                            .dwattr $C$DW$385, DW_AT_decl_line(0x43)
    4854                            .dwattr $C$DW$385, DW_AT_decl_column(0x15)
    4855                    
    4856                    $C$DW$386       .dwtag  DW_TAG_member
    4857                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$161)
    4858                            .dwattr $C$DW$386, DW_AT_name("RSVD0")
    4859                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("RSVD0")
    4860                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4861                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4862                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4863                            .dwattr $C$DW$386, DW_AT_decl_line(0x44)
    4864                            .dwattr $C$DW$386, DW_AT_decl_column(0x14)
    4865                    
    4866                    $C$DW$387       .dwtag  DW_TAG_member
    4867                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$155)
    4868                            .dwattr $C$DW$387, DW_AT_name("DIEIDR0")
    4869                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("DIEIDR0")
    4870                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4871                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4872                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4873                            .dwattr $C$DW$387, DW_AT_decl_line(0x45)
    4874                            .dwattr $C$DW$387, DW_AT_decl_column(0x15)
    4875                    
    4876                    $C$DW$388       .dwtag  DW_TAG_member
    4877                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$155)
    4878                            .dwattr $C$DW$388, DW_AT_name("DIEIDR1")
    4879                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("DIEIDR1")
    4880                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4881                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4882                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4883                            .dwattr $C$DW$388, DW_AT_decl_line(0x46)
    4884                            .dwattr $C$DW$388, DW_AT_decl_column(0x15)
    4885                    
    4886                    $C$DW$389       .dwtag  DW_TAG_member
    4887                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$155)
    4888                            .dwattr $C$DW$389, DW_AT_name("DIEIDR2")
    4889                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("DIEIDR2")
    4890                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4891                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4892                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4893                            .dwattr $C$DW$389, DW_AT_decl_line(0x47)
    4894                            .dwattr $C$DW$389, DW_AT_decl_column(0x15)
    4895                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   90

    4896                    $C$DW$390       .dwtag  DW_TAG_member
    4897                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$155)
    4898                            .dwattr $C$DW$390, DW_AT_name("DIEIDR3")
    4899                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("DIEIDR3")
    4900                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4901                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4902                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4903                            .dwattr $C$DW$390, DW_AT_decl_line(0x48)
    4904                            .dwattr $C$DW$390, DW_AT_decl_column(0x15)
    4905                    
    4906                    $C$DW$391       .dwtag  DW_TAG_member
    4907                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$155)
    4908                            .dwattr $C$DW$391, DW_AT_name("DEVIDR0")
    4909                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("DEVIDR0")
    4910                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4911                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4912                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4913                            .dwattr $C$DW$391, DW_AT_decl_line(0x49)
    4914                            .dwattr $C$DW$391, DW_AT_decl_column(0x15)
    4915                    
    4916                    $C$DW$392       .dwtag  DW_TAG_member
    4917                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$161)
    4918                            .dwattr $C$DW$392, DW_AT_name("RSVD1")
    4919                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("RSVD1")
    4920                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4921                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4922                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4923                            .dwattr $C$DW$392, DW_AT_decl_line(0x4a)
    4924                            .dwattr $C$DW$392, DW_AT_decl_column(0x14)
    4925                    
    4926                    $C$DW$393       .dwtag  DW_TAG_member
    4927                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$155)
    4928                            .dwattr $C$DW$393, DW_AT_name("BOOTCFG")
    4929                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("BOOTCFG")
    4930                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4931                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4932                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4933                            .dwattr $C$DW$393, DW_AT_decl_line(0x4b)
    4934                            .dwattr $C$DW$393, DW_AT_decl_column(0x15)
    4935                    
    4936                    $C$DW$394       .dwtag  DW_TAG_member
    4937                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$155)
    4938                            .dwattr $C$DW$394, DW_AT_name("CHIPREVIDR")
    4939                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("CHIPREVIDR")
    4940                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4941                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4942                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4943                            .dwattr $C$DW$394, DW_AT_decl_line(0x4c)
    4944                            .dwattr $C$DW$394, DW_AT_decl_column(0x15)
    4945                    
    4946                    $C$DW$395       .dwtag  DW_TAG_member
    4947                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$162)
    4948                            .dwattr $C$DW$395, DW_AT_name("RSVD2")
    4949                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("RSVD2")
    4950                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   91

    4951                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4952                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4953                            .dwattr $C$DW$395, DW_AT_decl_line(0x4d)
    4954                            .dwattr $C$DW$395, DW_AT_decl_column(0x14)
    4955                    
    4956                    $C$DW$396       .dwtag  DW_TAG_member
    4957                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$155)
    4958                            .dwattr $C$DW$396, DW_AT_name("KICK0R")
    4959                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("KICK0R")
    4960                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4961                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4962                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4963                            .dwattr $C$DW$396, DW_AT_decl_line(0x4e)
    4964                            .dwattr $C$DW$396, DW_AT_decl_column(0x15)
    4965                    
    4966                    $C$DW$397       .dwtag  DW_TAG_member
    4967                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$155)
    4968                            .dwattr $C$DW$397, DW_AT_name("KICK1R")
    4969                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("KICK1R")
    4970                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4971                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4972                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4973                            .dwattr $C$DW$397, DW_AT_decl_line(0x4f)
    4974                            .dwattr $C$DW$397, DW_AT_decl_column(0x15)
    4975                    
    4976                    $C$DW$398       .dwtag  DW_TAG_member
    4977                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$155)
    4978                            .dwattr $C$DW$398, DW_AT_name("HOST0CFG")
    4979                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("HOST0CFG")
    4980                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4981                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4982                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4983                            .dwattr $C$DW$398, DW_AT_decl_line(0x50)
    4984                            .dwattr $C$DW$398, DW_AT_decl_column(0x15)
    4985                    
    4986                    $C$DW$399       .dwtag  DW_TAG_member
    4987                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$155)
    4988                            .dwattr $C$DW$399, DW_AT_name("HOST1CFG")
    4989                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("HOST1CFG")
    4990                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4991                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4992                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4993                            .dwattr $C$DW$399, DW_AT_decl_line(0x51)
    4994                            .dwattr $C$DW$399, DW_AT_decl_column(0x15)
    4995                    
    4996                    $C$DW$400       .dwtag  DW_TAG_member
    4997                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$163)
    4998                            .dwattr $C$DW$400, DW_AT_name("RSVD3")
    4999                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("RSVD3")
    5000                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5001                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5002                            .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5003                            .dwattr $C$DW$400, DW_AT_decl_line(0x52)
    5004                            .dwattr $C$DW$400, DW_AT_decl_column(0x14)
    5005                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   92

    5006                    $C$DW$401       .dwtag  DW_TAG_member
    5007                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$155)
    5008                            .dwattr $C$DW$401, DW_AT_name("IRAWSTAT")
    5009                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("IRAWSTAT")
    5010                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5011                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5012                            .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5013                            .dwattr $C$DW$401, DW_AT_decl_line(0x53)
    5014                            .dwattr $C$DW$401, DW_AT_decl_column(0x15)
    5015                    
    5016                    $C$DW$402       .dwtag  DW_TAG_member
    5017                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$155)
    5018                            .dwattr $C$DW$402, DW_AT_name("IENSTAT")
    5019                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("IENSTAT")
    5020                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    5021                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5022                            .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5023                            .dwattr $C$DW$402, DW_AT_decl_line(0x54)
    5024                            .dwattr $C$DW$402, DW_AT_decl_column(0x15)
    5025                    
    5026                    $C$DW$403       .dwtag  DW_TAG_member
    5027                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$155)
    5028                            .dwattr $C$DW$403, DW_AT_name("IENSET")
    5029                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("IENSET")
    5030                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5031                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5032                            .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5033                            .dwattr $C$DW$403, DW_AT_decl_line(0x55)
    5034                            .dwattr $C$DW$403, DW_AT_decl_column(0x15)
    5035                    
    5036                    $C$DW$404       .dwtag  DW_TAG_member
    5037                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$155)
    5038                            .dwattr $C$DW$404, DW_AT_name("IENCLR")
    5039                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("IENCLR")
    5040                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5041                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5042                            .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5043                            .dwattr $C$DW$404, DW_AT_decl_line(0x56)
    5044                            .dwattr $C$DW$404, DW_AT_decl_column(0x15)
    5045                    
    5046                    $C$DW$405       .dwtag  DW_TAG_member
    5047                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$155)
    5048                            .dwattr $C$DW$405, DW_AT_name("EOI")
    5049                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("EOI")
    5050                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5051                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5052                            .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5053                            .dwattr $C$DW$405, DW_AT_decl_line(0x57)
    5054                            .dwattr $C$DW$405, DW_AT_decl_column(0x15)
    5055                    
    5056                    $C$DW$406       .dwtag  DW_TAG_member
    5057                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$155)
    5058                            .dwattr $C$DW$406, DW_AT_name("FLTADDRR")
    5059                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("FLTADDRR")
    5060                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   93

    5061                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5062                            .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5063                            .dwattr $C$DW$406, DW_AT_decl_line(0x58)
    5064                            .dwattr $C$DW$406, DW_AT_decl_column(0x15)
    5065                    
    5066                    $C$DW$407       .dwtag  DW_TAG_member
    5067                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$155)
    5068                            .dwattr $C$DW$407, DW_AT_name("FLTSTAT")
    5069                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("FLTSTAT")
    5070                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    5071                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5072                            .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5073                            .dwattr $C$DW$407, DW_AT_decl_line(0x59)
    5074                            .dwattr $C$DW$407, DW_AT_decl_column(0x15)
    5075                    
    5076                    $C$DW$408       .dwtag  DW_TAG_member
    5077                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$164)
    5078                            .dwattr $C$DW$408, DW_AT_name("RSVD4")
    5079                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("RSVD4")
    5080                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    5081                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5082                            .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5083                            .dwattr $C$DW$408, DW_AT_decl_line(0x5a)
    5084                            .dwattr $C$DW$408, DW_AT_decl_column(0x14)
    5085                    
    5086                    $C$DW$409       .dwtag  DW_TAG_member
    5087                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$155)
    5088                            .dwattr $C$DW$409, DW_AT_name("MSTPRI0")
    5089                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("MSTPRI0")
    5090                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    5091                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5092                            .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5093                            .dwattr $C$DW$409, DW_AT_decl_line(0x5b)
    5094                            .dwattr $C$DW$409, DW_AT_decl_column(0x15)
    5095                    
    5096                    $C$DW$410       .dwtag  DW_TAG_member
    5097                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$155)
    5098                            .dwattr $C$DW$410, DW_AT_name("MSTPRI1")
    5099                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("MSTPRI1")
    5100                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    5101                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5102                            .dwattr $C$DW$410, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5103                            .dwattr $C$DW$410, DW_AT_decl_line(0x5c)
    5104                            .dwattr $C$DW$410, DW_AT_decl_column(0x15)
    5105                    
    5106                    $C$DW$411       .dwtag  DW_TAG_member
    5107                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$155)
    5108                            .dwattr $C$DW$411, DW_AT_name("MSTPRI2")
    5109                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("MSTPRI2")
    5110                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    5111                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5112                            .dwattr $C$DW$411, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5113                            .dwattr $C$DW$411, DW_AT_decl_line(0x5d)
    5114                            .dwattr $C$DW$411, DW_AT_decl_column(0x15)
    5115                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   94

    5116                    $C$DW$412       .dwtag  DW_TAG_member
    5117                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$161)
    5118                            .dwattr $C$DW$412, DW_AT_name("RSVD5")
    5119                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("RSVD5")
    5120                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    5121                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5122                            .dwattr $C$DW$412, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5123                            .dwattr $C$DW$412, DW_AT_decl_line(0x5e)
    5124                            .dwattr $C$DW$412, DW_AT_decl_column(0x14)
    5125                    
    5126                    $C$DW$413       .dwtag  DW_TAG_member
    5127                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$155)
    5128                            .dwattr $C$DW$413, DW_AT_name("PINMUX0")
    5129                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("PINMUX0")
    5130                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    5131                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5132                            .dwattr $C$DW$413, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5133                            .dwattr $C$DW$413, DW_AT_decl_line(0x5f)
    5134                            .dwattr $C$DW$413, DW_AT_decl_column(0x15)
    5135                    
    5136                    $C$DW$414       .dwtag  DW_TAG_member
    5137                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$155)
    5138                            .dwattr $C$DW$414, DW_AT_name("PINMUX1")
    5139                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("PINMUX1")
    5140                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    5141                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5142                            .dwattr $C$DW$414, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5143                            .dwattr $C$DW$414, DW_AT_decl_line(0x60)
    5144                            .dwattr $C$DW$414, DW_AT_decl_column(0x15)
    5145                    
    5146                    $C$DW$415       .dwtag  DW_TAG_member
    5147                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$155)
    5148                            .dwattr $C$DW$415, DW_AT_name("PINMUX2")
    5149                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("PINMUX2")
    5150                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    5151                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5152                            .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5153                            .dwattr $C$DW$415, DW_AT_decl_line(0x61)
    5154                            .dwattr $C$DW$415, DW_AT_decl_column(0x15)
    5155                    
    5156                    $C$DW$416       .dwtag  DW_TAG_member
    5157                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$155)
    5158                            .dwattr $C$DW$416, DW_AT_name("PINMUX3")
    5159                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("PINMUX3")
    5160                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    5161                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5162                            .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5163                            .dwattr $C$DW$416, DW_AT_decl_line(0x62)
    5164                            .dwattr $C$DW$416, DW_AT_decl_column(0x15)
    5165                    
    5166                    $C$DW$417       .dwtag  DW_TAG_member
    5167                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$155)
    5168                            .dwattr $C$DW$417, DW_AT_name("PINMUX4")
    5169                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("PINMUX4")
    5170                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   95

    5171                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5172                            .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5173                            .dwattr $C$DW$417, DW_AT_decl_line(0x63)
    5174                            .dwattr $C$DW$417, DW_AT_decl_column(0x15)
    5175                    
    5176                    $C$DW$418       .dwtag  DW_TAG_member
    5177                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$155)
    5178                            .dwattr $C$DW$418, DW_AT_name("PINMUX5")
    5179                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("PINMUX5")
    5180                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    5181                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5182                            .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5183                            .dwattr $C$DW$418, DW_AT_decl_line(0x64)
    5184                            .dwattr $C$DW$418, DW_AT_decl_column(0x15)
    5185                    
    5186                    $C$DW$419       .dwtag  DW_TAG_member
    5187                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$155)
    5188                            .dwattr $C$DW$419, DW_AT_name("PINMUX6")
    5189                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("PINMUX6")
    5190                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    5191                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5192                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5193                            .dwattr $C$DW$419, DW_AT_decl_line(0x65)
    5194                            .dwattr $C$DW$419, DW_AT_decl_column(0x15)
    5195                    
    5196                    $C$DW$420       .dwtag  DW_TAG_member
    5197                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$155)
    5198                            .dwattr $C$DW$420, DW_AT_name("PINMUX7")
    5199                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("PINMUX7")
    5200                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    5201                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5202                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5203                            .dwattr $C$DW$420, DW_AT_decl_line(0x66)
    5204                            .dwattr $C$DW$420, DW_AT_decl_column(0x15)
    5205                    
    5206                    $C$DW$421       .dwtag  DW_TAG_member
    5207                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$155)
    5208                            .dwattr $C$DW$421, DW_AT_name("PINMUX8")
    5209                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("PINMUX8")
    5210                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    5211                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5212                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5213                            .dwattr $C$DW$421, DW_AT_decl_line(0x67)
    5214                            .dwattr $C$DW$421, DW_AT_decl_column(0x15)
    5215                    
    5216                    $C$DW$422       .dwtag  DW_TAG_member
    5217                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$155)
    5218                            .dwattr $C$DW$422, DW_AT_name("PINMUX9")
    5219                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("PINMUX9")
    5220                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    5221                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5222                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5223                            .dwattr $C$DW$422, DW_AT_decl_line(0x68)
    5224                            .dwattr $C$DW$422, DW_AT_decl_column(0x15)
    5225                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   96

    5226                    $C$DW$423       .dwtag  DW_TAG_member
    5227                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$155)
    5228                            .dwattr $C$DW$423, DW_AT_name("PINMUX10")
    5229                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("PINMUX10")
    5230                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    5231                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5232                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5233                            .dwattr $C$DW$423, DW_AT_decl_line(0x69)
    5234                            .dwattr $C$DW$423, DW_AT_decl_column(0x15)
    5235                    
    5236                    $C$DW$424       .dwtag  DW_TAG_member
    5237                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$155)
    5238                            .dwattr $C$DW$424, DW_AT_name("PINMUX11")
    5239                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("PINMUX11")
    5240                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    5241                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5242                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5243                            .dwattr $C$DW$424, DW_AT_decl_line(0x6a)
    5244                            .dwattr $C$DW$424, DW_AT_decl_column(0x15)
    5245                    
    5246                    $C$DW$425       .dwtag  DW_TAG_member
    5247                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$155)
    5248                            .dwattr $C$DW$425, DW_AT_name("PINMUX12")
    5249                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("PINMUX12")
    5250                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    5251                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5252                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5253                            .dwattr $C$DW$425, DW_AT_decl_line(0x6b)
    5254                            .dwattr $C$DW$425, DW_AT_decl_column(0x15)
    5255                    
    5256                    $C$DW$426       .dwtag  DW_TAG_member
    5257                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$155)
    5258                            .dwattr $C$DW$426, DW_AT_name("PINMUX13")
    5259                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("PINMUX13")
    5260                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    5261                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5262                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5263                            .dwattr $C$DW$426, DW_AT_decl_line(0x6c)
    5264                            .dwattr $C$DW$426, DW_AT_decl_column(0x15)
    5265                    
    5266                    $C$DW$427       .dwtag  DW_TAG_member
    5267                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$155)
    5268                            .dwattr $C$DW$427, DW_AT_name("PINMUX14")
    5269                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("PINMUX14")
    5270                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    5271                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5272                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5273                            .dwattr $C$DW$427, DW_AT_decl_line(0x6d)
    5274                            .dwattr $C$DW$427, DW_AT_decl_column(0x15)
    5275                    
    5276                    $C$DW$428       .dwtag  DW_TAG_member
    5277                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$155)
    5278                            .dwattr $C$DW$428, DW_AT_name("PINMUX15")
    5279                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("PINMUX15")
    5280                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   97

    5281                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5282                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5283                            .dwattr $C$DW$428, DW_AT_decl_line(0x6e)
    5284                            .dwattr $C$DW$428, DW_AT_decl_column(0x15)
    5285                    
    5286                    $C$DW$429       .dwtag  DW_TAG_member
    5287                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$155)
    5288                            .dwattr $C$DW$429, DW_AT_name("PINMUX16")
    5289                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("PINMUX16")
    5290                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    5291                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5292                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5293                            .dwattr $C$DW$429, DW_AT_decl_line(0x6f)
    5294                            .dwattr $C$DW$429, DW_AT_decl_column(0x15)
    5295                    
    5296                    $C$DW$430       .dwtag  DW_TAG_member
    5297                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$155)
    5298                            .dwattr $C$DW$430, DW_AT_name("PINMUX17")
    5299                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("PINMUX17")
    5300                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    5301                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5302                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5303                            .dwattr $C$DW$430, DW_AT_decl_line(0x70)
    5304                            .dwattr $C$DW$430, DW_AT_decl_column(0x15)
    5305                    
    5306                    $C$DW$431       .dwtag  DW_TAG_member
    5307                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$155)
    5308                            .dwattr $C$DW$431, DW_AT_name("PINMUX18")
    5309                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("PINMUX18")
    5310                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    5311                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5312                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5313                            .dwattr $C$DW$431, DW_AT_decl_line(0x71)
    5314                            .dwattr $C$DW$431, DW_AT_decl_column(0x15)
    5315                    
    5316                    $C$DW$432       .dwtag  DW_TAG_member
    5317                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$155)
    5318                            .dwattr $C$DW$432, DW_AT_name("PINMUX19")
    5319                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("PINMUX19")
    5320                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    5321                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5322                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5323                            .dwattr $C$DW$432, DW_AT_decl_line(0x72)
    5324                            .dwattr $C$DW$432, DW_AT_decl_column(0x15)
    5325                    
    5326                    $C$DW$433       .dwtag  DW_TAG_member
    5327                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$155)
    5328                            .dwattr $C$DW$433, DW_AT_name("SUSPSRC")
    5329                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("SUSPSRC")
    5330                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    5331                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5332                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5333                            .dwattr $C$DW$433, DW_AT_decl_line(0x73)
    5334                            .dwattr $C$DW$433, DW_AT_decl_column(0x15)
    5335                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   98

    5336                    $C$DW$434       .dwtag  DW_TAG_member
    5337                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$155)
    5338                            .dwattr $C$DW$434, DW_AT_name("CHIPSIG")
    5339                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("CHIPSIG")
    5340                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    5341                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5342                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5343                            .dwattr $C$DW$434, DW_AT_decl_line(0x74)
    5344                            .dwattr $C$DW$434, DW_AT_decl_column(0x15)
    5345                    
    5346                    $C$DW$435       .dwtag  DW_TAG_member
    5347                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$155)
    5348                            .dwattr $C$DW$435, DW_AT_name("CHIPSIG_CLR")
    5349                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    5350                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    5351                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5352                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5353                            .dwattr $C$DW$435, DW_AT_decl_line(0x75)
    5354                            .dwattr $C$DW$435, DW_AT_decl_column(0x15)
    5355                    
    5356                    $C$DW$436       .dwtag  DW_TAG_member
    5357                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$155)
    5358                            .dwattr $C$DW$436, DW_AT_name("CFGCHIP0")
    5359                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("CFGCHIP0")
    5360                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    5361                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5362                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5363                            .dwattr $C$DW$436, DW_AT_decl_line(0x76)
    5364                            .dwattr $C$DW$436, DW_AT_decl_column(0x15)
    5365                    
    5366                    $C$DW$437       .dwtag  DW_TAG_member
    5367                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$155)
    5368                            .dwattr $C$DW$437, DW_AT_name("CFGCHIP1")
    5369                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("CFGCHIP1")
    5370                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    5371                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5372                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5373                            .dwattr $C$DW$437, DW_AT_decl_line(0x77)
    5374                            .dwattr $C$DW$437, DW_AT_decl_column(0x15)
    5375                    
    5376                    $C$DW$438       .dwtag  DW_TAG_member
    5377                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$155)
    5378                            .dwattr $C$DW$438, DW_AT_name("CFGCHIP2")
    5379                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("CFGCHIP2")
    5380                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    5381                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5382                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5383                            .dwattr $C$DW$438, DW_AT_decl_line(0x78)
    5384                            .dwattr $C$DW$438, DW_AT_decl_column(0x15)
    5385                    
    5386                    $C$DW$439       .dwtag  DW_TAG_member
    5387                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$155)
    5388                            .dwattr $C$DW$439, DW_AT_name("CFGCHIP3")
    5389                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("CFGCHIP3")
    5390                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   99

    5391                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5392                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5393                            .dwattr $C$DW$439, DW_AT_decl_line(0x79)
    5394                            .dwattr $C$DW$439, DW_AT_decl_column(0x15)
    5395                    
    5396                    $C$DW$440       .dwtag  DW_TAG_member
    5397                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$155)
    5398                            .dwattr $C$DW$440, DW_AT_name("CFGCHIP4")
    5399                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("CFGCHIP4")
    5400                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    5401                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5402                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    5403                            .dwattr $C$DW$440, DW_AT_decl_line(0x7a)
    5404                            .dwattr $C$DW$440, DW_AT_decl_column(0x15)
    5405                    
    5406                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    5407                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x42)
    5408                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x11)
    5409                            .dwendtag $C$DW$T$165
    5410                    
    5411                    $C$DW$T$692     .dwtag  DW_TAG_typedef
    5412                            .dwattr $C$DW$T$692, DW_AT_name("CSL_SyscfgRegs")
    5413                            .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$165)
    5414                            .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    5415                            .dwattr $C$DW$T$692, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    5416                            .dwattr $C$DW$T$692, DW_AT_decl_line(0x7b)
    5417                            .dwattr $C$DW$T$692, DW_AT_decl_column(0x03)
    5418                    
    5419                    $C$DW$T$693     .dwtag  DW_TAG_volatile_type
    5420                            .dwattr $C$DW$T$693, DW_AT_type(*$C$DW$T$692)
    5421                    
    5422                    $C$DW$T$694     .dwtag  DW_TAG_pointer_type
    5423                            .dwattr $C$DW$T$694, DW_AT_type(*$C$DW$T$693)
    5424                            .dwattr $C$DW$T$694, DW_AT_address_class(0x20)
    5425                    
    5426                    $C$DW$T$695     .dwtag  DW_TAG_typedef
    5427                            .dwattr $C$DW$T$695, DW_AT_name("CSL_SyscfgRegsOvly")
    5428                            .dwattr $C$DW$T$695, DW_AT_type(*$C$DW$T$694)
    5429                            .dwattr $C$DW$T$695, DW_AT_language(DW_LANG_C)
    5430                            .dwattr $C$DW$T$695, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    5431                            .dwattr $C$DW$T$695, DW_AT_decl_line(0x80)
    5432                            .dwattr $C$DW$T$695, DW_AT_decl_column(0x2e)
    5433                    
    5434                    $C$DW$T$696     .dwtag  DW_TAG_const_type
    5435                            .dwattr $C$DW$T$696, DW_AT_type(*$C$DW$T$695)
    5436                    
    5437                    
    5438                    $C$DW$T$169     .dwtag  DW_TAG_structure_type
    5439                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x08)
    5440                    $C$DW$441       .dwtag  DW_TAG_member
    5441                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$10)
    5442                            .dwattr $C$DW$441, DW_AT_name("length")
    5443                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("length")
    5444                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5445                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  100

    5446                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5447                            .dwattr $C$DW$441, DW_AT_decl_line(0x14d)
    5448                            .dwattr $C$DW$441, DW_AT_decl_column(0x16)
    5449                    
    5450                    $C$DW$442       .dwtag  DW_TAG_member
    5451                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$168)
    5452                            .dwattr $C$DW$442, DW_AT_name("elem")
    5453                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("elem")
    5454                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5455                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5456                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5457                            .dwattr $C$DW$442, DW_AT_decl_line(0x14d)
    5458                            .dwattr $C$DW$442, DW_AT_decl_column(0x40)
    5459                    
    5460                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5461                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x14d)
    5462                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    5463                            .dwendtag $C$DW$T$169
    5464                    
    5465                    $C$DW$T$697     .dwtag  DW_TAG_typedef
    5466                            .dwattr $C$DW$T$697, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    5467                            .dwattr $C$DW$T$697, DW_AT_type(*$C$DW$T$169)
    5468                            .dwattr $C$DW$T$697, DW_AT_language(DW_LANG_C)
    5469                            .dwattr $C$DW$T$697, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5470                            .dwattr $C$DW$T$697, DW_AT_decl_line(0x14d)
    5471                            .dwattr $C$DW$T$697, DW_AT_decl_column(0x48)
    5472                    
    5473                    $C$DW$T$698     .dwtag  DW_TAG_typedef
    5474                            .dwattr $C$DW$T$698, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    5475                            .dwattr $C$DW$T$698, DW_AT_type(*$C$DW$T$697)
    5476                            .dwattr $C$DW$T$698, DW_AT_language(DW_LANG_C)
    5477                            .dwattr $C$DW$T$698, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5478                            .dwattr $C$DW$T$698, DW_AT_decl_line(0x14f)
    5479                            .dwattr $C$DW$T$698, DW_AT_decl_column(0x2b)
    5480                    
    5481                    
    5482                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    5483                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x08)
    5484                    $C$DW$443       .dwtag  DW_TAG_member
    5485                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$10)
    5486                            .dwattr $C$DW$443, DW_AT_name("length")
    5487                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("length")
    5488                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5489                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5490                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5491                            .dwattr $C$DW$443, DW_AT_decl_line(0x14e)
    5492                            .dwattr $C$DW$443, DW_AT_decl_column(0x16)
    5493                    
    5494                    $C$DW$444       .dwtag  DW_TAG_member
    5495                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$168)
    5496                            .dwattr $C$DW$444, DW_AT_name("elem")
    5497                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("elem")
    5498                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5499                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5500                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  101

    5501                            .dwattr $C$DW$444, DW_AT_decl_line(0x14e)
    5502                            .dwattr $C$DW$444, DW_AT_decl_column(0x40)
    5503                    
    5504                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5505                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x14e)
    5506                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
    5507                            .dwendtag $C$DW$T$170
    5508                    
    5509                    $C$DW$T$699     .dwtag  DW_TAG_typedef
    5510                            .dwattr $C$DW$T$699, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    5511                            .dwattr $C$DW$T$699, DW_AT_type(*$C$DW$T$170)
    5512                            .dwattr $C$DW$T$699, DW_AT_language(DW_LANG_C)
    5513                            .dwattr $C$DW$T$699, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5514                            .dwattr $C$DW$T$699, DW_AT_decl_line(0x14e)
    5515                            .dwattr $C$DW$T$699, DW_AT_decl_column(0x48)
    5516                    
    5517                    $C$DW$T$700     .dwtag  DW_TAG_typedef
    5518                            .dwattr $C$DW$T$700, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    5519                            .dwattr $C$DW$T$700, DW_AT_type(*$C$DW$T$699)
    5520                            .dwattr $C$DW$T$700, DW_AT_language(DW_LANG_C)
    5521                            .dwattr $C$DW$T$700, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    5522                            .dwattr $C$DW$T$700, DW_AT_decl_line(0x150)
    5523                            .dwattr $C$DW$T$700, DW_AT_decl_column(0x2c)
    5524                    
    5525                    
    5526                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    5527                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x08)
    5528                    $C$DW$445       .dwtag  DW_TAG_member
    5529                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$10)
    5530                            .dwattr $C$DW$445, DW_AT_name("length")
    5531                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("length")
    5532                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5533                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5534                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5535                            .dwattr $C$DW$445, DW_AT_decl_line(0x29b)
    5536                            .dwattr $C$DW$445, DW_AT_decl_column(0x16)
    5537                    
    5538                    $C$DW$446       .dwtag  DW_TAG_member
    5539                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$173)
    5540                            .dwattr $C$DW$446, DW_AT_name("elem")
    5541                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("elem")
    5542                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5543                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5544                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5545                            .dwattr $C$DW$446, DW_AT_decl_line(0x29b)
    5546                            .dwattr $C$DW$446, DW_AT_decl_column(0x41)
    5547                    
    5548                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5549                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x29b)
    5550                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x10)
    5551                            .dwendtag $C$DW$T$174
    5552                    
    5553                    $C$DW$T$701     .dwtag  DW_TAG_typedef
    5554                            .dwattr $C$DW$T$701, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
    5555                            .dwattr $C$DW$T$701, DW_AT_type(*$C$DW$T$174)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  102

    5556                            .dwattr $C$DW$T$701, DW_AT_language(DW_LANG_C)
    5557                            .dwattr $C$DW$T$701, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5558                            .dwattr $C$DW$T$701, DW_AT_decl_line(0x29b)
    5559                            .dwattr $C$DW$T$701, DW_AT_decl_column(0x49)
    5560                    
    5561                    $C$DW$T$702     .dwtag  DW_TAG_typedef
    5562                            .dwattr $C$DW$T$702, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    5563                            .dwattr $C$DW$T$702, DW_AT_type(*$C$DW$T$701)
    5564                            .dwattr $C$DW$T$702, DW_AT_language(DW_LANG_C)
    5565                            .dwattr $C$DW$T$702, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5566                            .dwattr $C$DW$T$702, DW_AT_decl_line(0x29d)
    5567                            .dwattr $C$DW$T$702, DW_AT_decl_column(0x2c)
    5568                    
    5569                    
    5570                    $C$DW$T$175     .dwtag  DW_TAG_structure_type
    5571                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x08)
    5572                    $C$DW$447       .dwtag  DW_TAG_member
    5573                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$10)
    5574                            .dwattr $C$DW$447, DW_AT_name("length")
    5575                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("length")
    5576                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5577                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5578                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5579                            .dwattr $C$DW$447, DW_AT_decl_line(0x29c)
    5580                            .dwattr $C$DW$447, DW_AT_decl_column(0x16)
    5581                    
    5582                    $C$DW$448       .dwtag  DW_TAG_member
    5583                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$173)
    5584                            .dwattr $C$DW$448, DW_AT_name("elem")
    5585                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("elem")
    5586                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5587                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5588                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5589                            .dwattr $C$DW$448, DW_AT_decl_line(0x29c)
    5590                            .dwattr $C$DW$448, DW_AT_decl_column(0x41)
    5591                    
    5592                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5593                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x29c)
    5594                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x10)
    5595                            .dwendtag $C$DW$T$175
    5596                    
    5597                    $C$DW$T$703     .dwtag  DW_TAG_typedef
    5598                            .dwattr $C$DW$T$703, DW_AT_name("__CARRAY1_ti_sysbios_knl_Task_hooks")
    5599                            .dwattr $C$DW$T$703, DW_AT_type(*$C$DW$T$175)
    5600                            .dwattr $C$DW$T$703, DW_AT_language(DW_LANG_C)
    5601                            .dwattr $C$DW$T$703, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5602                            .dwattr $C$DW$T$703, DW_AT_decl_line(0x29c)
    5603                            .dwattr $C$DW$T$703, DW_AT_decl_column(0x49)
    5604                    
    5605                    $C$DW$T$704     .dwtag  DW_TAG_typedef
    5606                            .dwattr $C$DW$T$704, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    5607                            .dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$703)
    5608                            .dwattr $C$DW$T$704, DW_AT_language(DW_LANG_C)
    5609                            .dwattr $C$DW$T$704, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    5610                            .dwattr $C$DW$T$704, DW_AT_decl_line(0x29e)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  103

    5611                            .dwattr $C$DW$T$704, DW_AT_decl_column(0x2d)
    5612                    
    5613                    
    5614                    $C$DW$T$184     .dwtag  DW_TAG_structure_type
    5615                            .dwattr $C$DW$T$184, DW_AT_byte_size(0xa80)
    5616                    $C$DW$449       .dwtag  DW_TAG_member
    5617                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$155)
    5618                            .dwattr $C$DW$449, DW_AT_name("REVID")
    5619                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("REVID")
    5620                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5621                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5622                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5623                            .dwattr $C$DW$449, DW_AT_decl_line(0x7b)
    5624                            .dwattr $C$DW$449, DW_AT_decl_column(0x15)
    5625                    
    5626                    $C$DW$450       .dwtag  DW_TAG_member
    5627                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$164)
    5628                            .dwattr $C$DW$450, DW_AT_name("RSVD0")
    5629                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("RSVD0")
    5630                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5631                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5632                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5633                            .dwattr $C$DW$450, DW_AT_decl_line(0x7c)
    5634                            .dwattr $C$DW$450, DW_AT_decl_column(0x14)
    5635                    
    5636                    $C$DW$451       .dwtag  DW_TAG_member
    5637                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$155)
    5638                            .dwattr $C$DW$451, DW_AT_name("INTEVAL")
    5639                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("INTEVAL")
    5640                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5641                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5642                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5643                            .dwattr $C$DW$451, DW_AT_decl_line(0x7d)
    5644                            .dwattr $C$DW$451, DW_AT_decl_column(0x15)
    5645                    
    5646                    $C$DW$452       .dwtag  DW_TAG_member
    5647                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$176)
    5648                            .dwattr $C$DW$452, DW_AT_name("RSVD1")
    5649                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("RSVD1")
    5650                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5651                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5652                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5653                            .dwattr $C$DW$452, DW_AT_decl_line(0x7e)
    5654                            .dwattr $C$DW$452, DW_AT_decl_column(0x14)
    5655                    
    5656                    $C$DW$453       .dwtag  DW_TAG_member
    5657                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$155)
    5658                            .dwattr $C$DW$453, DW_AT_name("MERRPR0")
    5659                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("MERRPR0")
    5660                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5661                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5662                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5663                            .dwattr $C$DW$453, DW_AT_decl_line(0x7f)
    5664                            .dwattr $C$DW$453, DW_AT_decl_column(0x15)
    5665                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  104

    5666                    $C$DW$454       .dwtag  DW_TAG_member
    5667                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$177)
    5668                            .dwattr $C$DW$454, DW_AT_name("RSVD2")
    5669                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("RSVD2")
    5670                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5671                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5672                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5673                            .dwattr $C$DW$454, DW_AT_decl_line(0x80)
    5674                            .dwattr $C$DW$454, DW_AT_decl_column(0x14)
    5675                    
    5676                    $C$DW$455       .dwtag  DW_TAG_member
    5677                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$155)
    5678                            .dwattr $C$DW$455, DW_AT_name("MERRCR0")
    5679                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("MERRCR0")
    5680                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5681                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5682                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5683                            .dwattr $C$DW$455, DW_AT_decl_line(0x81)
    5684                            .dwattr $C$DW$455, DW_AT_decl_column(0x15)
    5685                    
    5686                    $C$DW$456       .dwtag  DW_TAG_member
    5687                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$177)
    5688                            .dwattr $C$DW$456, DW_AT_name("RSVD3")
    5689                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("RSVD3")
    5690                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    5691                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5692                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5693                            .dwattr $C$DW$456, DW_AT_decl_line(0x82)
    5694                            .dwattr $C$DW$456, DW_AT_decl_column(0x14)
    5695                    
    5696                    $C$DW$457       .dwtag  DW_TAG_member
    5697                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$155)
    5698                            .dwattr $C$DW$457, DW_AT_name("PERRPR")
    5699                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("PERRPR")
    5700                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5701                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5702                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5703                            .dwattr $C$DW$457, DW_AT_decl_line(0x83)
    5704                            .dwattr $C$DW$457, DW_AT_decl_column(0x15)
    5705                    
    5706                    $C$DW$458       .dwtag  DW_TAG_member
    5707                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$161)
    5708                            .dwattr $C$DW$458, DW_AT_name("RSVD4")
    5709                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("RSVD4")
    5710                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    5711                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5712                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5713                            .dwattr $C$DW$458, DW_AT_decl_line(0x84)
    5714                            .dwattr $C$DW$458, DW_AT_decl_column(0x14)
    5715                    
    5716                    $C$DW$459       .dwtag  DW_TAG_member
    5717                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$155)
    5718                            .dwattr $C$DW$459, DW_AT_name("PERRCR")
    5719                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("PERRCR")
    5720                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  105

    5721                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5722                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5723                            .dwattr $C$DW$459, DW_AT_decl_line(0x85)
    5724                            .dwattr $C$DW$459, DW_AT_decl_column(0x15)
    5725                    
    5726                    $C$DW$460       .dwtag  DW_TAG_member
    5727                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$178)
    5728                            .dwattr $C$DW$460, DW_AT_name("RSVD5")
    5729                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("RSVD5")
    5730                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5731                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5732                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5733                            .dwattr $C$DW$460, DW_AT_decl_line(0x86)
    5734                            .dwattr $C$DW$460, DW_AT_decl_column(0x14)
    5735                    
    5736                    $C$DW$461       .dwtag  DW_TAG_member
    5737                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$155)
    5738                            .dwattr $C$DW$461, DW_AT_name("PTCMD")
    5739                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("PTCMD")
    5740                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    5741                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5742                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5743                            .dwattr $C$DW$461, DW_AT_decl_line(0x87)
    5744                            .dwattr $C$DW$461, DW_AT_decl_column(0x15)
    5745                    
    5746                    $C$DW$462       .dwtag  DW_TAG_member
    5747                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$161)
    5748                            .dwattr $C$DW$462, DW_AT_name("RSVD6")
    5749                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("RSVD6")
    5750                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    5751                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5752                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5753                            .dwattr $C$DW$462, DW_AT_decl_line(0x88)
    5754                            .dwattr $C$DW$462, DW_AT_decl_column(0x14)
    5755                    
    5756                    $C$DW$463       .dwtag  DW_TAG_member
    5757                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$155)
    5758                            .dwattr $C$DW$463, DW_AT_name("PTSTAT")
    5759                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("PTSTAT")
    5760                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    5761                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5762                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5763                            .dwattr $C$DW$463, DW_AT_decl_line(0x89)
    5764                            .dwattr $C$DW$463, DW_AT_decl_column(0x15)
    5765                    
    5766                    $C$DW$464       .dwtag  DW_TAG_member
    5767                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$179)
    5768                            .dwattr $C$DW$464, DW_AT_name("RSVD7")
    5769                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("RSVD7")
    5770                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    5771                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5772                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5773                            .dwattr $C$DW$464, DW_AT_decl_line(0x8a)
    5774                            .dwattr $C$DW$464, DW_AT_decl_column(0x14)
    5775                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  106

    5776                    $C$DW$465       .dwtag  DW_TAG_member
    5777                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$155)
    5778                            .dwattr $C$DW$465, DW_AT_name("PDSTAT0")
    5779                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("PDSTAT0")
    5780                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    5781                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5782                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5783                            .dwattr $C$DW$465, DW_AT_decl_line(0x8b)
    5784                            .dwattr $C$DW$465, DW_AT_decl_column(0x15)
    5785                    
    5786                    $C$DW$466       .dwtag  DW_TAG_member
    5787                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$155)
    5788                            .dwattr $C$DW$466, DW_AT_name("PDSTAT1")
    5789                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("PDSTAT1")
    5790                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
    5791                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5792                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5793                            .dwattr $C$DW$466, DW_AT_decl_line(0x8c)
    5794                            .dwattr $C$DW$466, DW_AT_decl_column(0x15)
    5795                    
    5796                    $C$DW$467       .dwtag  DW_TAG_member
    5797                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$180)
    5798                            .dwattr $C$DW$467, DW_AT_name("RSVD8")
    5799                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("RSVD8")
    5800                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    5801                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5802                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5803                            .dwattr $C$DW$467, DW_AT_decl_line(0x8d)
    5804                            .dwattr $C$DW$467, DW_AT_decl_column(0x14)
    5805                    
    5806                    $C$DW$468       .dwtag  DW_TAG_member
    5807                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$155)
    5808                            .dwattr $C$DW$468, DW_AT_name("PDCTL0")
    5809                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("PDCTL0")
    5810                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    5811                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5812                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5813                            .dwattr $C$DW$468, DW_AT_decl_line(0x8e)
    5814                            .dwattr $C$DW$468, DW_AT_decl_column(0x15)
    5815                    
    5816                    $C$DW$469       .dwtag  DW_TAG_member
    5817                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$155)
    5818                            .dwattr $C$DW$469, DW_AT_name("PDCTL1")
    5819                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("PDCTL1")
    5820                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
    5821                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5822                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5823                            .dwattr $C$DW$469, DW_AT_decl_line(0x8f)
    5824                            .dwattr $C$DW$469, DW_AT_decl_column(0x15)
    5825                    
    5826                    $C$DW$470       .dwtag  DW_TAG_member
    5827                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$180)
    5828                            .dwattr $C$DW$470, DW_AT_name("RSVD9")
    5829                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("RSVD9")
    5830                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  107

    5831                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5832                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5833                            .dwattr $C$DW$470, DW_AT_decl_line(0x90)
    5834                            .dwattr $C$DW$470, DW_AT_decl_column(0x14)
    5835                    
    5836                    $C$DW$471       .dwtag  DW_TAG_member
    5837                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$155)
    5838                            .dwattr $C$DW$471, DW_AT_name("PDCFG0")
    5839                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("PDCFG0")
    5840                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
    5841                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5842                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5843                            .dwattr $C$DW$471, DW_AT_decl_line(0x91)
    5844                            .dwattr $C$DW$471, DW_AT_decl_column(0x15)
    5845                    
    5846                    $C$DW$472       .dwtag  DW_TAG_member
    5847                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$155)
    5848                            .dwattr $C$DW$472, DW_AT_name("PDCFG1")
    5849                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("PDCFG1")
    5850                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    5851                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5852                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5853                            .dwattr $C$DW$472, DW_AT_decl_line(0x92)
    5854                            .dwattr $C$DW$472, DW_AT_decl_column(0x15)
    5855                    
    5856                    $C$DW$473       .dwtag  DW_TAG_member
    5857                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$181)
    5858                            .dwattr $C$DW$473, DW_AT_name("RSVD10")
    5859                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("RSVD10")
    5860                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    5861                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5862                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5863                            .dwattr $C$DW$473, DW_AT_decl_line(0x93)
    5864                            .dwattr $C$DW$473, DW_AT_decl_column(0x14)
    5865                    
    5866                    $C$DW$474       .dwtag  DW_TAG_member
    5867                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$182)
    5868                            .dwattr $C$DW$474, DW_AT_name("MDSTAT")
    5869                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("MDSTAT")
    5870                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
    5871                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5872                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5873                            .dwattr $C$DW$474, DW_AT_decl_line(0x94)
    5874                            .dwattr $C$DW$474, DW_AT_decl_column(0x15)
    5875                    
    5876                    $C$DW$475       .dwtag  DW_TAG_member
    5877                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$183)
    5878                            .dwattr $C$DW$475, DW_AT_name("RSVD11")
    5879                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("RSVD11")
    5880                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
    5881                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5882                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5883                            .dwattr $C$DW$475, DW_AT_decl_line(0x95)
    5884                            .dwattr $C$DW$475, DW_AT_decl_column(0x14)
    5885                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE  108

    5886                    $C$DW$476       .dwtag  DW_TAG_member
    5887                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$182)
    5888                            .dwattr $C$DW$476, DW_AT_name("MDCTL")
    5889                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("MDCTL")
    5890                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
    5891                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5892                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    5893                            .dwattr $C$DW$476, DW_AT_decl_line(0x96)
    5894                            .dwattr $C$DW$476, DW_AT_decl_column(0x15)
    5895                    
    5896                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    5897                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x7a)
    5898                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x11)
    5899                            .dwendtag $C$DW$T$184
    5900                    
    5901                    $C$DW$T$705     .dwtag  DW_TAG_typedef
    5902                            .dwattr $C$DW$T$705, DW_AT_name("CSL_PscRegs")
    5903                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$184)
    5904                            .dwattr $C$DW$T$705, DW_AT_language(DW_LANG_C)
    5905                            .dwattr $C$DW$T$705, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    5906                            .dwattr $C$DW$T$705, DW_AT_decl_line(0x97)
    5907                            .dwattr $C$DW$T$705, DW_AT_decl_column(0x03)
    5908                    
    5909                    $C$DW$T$706     .dwtag  DW_TAG_volatile_type
    5910                            .dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$705)
    5911                    
    5912                    $C$DW$T$707     .dwtag  DW_TAG_pointer_type
    5913                            .dwattr $C$DW$T$707, DW_AT_type(*$C$DW$T$706)
    5914                            .dwattr $C$DW$T$707, DW_AT_address_class(0x20)
    5915                    
    5916                    $C$DW$T$708     .dwtag  DW_TAG_typedef
    5917                            .dwattr $C$DW$T$708, DW_AT_name("CSL_PscRegsOvly")
    5918                            .dwattr $C$DW$T$708, DW_AT_type(*$C$DW$T$707)
    5919                            .dwattr $C$DW$T$708, DW_AT_language(DW_LANG_C)
    5920                            .dwattr $C$DW$T$708, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    5921                            .dwattr $C$DW$T$708, DW_AT_decl_line(0x9d)
    5922                            .dwattr $C$DW$T$708, DW_AT_decl_column(0x2b)
    5923                    
    5924                    
    5925                    $C$DW$T$189     .dwtag  DW_TAG_structure_type
    5926                            .dwattr $C$DW$T$189, DW_AT_byte_size(0x04)
    5927                    $C$DW$477       .dwtag  DW_TAG_member
    5928                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$188)
    5929                            .dwattr $C$DW$477, DW_AT_name("X")
    5930                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("X")
    5931                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5932                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5933                            .dwattr $C$DW$477, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicC
    5934                            .dwattr $C$DW$477, DW_AT_decl_line(0x35)
    5935                            .dwattr $C$DW$477, DW_AT_decl_column(0x0c)
    5936                    
    5937                    $C$DW$478       .dwtag  DW_TAG_member
    5938                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$188)
    5939                            .dwattr $C$DW$478, DW_AT_name("Y")
    5940                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("Y")
