TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Fri Apr 14 08:40:29 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    1700                            .dwattr $C$DW$172, DW_AT_decl_column(0x03)
    1701                    
    1702                    $C$DW$173       .dwtag  DW_TAG_enumerator
    1703                            .dwattr $C$DW$173, DW_AT_name("CSL_EDMATC_0")
    1704                            .dwattr $C$DW$173, DW_AT_const_value(0x00)
    1705                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   32

    1706                            .dwattr $C$DW$173, DW_AT_decl_line(0x41a)
    1707                            .dwattr $C$DW$173, DW_AT_decl_column(0x03)
    1708                    
    1709                    $C$DW$174       .dwtag  DW_TAG_enumerator
    1710                            .dwattr $C$DW$174, DW_AT_name("CSL_EDMATC_1")
    1711                            .dwattr $C$DW$174, DW_AT_const_value(0x01)
    1712                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    1713                            .dwattr $C$DW$174, DW_AT_decl_line(0x41b)
    1714                            .dwattr $C$DW$174, DW_AT_decl_column(0x03)
    1715                    
    1716                            .dwattr $C$DW$T$673, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    1717                            .dwattr $C$DW$T$673, DW_AT_decl_line(0x418)
    1718                            .dwattr $C$DW$T$673, DW_AT_decl_column(0x0e)
    1719                            .dwendtag $C$DW$T$673
    1720                    
    1721                    $C$DW$T$674     .dwtag  DW_TAG_typedef
    1722                            .dwattr $C$DW$T$674, DW_AT_name("CSL_EdmatcNum")
    1723                            .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$673)
    1724                            .dwattr $C$DW$T$674, DW_AT_language(DW_LANG_C)
    1725                            .dwattr $C$DW$T$674, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    1726                            .dwattr $C$DW$T$674, DW_AT_decl_line(0x41c)
    1727                            .dwattr $C$DW$T$674, DW_AT_decl_column(0x03)
    1728                    
    1729                    
    1730                    $C$DW$T$675     .dwtag  DW_TAG_enumeration_type
    1731                            .dwattr $C$DW$T$675, DW_AT_byte_size(0x04)
    1732                    $C$DW$175       .dwtag  DW_TAG_enumerator
    1733                            .dwattr $C$DW$175, DW_AT_name("CSL_DAT_PRI_DEFAULT")
    1734                            .dwattr $C$DW$175, DW_AT_const_value(0x00)
    1735                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    1736                            .dwattr $C$DW$175, DW_AT_decl_line(0x449)
    1737                            .dwattr $C$DW$175, DW_AT_decl_column(0x05)
    1738                    
    1739                    $C$DW$176       .dwtag  DW_TAG_enumerator
    1740                            .dwattr $C$DW$176, DW_AT_name("CSL_DAT_PRI_0")
    1741                            .dwattr $C$DW$176, DW_AT_const_value(0x00)
    1742                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    1743                            .dwattr $C$DW$176, DW_AT_decl_line(0x44a)
    1744                            .dwattr $C$DW$176, DW_AT_decl_column(0x05)
    1745                    
    1746                    $C$DW$177       .dwtag  DW_TAG_enumerator
    1747                            .dwattr $C$DW$177, DW_AT_name("CSL_DAT_PRI_1")
    1748                            .dwattr $C$DW$177, DW_AT_const_value(0x01)
    1749                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    1750                            .dwattr $C$DW$177, DW_AT_decl_line(0x44b)
    1751                            .dwattr $C$DW$177, DW_AT_decl_column(0x05)
    1752                    
    1753                            .dwattr $C$DW$T$675, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    1754                            .dwattr $C$DW$T$675, DW_AT_decl_line(0x448)
    1755                            .dwattr $C$DW$T$675, DW_AT_decl_column(0x0e)
    1756                            .dwendtag $C$DW$T$675
    1757                    
    1758                    $C$DW$T$676     .dwtag  DW_TAG_typedef
    1759                            .dwattr $C$DW$T$676, DW_AT_name("CSL_DatPriority")
    1760                            .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$675)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   33

    1761                            .dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
    1762                            .dwattr $C$DW$T$676, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    1763                            .dwattr $C$DW$T$676, DW_AT_decl_line(0x44c)
    1764                            .dwattr $C$DW$T$676, DW_AT_decl_column(0x03)
    1765                    
    1766                    
    1767                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    1768                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x190)
    1769                    $C$DW$178       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$154)
    1771                            .dwattr $C$DW$178, DW_AT_name("REVID")
    1772                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("REVID")
    1773                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1775                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1776                            .dwattr $C$DW$178, DW_AT_decl_line(0x43)
    1777                            .dwattr $C$DW$178, DW_AT_decl_column(0x15)
    1778                    
    1779                    $C$DW$179       .dwtag  DW_TAG_member
    1780                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$160)
    1781                            .dwattr $C$DW$179, DW_AT_name("RSVD0")
    1782                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("RSVD0")
    1783                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1784                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1785                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1786                            .dwattr $C$DW$179, DW_AT_decl_line(0x44)
    1787                            .dwattr $C$DW$179, DW_AT_decl_column(0x14)
    1788                    
    1789                    $C$DW$180       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$154)
    1791                            .dwattr $C$DW$180, DW_AT_name("DIEIDR0")
    1792                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("DIEIDR0")
    1793                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1794                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1796                            .dwattr $C$DW$180, DW_AT_decl_line(0x45)
    1797                            .dwattr $C$DW$180, DW_AT_decl_column(0x15)
    1798                    
    1799                    $C$DW$181       .dwtag  DW_TAG_member
    1800                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$154)
    1801                            .dwattr $C$DW$181, DW_AT_name("DIEIDR1")
    1802                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("DIEIDR1")
    1803                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1804                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1805                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1806                            .dwattr $C$DW$181, DW_AT_decl_line(0x46)
    1807                            .dwattr $C$DW$181, DW_AT_decl_column(0x15)
    1808                    
    1809                    $C$DW$182       .dwtag  DW_TAG_member
    1810                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$154)
    1811                            .dwattr $C$DW$182, DW_AT_name("DIEIDR2")
    1812                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("DIEIDR2")
    1813                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1814                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1815                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   34

    1816                            .dwattr $C$DW$182, DW_AT_decl_line(0x47)
    1817                            .dwattr $C$DW$182, DW_AT_decl_column(0x15)
    1818                    
    1819                    $C$DW$183       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$154)
    1821                            .dwattr $C$DW$183, DW_AT_name("DIEIDR3")
    1822                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("DIEIDR3")
    1823                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1824                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1826                            .dwattr $C$DW$183, DW_AT_decl_line(0x48)
    1827                            .dwattr $C$DW$183, DW_AT_decl_column(0x15)
    1828                    
    1829                    $C$DW$184       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$154)
    1831                            .dwattr $C$DW$184, DW_AT_name("DEVIDR0")
    1832                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("DEVIDR0")
    1833                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1834                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1836                            .dwattr $C$DW$184, DW_AT_decl_line(0x49)
    1837                            .dwattr $C$DW$184, DW_AT_decl_column(0x15)
    1838                    
    1839                    $C$DW$185       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$160)
    1841                            .dwattr $C$DW$185, DW_AT_name("RSVD1")
    1842                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("RSVD1")
    1843                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1844                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1846                            .dwattr $C$DW$185, DW_AT_decl_line(0x4a)
    1847                            .dwattr $C$DW$185, DW_AT_decl_column(0x14)
    1848                    
    1849                    $C$DW$186       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$154)
    1851                            .dwattr $C$DW$186, DW_AT_name("BOOTCFG")
    1852                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("BOOTCFG")
    1853                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1854                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1856                            .dwattr $C$DW$186, DW_AT_decl_line(0x4b)
    1857                            .dwattr $C$DW$186, DW_AT_decl_column(0x15)
    1858                    
    1859                    $C$DW$187       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$154)
    1861                            .dwattr $C$DW$187, DW_AT_name("CHIPREVIDR")
    1862                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("CHIPREVIDR")
    1863                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1864                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1866                            .dwattr $C$DW$187, DW_AT_decl_line(0x4c)
    1867                            .dwattr $C$DW$187, DW_AT_decl_column(0x15)
    1868                    
    1869                    $C$DW$188       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$161)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   35

    1871                            .dwattr $C$DW$188, DW_AT_name("RSVD2")
    1872                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("RSVD2")
    1873                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1874                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1876                            .dwattr $C$DW$188, DW_AT_decl_line(0x4d)
    1877                            .dwattr $C$DW$188, DW_AT_decl_column(0x14)
    1878                    
    1879                    $C$DW$189       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$154)
    1881                            .dwattr $C$DW$189, DW_AT_name("KICK0R")
    1882                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("KICK0R")
    1883                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1884                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1886                            .dwattr $C$DW$189, DW_AT_decl_line(0x4e)
    1887                            .dwattr $C$DW$189, DW_AT_decl_column(0x15)
    1888                    
    1889                    $C$DW$190       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$154)
    1891                            .dwattr $C$DW$190, DW_AT_name("KICK1R")
    1892                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("KICK1R")
    1893                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1894                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1896                            .dwattr $C$DW$190, DW_AT_decl_line(0x4f)
    1897                            .dwattr $C$DW$190, DW_AT_decl_column(0x15)
    1898                    
    1899                    $C$DW$191       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$154)
    1901                            .dwattr $C$DW$191, DW_AT_name("HOST0CFG")
    1902                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("HOST0CFG")
    1903                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1904                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1906                            .dwattr $C$DW$191, DW_AT_decl_line(0x50)
    1907                            .dwattr $C$DW$191, DW_AT_decl_column(0x15)
    1908                    
    1909                    $C$DW$192       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$154)
    1911                            .dwattr $C$DW$192, DW_AT_name("HOST1CFG")
    1912                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("HOST1CFG")
    1913                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1914                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1916                            .dwattr $C$DW$192, DW_AT_decl_line(0x51)
    1917                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    1918                    
    1919                    $C$DW$193       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$162)
    1921                            .dwattr $C$DW$193, DW_AT_name("RSVD3")
    1922                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("RSVD3")
    1923                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1924                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1925                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   36

    1926                            .dwattr $C$DW$193, DW_AT_decl_line(0x52)
    1927                            .dwattr $C$DW$193, DW_AT_decl_column(0x14)
    1928                    
    1929                    $C$DW$194       .dwtag  DW_TAG_member
    1930                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$154)
    1931                            .dwattr $C$DW$194, DW_AT_name("IRAWSTAT")
    1932                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("IRAWSTAT")
    1933                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1934                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1935                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1936                            .dwattr $C$DW$194, DW_AT_decl_line(0x53)
    1937                            .dwattr $C$DW$194, DW_AT_decl_column(0x15)
    1938                    
    1939                    $C$DW$195       .dwtag  DW_TAG_member
    1940                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$154)
    1941                            .dwattr $C$DW$195, DW_AT_name("IENSTAT")
    1942                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("IENSTAT")
    1943                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1944                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1946                            .dwattr $C$DW$195, DW_AT_decl_line(0x54)
    1947                            .dwattr $C$DW$195, DW_AT_decl_column(0x15)
    1948                    
    1949                    $C$DW$196       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$154)
    1951                            .dwattr $C$DW$196, DW_AT_name("IENSET")
    1952                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("IENSET")
    1953                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1954                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1956                            .dwattr $C$DW$196, DW_AT_decl_line(0x55)
    1957                            .dwattr $C$DW$196, DW_AT_decl_column(0x15)
    1958                    
    1959                    $C$DW$197       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$154)
    1961                            .dwattr $C$DW$197, DW_AT_name("IENCLR")
    1962                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("IENCLR")
    1963                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1964                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1966                            .dwattr $C$DW$197, DW_AT_decl_line(0x56)
    1967                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    1968                    
    1969                    $C$DW$198       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$154)
    1971                            .dwattr $C$DW$198, DW_AT_name("EOI")
    1972                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("EOI")
    1973                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1974                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1976                            .dwattr $C$DW$198, DW_AT_decl_line(0x57)
    1977                            .dwattr $C$DW$198, DW_AT_decl_column(0x15)
    1978                    
    1979                    $C$DW$199       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$154)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   37

    1981                            .dwattr $C$DW$199, DW_AT_name("FLTADDRR")
    1982                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("FLTADDRR")
    1983                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1984                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1986                            .dwattr $C$DW$199, DW_AT_decl_line(0x58)
    1987                            .dwattr $C$DW$199, DW_AT_decl_column(0x15)
    1988                    
    1989                    $C$DW$200       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$154)
    1991                            .dwattr $C$DW$200, DW_AT_name("FLTSTAT")
    1992                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("FLTSTAT")
    1993                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1994                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1996                            .dwattr $C$DW$200, DW_AT_decl_line(0x59)
    1997                            .dwattr $C$DW$200, DW_AT_decl_column(0x15)
    1998                    
    1999                    $C$DW$201       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$163)
    2001                            .dwattr $C$DW$201, DW_AT_name("RSVD4")
    2002                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("RSVD4")
    2003                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2004                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2006                            .dwattr $C$DW$201, DW_AT_decl_line(0x5a)
    2007                            .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    2008                    
    2009                    $C$DW$202       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$154)
    2011                            .dwattr $C$DW$202, DW_AT_name("MSTPRI0")
    2012                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("MSTPRI0")
    2013                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2014                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2016                            .dwattr $C$DW$202, DW_AT_decl_line(0x5b)
    2017                            .dwattr $C$DW$202, DW_AT_decl_column(0x15)
    2018                    
    2019                    $C$DW$203       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$154)
    2021                            .dwattr $C$DW$203, DW_AT_name("MSTPRI1")
    2022                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("MSTPRI1")
    2023                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2024                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2026                            .dwattr $C$DW$203, DW_AT_decl_line(0x5c)
    2027                            .dwattr $C$DW$203, DW_AT_decl_column(0x15)
    2028                    
    2029                    $C$DW$204       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$154)
    2031                            .dwattr $C$DW$204, DW_AT_name("MSTPRI2")
    2032                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("MSTPRI2")
    2033                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2034                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2035                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   38

    2036                            .dwattr $C$DW$204, DW_AT_decl_line(0x5d)
    2037                            .dwattr $C$DW$204, DW_AT_decl_column(0x15)
    2038                    
    2039                    $C$DW$205       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$160)
    2041                            .dwattr $C$DW$205, DW_AT_name("RSVD5")
    2042                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("RSVD5")
    2043                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2044                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2045                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2046                            .dwattr $C$DW$205, DW_AT_decl_line(0x5e)
    2047                            .dwattr $C$DW$205, DW_AT_decl_column(0x14)
    2048                    
    2049                    $C$DW$206       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$154)
    2051                            .dwattr $C$DW$206, DW_AT_name("PINMUX0")
    2052                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("PINMUX0")
    2053                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2054                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2055                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2056                            .dwattr $C$DW$206, DW_AT_decl_line(0x5f)
    2057                            .dwattr $C$DW$206, DW_AT_decl_column(0x15)
    2058                    
    2059                    $C$DW$207       .dwtag  DW_TAG_member
    2060                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$154)
    2061                            .dwattr $C$DW$207, DW_AT_name("PINMUX1")
    2062                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("PINMUX1")
    2063                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2064                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2065                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2066                            .dwattr $C$DW$207, DW_AT_decl_line(0x60)
    2067                            .dwattr $C$DW$207, DW_AT_decl_column(0x15)
    2068                    
    2069                    $C$DW$208       .dwtag  DW_TAG_member
    2070                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$154)
    2071                            .dwattr $C$DW$208, DW_AT_name("PINMUX2")
    2072                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("PINMUX2")
    2073                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2074                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2076                            .dwattr $C$DW$208, DW_AT_decl_line(0x61)
    2077                            .dwattr $C$DW$208, DW_AT_decl_column(0x15)
    2078                    
    2079                    $C$DW$209       .dwtag  DW_TAG_member
    2080                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$154)
    2081                            .dwattr $C$DW$209, DW_AT_name("PINMUX3")
    2082                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("PINMUX3")
    2083                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2084                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2085                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2086                            .dwattr $C$DW$209, DW_AT_decl_line(0x62)
    2087                            .dwattr $C$DW$209, DW_AT_decl_column(0x15)
    2088                    
    2089                    $C$DW$210       .dwtag  DW_TAG_member
    2090                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$154)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   39

    2091                            .dwattr $C$DW$210, DW_AT_name("PINMUX4")
    2092                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("PINMUX4")
    2093                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    2094                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2095                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2096                            .dwattr $C$DW$210, DW_AT_decl_line(0x63)
    2097                            .dwattr $C$DW$210, DW_AT_decl_column(0x15)
    2098                    
    2099                    $C$DW$211       .dwtag  DW_TAG_member
    2100                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$154)
    2101                            .dwattr $C$DW$211, DW_AT_name("PINMUX5")
    2102                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("PINMUX5")
    2103                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    2104                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2105                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2106                            .dwattr $C$DW$211, DW_AT_decl_line(0x64)
    2107                            .dwattr $C$DW$211, DW_AT_decl_column(0x15)
    2108                    
    2109                    $C$DW$212       .dwtag  DW_TAG_member
    2110                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$154)
    2111                            .dwattr $C$DW$212, DW_AT_name("PINMUX6")
    2112                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("PINMUX6")
    2113                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    2114                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2115                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2116                            .dwattr $C$DW$212, DW_AT_decl_line(0x65)
    2117                            .dwattr $C$DW$212, DW_AT_decl_column(0x15)
    2118                    
    2119                    $C$DW$213       .dwtag  DW_TAG_member
    2120                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$154)
    2121                            .dwattr $C$DW$213, DW_AT_name("PINMUX7")
    2122                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("PINMUX7")
    2123                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    2124                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2125                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2126                            .dwattr $C$DW$213, DW_AT_decl_line(0x66)
    2127                            .dwattr $C$DW$213, DW_AT_decl_column(0x15)
    2128                    
    2129                    $C$DW$214       .dwtag  DW_TAG_member
    2130                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$154)
    2131                            .dwattr $C$DW$214, DW_AT_name("PINMUX8")
    2132                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("PINMUX8")
    2133                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    2134                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2135                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2136                            .dwattr $C$DW$214, DW_AT_decl_line(0x67)
    2137                            .dwattr $C$DW$214, DW_AT_decl_column(0x15)
    2138                    
    2139                    $C$DW$215       .dwtag  DW_TAG_member
    2140                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$154)
    2141                            .dwattr $C$DW$215, DW_AT_name("PINMUX9")
    2142                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("PINMUX9")
    2143                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    2144                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2145                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   40

    2146                            .dwattr $C$DW$215, DW_AT_decl_line(0x68)
    2147                            .dwattr $C$DW$215, DW_AT_decl_column(0x15)
    2148                    
    2149                    $C$DW$216       .dwtag  DW_TAG_member
    2150                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$154)
    2151                            .dwattr $C$DW$216, DW_AT_name("PINMUX10")
    2152                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("PINMUX10")
    2153                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    2154                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2155                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2156                            .dwattr $C$DW$216, DW_AT_decl_line(0x69)
    2157                            .dwattr $C$DW$216, DW_AT_decl_column(0x15)
    2158                    
    2159                    $C$DW$217       .dwtag  DW_TAG_member
    2160                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$154)
    2161                            .dwattr $C$DW$217, DW_AT_name("PINMUX11")
    2162                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("PINMUX11")
    2163                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    2164                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2165                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2166                            .dwattr $C$DW$217, DW_AT_decl_line(0x6a)
    2167                            .dwattr $C$DW$217, DW_AT_decl_column(0x15)
    2168                    
    2169                    $C$DW$218       .dwtag  DW_TAG_member
    2170                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$154)
    2171                            .dwattr $C$DW$218, DW_AT_name("PINMUX12")
    2172                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("PINMUX12")
    2173                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    2174                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2175                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2176                            .dwattr $C$DW$218, DW_AT_decl_line(0x6b)
    2177                            .dwattr $C$DW$218, DW_AT_decl_column(0x15)
    2178                    
    2179                    $C$DW$219       .dwtag  DW_TAG_member
    2180                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$154)
    2181                            .dwattr $C$DW$219, DW_AT_name("PINMUX13")
    2182                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("PINMUX13")
    2183                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    2184                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2185                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2186                            .dwattr $C$DW$219, DW_AT_decl_line(0x6c)
    2187                            .dwattr $C$DW$219, DW_AT_decl_column(0x15)
    2188                    
    2189                    $C$DW$220       .dwtag  DW_TAG_member
    2190                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$154)
    2191                            .dwattr $C$DW$220, DW_AT_name("PINMUX14")
    2192                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("PINMUX14")
    2193                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    2194                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2195                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2196                            .dwattr $C$DW$220, DW_AT_decl_line(0x6d)
    2197                            .dwattr $C$DW$220, DW_AT_decl_column(0x15)
    2198                    
    2199                    $C$DW$221       .dwtag  DW_TAG_member
    2200                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$154)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   41

    2201                            .dwattr $C$DW$221, DW_AT_name("PINMUX15")
    2202                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("PINMUX15")
    2203                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    2204                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2205                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2206                            .dwattr $C$DW$221, DW_AT_decl_line(0x6e)
    2207                            .dwattr $C$DW$221, DW_AT_decl_column(0x15)
    2208                    
    2209                    $C$DW$222       .dwtag  DW_TAG_member
    2210                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$154)
    2211                            .dwattr $C$DW$222, DW_AT_name("PINMUX16")
    2212                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("PINMUX16")
    2213                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    2214                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2215                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2216                            .dwattr $C$DW$222, DW_AT_decl_line(0x6f)
    2217                            .dwattr $C$DW$222, DW_AT_decl_column(0x15)
    2218                    
    2219                    $C$DW$223       .dwtag  DW_TAG_member
    2220                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$154)
    2221                            .dwattr $C$DW$223, DW_AT_name("PINMUX17")
    2222                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("PINMUX17")
    2223                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    2224                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2225                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2226                            .dwattr $C$DW$223, DW_AT_decl_line(0x70)
    2227                            .dwattr $C$DW$223, DW_AT_decl_column(0x15)
    2228                    
    2229                    $C$DW$224       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$154)
    2231                            .dwattr $C$DW$224, DW_AT_name("PINMUX18")
    2232                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("PINMUX18")
    2233                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    2234                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2235                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2236                            .dwattr $C$DW$224, DW_AT_decl_line(0x71)
    2237                            .dwattr $C$DW$224, DW_AT_decl_column(0x15)
    2238                    
    2239                    $C$DW$225       .dwtag  DW_TAG_member
    2240                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$154)
    2241                            .dwattr $C$DW$225, DW_AT_name("PINMUX19")
    2242                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("PINMUX19")
    2243                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    2244                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2245                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2246                            .dwattr $C$DW$225, DW_AT_decl_line(0x72)
    2247                            .dwattr $C$DW$225, DW_AT_decl_column(0x15)
    2248                    
    2249                    $C$DW$226       .dwtag  DW_TAG_member
    2250                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$154)
    2251                            .dwattr $C$DW$226, DW_AT_name("SUSPSRC")
    2252                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("SUSPSRC")
    2253                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    2254                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2255                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   42

    2256                            .dwattr $C$DW$226, DW_AT_decl_line(0x73)
    2257                            .dwattr $C$DW$226, DW_AT_decl_column(0x15)
    2258                    
    2259                    $C$DW$227       .dwtag  DW_TAG_member
    2260                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$154)
    2261                            .dwattr $C$DW$227, DW_AT_name("CHIPSIG")
    2262                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("CHIPSIG")
    2263                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    2264                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2265                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2266                            .dwattr $C$DW$227, DW_AT_decl_line(0x74)
    2267                            .dwattr $C$DW$227, DW_AT_decl_column(0x15)
    2268                    
    2269                    $C$DW$228       .dwtag  DW_TAG_member
    2270                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$154)
    2271                            .dwattr $C$DW$228, DW_AT_name("CHIPSIG_CLR")
    2272                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    2273                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    2274                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2275                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2276                            .dwattr $C$DW$228, DW_AT_decl_line(0x75)
    2277                            .dwattr $C$DW$228, DW_AT_decl_column(0x15)
    2278                    
    2279                    $C$DW$229       .dwtag  DW_TAG_member
    2280                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$154)
    2281                            .dwattr $C$DW$229, DW_AT_name("CFGCHIP0")
    2282                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("CFGCHIP0")
    2283                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    2284                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2285                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2286                            .dwattr $C$DW$229, DW_AT_decl_line(0x76)
    2287                            .dwattr $C$DW$229, DW_AT_decl_column(0x15)
    2288                    
    2289                    $C$DW$230       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$154)
    2291                            .dwattr $C$DW$230, DW_AT_name("CFGCHIP1")
    2292                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("CFGCHIP1")
    2293                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2294                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2296                            .dwattr $C$DW$230, DW_AT_decl_line(0x77)
    2297                            .dwattr $C$DW$230, DW_AT_decl_column(0x15)
    2298                    
    2299                    $C$DW$231       .dwtag  DW_TAG_member
    2300                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$154)
    2301                            .dwattr $C$DW$231, DW_AT_name("CFGCHIP2")
    2302                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("CFGCHIP2")
    2303                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    2304                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2306                            .dwattr $C$DW$231, DW_AT_decl_line(0x78)
    2307                            .dwattr $C$DW$231, DW_AT_decl_column(0x15)
    2308                    
    2309                    $C$DW$232       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$154)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   43

    2311                            .dwattr $C$DW$232, DW_AT_name("CFGCHIP3")
    2312                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("CFGCHIP3")
    2313                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    2314                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2316                            .dwattr $C$DW$232, DW_AT_decl_line(0x79)
    2317                            .dwattr $C$DW$232, DW_AT_decl_column(0x15)
    2318                    
    2319                    $C$DW$233       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$154)
    2321                            .dwattr $C$DW$233, DW_AT_name("CFGCHIP4")
    2322                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("CFGCHIP4")
    2323                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    2324                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2326                            .dwattr $C$DW$233, DW_AT_decl_line(0x7a)
    2327                            .dwattr $C$DW$233, DW_AT_decl_column(0x15)
    2328                    
    2329                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    2330                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x42)
    2331                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x11)
    2332                            .dwendtag $C$DW$T$164
    2333                    
    2334                    $C$DW$T$679     .dwtag  DW_TAG_typedef
    2335                            .dwattr $C$DW$T$679, DW_AT_name("CSL_SyscfgRegs")
    2336                            .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$164)
    2337                            .dwattr $C$DW$T$679, DW_AT_language(DW_LANG_C)
    2338                            .dwattr $C$DW$T$679, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    2339                            .dwattr $C$DW$T$679, DW_AT_decl_line(0x7b)
    2340                            .dwattr $C$DW$T$679, DW_AT_decl_column(0x03)
    2341                    
    2342                    $C$DW$T$680     .dwtag  DW_TAG_volatile_type
    2343                            .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$679)
    2344                    
    2345                    $C$DW$T$681     .dwtag  DW_TAG_pointer_type
    2346                            .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$680)
    2347                            .dwattr $C$DW$T$681, DW_AT_address_class(0x20)
    2348                    
    2349                    $C$DW$T$682     .dwtag  DW_TAG_typedef
    2350                            .dwattr $C$DW$T$682, DW_AT_name("CSL_SyscfgRegsOvly")
    2351                            .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$681)
    2352                            .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    2353                            .dwattr $C$DW$T$682, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    2354                            .dwattr $C$DW$T$682, DW_AT_decl_line(0x80)
    2355                            .dwattr $C$DW$T$682, DW_AT_decl_column(0x2e)
    2356                    
    2357                    $C$DW$T$683     .dwtag  DW_TAG_const_type
    2358                            .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$682)
    2359                    
    2360                    
    2361                    $C$DW$T$168     .dwtag  DW_TAG_structure_type
    2362                            .dwattr $C$DW$T$168, DW_AT_byte_size(0x0c)
    2363                    $C$DW$234       .dwtag  DW_TAG_member
    2364                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$165)
    2365                            .dwattr $C$DW$234, DW_AT_name("elem")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   44

    2366                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("elem")
    2367                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2369                            .dwattr $C$DW$234, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicC
    2370                            .dwattr $C$DW$234, DW_AT_decl_line(0x34)
    2371                            .dwattr $C$DW$234, DW_AT_decl_column(0x10)
    2372                    
    2373                    $C$DW$235       .dwtag  DW_TAG_member
    2374                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$167)
    2375                            .dwattr $C$DW$235, DW_AT_name("buttonValue")
    2376                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("buttonValue")
    2377                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2378                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2379                            .dwattr $C$DW$235, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicC
    2380                            .dwattr $C$DW$235, DW_AT_decl_line(0x35)
    2381                            .dwattr $C$DW$235, DW_AT_decl_column(0x11)
    2382                    
    2383                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Mi
    2384                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x33)
    2385                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x01)
    2386                            .dwendtag $C$DW$T$168
    2387                    
    2388                    $C$DW$T$684     .dwtag  DW_TAG_typedef
    2389                            .dwattr $C$DW$T$684, DW_AT_name("MicBtnMsg_t")
    2390                            .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$168)
    2391                            .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    2392                            .dwattr $C$DW$T$684, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Mi
    2393                            .dwattr $C$DW$T$684, DW_AT_decl_line(0x36)
    2394                            .dwattr $C$DW$T$684, DW_AT_decl_column(0x03)
    2395                    
    2396                    
    2397                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    2398                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x08)
    2399                    $C$DW$236       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$10)
    2401                            .dwattr $C$DW$236, DW_AT_name("length")
    2402                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("length")
    2403                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2405                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2406                            .dwattr $C$DW$236, DW_AT_decl_line(0x14d)
    2407                            .dwattr $C$DW$236, DW_AT_decl_column(0x16)
    2408                    
    2409                    $C$DW$237       .dwtag  DW_TAG_member
    2410                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$171)
    2411                            .dwattr $C$DW$237, DW_AT_name("elem")
    2412                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("elem")
    2413                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2414                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2416                            .dwattr $C$DW$237, DW_AT_decl_line(0x14d)
    2417                            .dwattr $C$DW$237, DW_AT_decl_column(0x40)
    2418                    
    2419                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2420                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x14d)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   45

    2421                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x10)
    2422                            .dwendtag $C$DW$T$172
    2423                    
    2424                    $C$DW$T$686     .dwtag  DW_TAG_typedef
    2425                            .dwattr $C$DW$T$686, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    2426                            .dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$172)
    2427                            .dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
    2428                            .dwattr $C$DW$T$686, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2429                            .dwattr $C$DW$T$686, DW_AT_decl_line(0x14d)
    2430                            .dwattr $C$DW$T$686, DW_AT_decl_column(0x48)
    2431                    
    2432                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    2433                            .dwattr $C$DW$T$687, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    2434                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$686)
    2435                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    2436                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2437                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x14f)
    2438                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x2b)
    2439                    
    2440                    
    2441                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    2442                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x08)
    2443                    $C$DW$238       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$10)
    2445                            .dwattr $C$DW$238, DW_AT_name("length")
    2446                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("length")
    2447                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2450                            .dwattr $C$DW$238, DW_AT_decl_line(0x14e)
    2451                            .dwattr $C$DW$238, DW_AT_decl_column(0x16)
    2452                    
    2453                    $C$DW$239       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$171)
    2455                            .dwattr $C$DW$239, DW_AT_name("elem")
    2456                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("elem")
    2457                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2458                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2460                            .dwattr $C$DW$239, DW_AT_decl_line(0x14e)
    2461                            .dwattr $C$DW$239, DW_AT_decl_column(0x40)
    2462                    
    2463                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2464                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x14e)
    2465                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
    2466                            .dwendtag $C$DW$T$173
    2467                    
    2468                    $C$DW$T$688     .dwtag  DW_TAG_typedef
    2469                            .dwattr $C$DW$T$688, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    2470                            .dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$173)
    2471                            .dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
    2472                            .dwattr $C$DW$T$688, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2473                            .dwattr $C$DW$T$688, DW_AT_decl_line(0x14e)
    2474                            .dwattr $C$DW$T$688, DW_AT_decl_column(0x48)
    2475                    
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   46

    2476                    $C$DW$T$689     .dwtag  DW_TAG_typedef
    2477                            .dwattr $C$DW$T$689, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    2478                            .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$688)
    2479                            .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    2480                            .dwattr $C$DW$T$689, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    2481                            .dwattr $C$DW$T$689, DW_AT_decl_line(0x150)
    2482                            .dwattr $C$DW$T$689, DW_AT_decl_column(0x2c)
    2483                    
    2484                    
    2485                    $C$DW$T$177     .dwtag  DW_TAG_structure_type
    2486                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x08)
    2487                    $C$DW$240       .dwtag  DW_TAG_member
    2488                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$10)
    2489                            .dwattr $C$DW$240, DW_AT_name("length")
    2490                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("length")
    2491                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2493                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2494                            .dwattr $C$DW$240, DW_AT_decl_line(0x29b)
    2495                            .dwattr $C$DW$240, DW_AT_decl_column(0x16)
    2496                    
    2497                    $C$DW$241       .dwtag  DW_TAG_member
    2498                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$176)
    2499                            .dwattr $C$DW$241, DW_AT_name("elem")
    2500                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("elem")
    2501                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2502                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2503                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2504                            .dwattr $C$DW$241, DW_AT_decl_line(0x29b)
    2505                            .dwattr $C$DW$241, DW_AT_decl_column(0x41)
    2506                    
    2507                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2508                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x29b)
    2509                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x10)
    2510                            .dwendtag $C$DW$T$177
    2511                    
    2512                    $C$DW$T$690     .dwtag  DW_TAG_typedef
    2513                            .dwattr $C$DW$T$690, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
    2514                            .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$177)
    2515                            .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    2516                            .dwattr $C$DW$T$690, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2517                            .dwattr $C$DW$T$690, DW_AT_decl_line(0x29b)
    2518                            .dwattr $C$DW$T$690, DW_AT_decl_column(0x49)
    2519                    
    2520                    $C$DW$T$691     .dwtag  DW_TAG_typedef
    2521                            .dwattr $C$DW$T$691, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    2522                            .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$690)
    2523                            .dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
    2524                            .dwattr $C$DW$T$691, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2525                            .dwattr $C$DW$T$691, DW_AT_decl_line(0x29d)
    2526                            .dwattr $C$DW$T$691, DW_AT_decl_column(0x2c)
    2527                    
    2528                    
    2529                    $C$DW$T$178     .dwtag  DW_TAG_structure_type
    2530                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x08)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   47

    2531                    $C$DW$242       .dwtag  DW_TAG_member
    2532                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$10)
    2533                            .dwattr $C$DW$242, DW_AT_name("length")
    2534                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("length")
    2535                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2537                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2538                            .dwattr $C$DW$242, DW_AT_decl_line(0x29c)
    2539                            .dwattr $C$DW$242, DW_AT_decl_column(0x16)
    2540                    
    2541                    $C$DW$243       .dwtag  DW_TAG_member
    2542                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$176)
    2543                            .dwattr $C$DW$243, DW_AT_name("elem")
    2544                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("elem")
    2545                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2546                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2547                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2548                            .dwattr $C$DW$243, DW_AT_decl_line(0x29c)
    2549                            .dwattr $C$DW$243, DW_AT_decl_column(0x41)
    2550                    
    2551                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2552                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x29c)
    2553                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x10)
    2554                            .dwendtag $C$DW$T$178
    2555                    
    2556                    $C$DW$T$692     .dwtag  DW_TAG_typedef
    2557                            .dwattr $C$DW$T$692, DW_AT_name("__CARRAY1_ti_sysbios_knl_Task_hooks")
    2558                            .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$178)
    2559                            .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    2560                            .dwattr $C$DW$T$692, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2561                            .dwattr $C$DW$T$692, DW_AT_decl_line(0x29c)
    2562                            .dwattr $C$DW$T$692, DW_AT_decl_column(0x49)
    2563                    
    2564                    $C$DW$T$693     .dwtag  DW_TAG_typedef
    2565                            .dwattr $C$DW$T$693, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    2566                            .dwattr $C$DW$T$693, DW_AT_type(*$C$DW$T$692)
    2567                            .dwattr $C$DW$T$693, DW_AT_language(DW_LANG_C)
    2568                            .dwattr $C$DW$T$693, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    2569                            .dwattr $C$DW$T$693, DW_AT_decl_line(0x29e)
    2570                            .dwattr $C$DW$T$693, DW_AT_decl_column(0x2d)
    2571                    
    2572                    
    2573                    $C$DW$T$180     .dwtag  DW_TAG_structure_type
    2574                            .dwattr $C$DW$T$180, DW_AT_byte_size(0x18)
    2575                    $C$DW$244       .dwtag  DW_TAG_member
    2576                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$10)
    2577                            .dwattr $C$DW$244, DW_AT_name("fd")
    2578                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("fd")
    2579                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2581                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2582                            .dwattr $C$DW$244, DW_AT_decl_line(0x49)
    2583                            .dwattr $C$DW$244, DW_AT_decl_column(0x0b)
    2584                    
    2585                    $C$DW$245       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   48

    2586                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$179)
    2587                            .dwattr $C$DW$245, DW_AT_name("buf")
    2588                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("buf")
    2589                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2590                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2592                            .dwattr $C$DW$245, DW_AT_decl_line(0x4a)
    2593                            .dwattr $C$DW$245, DW_AT_decl_column(0x16)
    2594                    
    2595                    $C$DW$246       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$179)
    2597                            .dwattr $C$DW$246, DW_AT_name("pos")
    2598                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pos")
    2599                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2600                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2602                            .dwattr $C$DW$246, DW_AT_decl_line(0x4b)
    2603                            .dwattr $C$DW$246, DW_AT_decl_column(0x16)
    2604                    
    2605                    $C$DW$247       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$179)
    2607                            .dwattr $C$DW$247, DW_AT_name("bufend")
    2608                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("bufend")
    2609                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2610                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2612                            .dwattr $C$DW$247, DW_AT_decl_line(0x4c)
    2613                            .dwattr $C$DW$247, DW_AT_decl_column(0x16)
    2614                    
    2615                    $C$DW$248       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$179)
    2617                            .dwattr $C$DW$248, DW_AT_name("buff_stop")
    2618                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("buff_stop")
    2619                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2620                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2622                            .dwattr $C$DW$248, DW_AT_decl_line(0x4d)
    2623                            .dwattr $C$DW$248, DW_AT_decl_column(0x16)
    2624                    
    2625                    $C$DW$249       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$11)
    2627                            .dwattr $C$DW$249, DW_AT_name("flags")
    2628                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("flags")
    2629                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2630                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    2632                            .dwattr $C$DW$249, DW_AT_decl_line(0x4e)
    2633                            .dwattr $C$DW$249, DW_AT_decl_column(0x16)
    2634                    
    2635                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2636                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x48)
    2637                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x10)
    2638                            .dwendtag $C$DW$T$180
    2639                    
    2640                    $C$DW$T$694     .dwtag  DW_TAG_typedef
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   49

    2641                            .dwattr $C$DW$T$694, DW_AT_name("FILE")
    2642                            .dwattr $C$DW$T$694, DW_AT_type(*$C$DW$T$180)
    2643                            .dwattr $C$DW$T$694, DW_AT_language(DW_LANG_C)
    2644                            .dwattr $C$DW$T$694, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2645                            .dwattr $C$DW$T$694, DW_AT_decl_line(0x4f)
    2646                            .dwattr $C$DW$T$694, DW_AT_decl_column(0x03)
    2647                    
    2648                    
    2649                    $C$DW$T$181     .dwtag  DW_TAG_structure_type
    2650                            .dwattr $C$DW$T$181, DW_AT_byte_size(0x08)
    2651                    $C$DW$250       .dwtag  DW_TAG_member
    2652                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$10)
    2653                            .dwattr $C$DW$250, DW_AT_name("quot")
    2654                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("quot")
    2655                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2656                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2657                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2658                            .dwattr $C$DW$250, DW_AT_decl_line(0x49)
    2659                            .dwattr $C$DW$250, DW_AT_decl_column(0x16)
    2660                    
    2661                    $C$DW$251       .dwtag  DW_TAG_member
    2662                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$10)
    2663                            .dwattr $C$DW$251, DW_AT_name("rem")
    2664                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("rem")
    2665                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2666                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2667                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2668                            .dwattr $C$DW$251, DW_AT_decl_line(0x49)
    2669                            .dwattr $C$DW$251, DW_AT_decl_column(0x1c)
    2670                    
    2671                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2672                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x49)
    2673                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x10)
    2674                            .dwendtag $C$DW$T$181
    2675                    
    2676                    $C$DW$T$695     .dwtag  DW_TAG_typedef
    2677                            .dwattr $C$DW$T$695, DW_AT_name("div_t")
    2678                            .dwattr $C$DW$T$695, DW_AT_type(*$C$DW$T$181)
    2679                            .dwattr $C$DW$T$695, DW_AT_language(DW_LANG_C)
    2680                            .dwattr $C$DW$T$695, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2681                            .dwattr $C$DW$T$695, DW_AT_decl_line(0x49)
    2682                            .dwattr $C$DW$T$695, DW_AT_decl_column(0x23)
    2683                    
    2684                    
    2685                    $C$DW$T$182     .dwtag  DW_TAG_structure_type
    2686                            .dwattr $C$DW$T$182, DW_AT_byte_size(0x08)
    2687                    $C$DW$252       .dwtag  DW_TAG_member
    2688                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$10)
    2689                            .dwattr $C$DW$252, DW_AT_name("quot")
    2690                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("quot")
    2691                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2693                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2694                            .dwattr $C$DW$252, DW_AT_decl_line(0x4b)
    2695                            .dwattr $C$DW$252, DW_AT_decl_column(0x17)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   50

    2696                    
    2697                    $C$DW$253       .dwtag  DW_TAG_member
    2698                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$10)
    2699                            .dwattr $C$DW$253, DW_AT_name("rem")
    2700                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("rem")
    2701                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2702                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2703                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2704                            .dwattr $C$DW$253, DW_AT_decl_line(0x4b)
    2705                            .dwattr $C$DW$253, DW_AT_decl_column(0x1d)
    2706                    
    2707                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2708                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x4b)
    2709                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x10)
    2710                            .dwendtag $C$DW$T$182
    2711                    
    2712                    $C$DW$T$696     .dwtag  DW_TAG_typedef
    2713                            .dwattr $C$DW$T$696, DW_AT_name("ldiv_t")
    2714                            .dwattr $C$DW$T$696, DW_AT_type(*$C$DW$T$182)
    2715                            .dwattr $C$DW$T$696, DW_AT_language(DW_LANG_C)
    2716                            .dwattr $C$DW$T$696, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2717                            .dwattr $C$DW$T$696, DW_AT_decl_line(0x4b)
    2718                            .dwattr $C$DW$T$696, DW_AT_decl_column(0x24)
    2719                    
    2720                    
    2721                    $C$DW$T$183     .dwtag  DW_TAG_structure_type
    2722                            .dwattr $C$DW$T$183, DW_AT_byte_size(0x10)
    2723                    $C$DW$254       .dwtag  DW_TAG_member
    2724                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$14)
    2725                            .dwattr $C$DW$254, DW_AT_name("quot")
    2726                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("quot")
    2727                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2729                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2730                            .dwattr $C$DW$254, DW_AT_decl_line(0x4e)
    2731                            .dwattr $C$DW$254, DW_AT_decl_column(0x1c)
    2732                    
    2733                    $C$DW$255       .dwtag  DW_TAG_member
    2734                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$14)
    2735                            .dwattr $C$DW$255, DW_AT_name("rem")
    2736                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("rem")
    2737                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2738                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2739                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    2740                            .dwattr $C$DW$255, DW_AT_decl_line(0x4e)
    2741                            .dwattr $C$DW$255, DW_AT_decl_column(0x22)
    2742                    
    2743                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2744                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x4e)
    2745                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x10)
    2746                            .dwendtag $C$DW$T$183
    2747                    
    2748                    $C$DW$T$697     .dwtag  DW_TAG_typedef
    2749                            .dwattr $C$DW$T$697, DW_AT_name("lldiv_t")
    2750                            .dwattr $C$DW$T$697, DW_AT_type(*$C$DW$T$183)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   51

    2751                            .dwattr $C$DW$T$697, DW_AT_language(DW_LANG_C)
    2752                            .dwattr $C$DW$T$697, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/st
    2753                            .dwattr $C$DW$T$697, DW_AT_decl_line(0x4e)
    2754                            .dwattr $C$DW$T$697, DW_AT_decl_column(0x29)
    2755                    
    2756                    
    2757                    $C$DW$T$192     .dwtag  DW_TAG_structure_type
    2758                            .dwattr $C$DW$T$192, DW_AT_byte_size(0xa80)
    2759                    $C$DW$256       .dwtag  DW_TAG_member
    2760                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$154)
    2761                            .dwattr $C$DW$256, DW_AT_name("REVID")
    2762                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("REVID")
    2763                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2764                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2765                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2766                            .dwattr $C$DW$256, DW_AT_decl_line(0x7b)
    2767                            .dwattr $C$DW$256, DW_AT_decl_column(0x15)
    2768                    
    2769                    $C$DW$257       .dwtag  DW_TAG_member
    2770                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$163)
    2771                            .dwattr $C$DW$257, DW_AT_name("RSVD0")
    2772                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("RSVD0")
    2773                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2774                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2775                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2776                            .dwattr $C$DW$257, DW_AT_decl_line(0x7c)
    2777                            .dwattr $C$DW$257, DW_AT_decl_column(0x14)
    2778                    
    2779                    $C$DW$258       .dwtag  DW_TAG_member
    2780                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$154)
    2781                            .dwattr $C$DW$258, DW_AT_name("INTEVAL")
    2782                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("INTEVAL")
    2783                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2784                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2785                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2786                            .dwattr $C$DW$258, DW_AT_decl_line(0x7d)
    2787                            .dwattr $C$DW$258, DW_AT_decl_column(0x15)
    2788                    
    2789                    $C$DW$259       .dwtag  DW_TAG_member
    2790                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$184)
    2791                            .dwattr $C$DW$259, DW_AT_name("RSVD1")
    2792                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("RSVD1")
    2793                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2794                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2795                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2796                            .dwattr $C$DW$259, DW_AT_decl_line(0x7e)
    2797                            .dwattr $C$DW$259, DW_AT_decl_column(0x14)
    2798                    
    2799                    $C$DW$260       .dwtag  DW_TAG_member
    2800                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$154)
    2801                            .dwattr $C$DW$260, DW_AT_name("MERRPR0")
    2802                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("MERRPR0")
    2803                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2804                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2805                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   52

    2806                            .dwattr $C$DW$260, DW_AT_decl_line(0x7f)
    2807                            .dwattr $C$DW$260, DW_AT_decl_column(0x15)
    2808                    
    2809                    $C$DW$261       .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$185)
    2811                            .dwattr $C$DW$261, DW_AT_name("RSVD2")
    2812                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("RSVD2")
    2813                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2814                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2816                            .dwattr $C$DW$261, DW_AT_decl_line(0x80)
    2817                            .dwattr $C$DW$261, DW_AT_decl_column(0x14)
    2818                    
    2819                    $C$DW$262       .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$154)
    2821                            .dwattr $C$DW$262, DW_AT_name("MERRCR0")
    2822                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("MERRCR0")
    2823                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2824                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2826                            .dwattr $C$DW$262, DW_AT_decl_line(0x81)
    2827                            .dwattr $C$DW$262, DW_AT_decl_column(0x15)
    2828                    
    2829                    $C$DW$263       .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$185)
    2831                            .dwattr $C$DW$263, DW_AT_name("RSVD3")
    2832                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("RSVD3")
    2833                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2834                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2835                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2836                            .dwattr $C$DW$263, DW_AT_decl_line(0x82)
    2837                            .dwattr $C$DW$263, DW_AT_decl_column(0x14)
    2838                    
    2839                    $C$DW$264       .dwtag  DW_TAG_member
    2840                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$154)
    2841                            .dwattr $C$DW$264, DW_AT_name("PERRPR")
    2842                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("PERRPR")
    2843                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2844                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2845                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2846                            .dwattr $C$DW$264, DW_AT_decl_line(0x83)
    2847                            .dwattr $C$DW$264, DW_AT_decl_column(0x15)
    2848                    
    2849                    $C$DW$265       .dwtag  DW_TAG_member
    2850                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$160)
    2851                            .dwattr $C$DW$265, DW_AT_name("RSVD4")
    2852                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("RSVD4")
    2853                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2854                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2855                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    2856                            .dwattr $C$DW$265, DW_AT_decl_line(0x84)
    2857                            .dwattr $C$DW$265, DW_AT_decl_column(0x14)
    2858                    
    2859                    $C$DW$266       .dwtag  DW_TAG_member
    2860                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$154)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:30 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicInterface.asm                                                     PAGE   53

    2861                            .dwattr $C$DW$266, DW_AT_name("PERRCR")
    2862                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("PERRCR")
    2863                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2864                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
