TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Wed Apr 19 22:40:36 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    2209                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x35)
    2210                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    2211                            .dwendtag $C$DW$T$34
    2212                    
    2213                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    2214                            .dwattr $C$DW$T$35, DW_AT_name("Scale")
    2215                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2216                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2217                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2218                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x3b)
    2219                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    2220                    
    2221                    
    2222                    $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    2223                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2224                    $C$DW$114       .dwtag  DW_TAG_enumerator
    2225                            .dwattr $C$DW$114, DW_AT_name("ChordMajor")
    2226                            .dwattr $C$DW$114, DW_AT_const_value(0x00)
    2227                            .dwattr $C$DW$114, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2228                            .dwattr $C$DW$114, DW_AT_decl_line(0x40)
    2229                            .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    2230                    
    2231                    $C$DW$115       .dwtag  DW_TAG_enumerator
    2232                            .dwattr $C$DW$115, DW_AT_name("ChordMinor")
    2233                            .dwattr $C$DW$115, DW_AT_const_value(0x01)
    2234                            .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2235                            .dwattr $C$DW$115, DW_AT_decl_line(0x41)
    2236                            .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    2237                    
    2238                    $C$DW$116       .dwtag  DW_TAG_enumerator
    2239                            .dwattr $C$DW$116, DW_AT_name("Dominant7")
    2240                            .dwattr $C$DW$116, DW_AT_const_value(0x02)
    2241                            .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2242                            .dwattr $C$DW$116, DW_AT_decl_line(0x42)
    2243                            .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    2244                    
    2245                    $C$DW$117       .dwtag  DW_TAG_enumerator
    2246                            .dwattr $C$DW$117, DW_AT_name("Minor7")
    2247                            .dwattr $C$DW$117, DW_AT_const_value(0x03)
    2248                            .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2249                            .dwattr $C$DW$117, DW_AT_decl_line(0x43)
    2250                            .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    2251                    
    2252                    $C$DW$118       .dwtag  DW_TAG_enumerator
    2253                            .dwattr $C$DW$118, DW_AT_name("Sus4")
    2254                            .dwattr $C$DW$118, DW_AT_const_value(0x04)
    2255                            .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE   42

    2256                            .dwattr $C$DW$118, DW_AT_decl_line(0x44)
    2257                            .dwattr $C$DW$118, DW_AT_decl_column(0x05)
    2258                    
    2259                    $C$DW$119       .dwtag  DW_TAG_enumerator
    2260                            .dwattr $C$DW$119, DW_AT_name("Sus2")
    2261                            .dwattr $C$DW$119, DW_AT_const_value(0x05)
    2262                            .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2263                            .dwattr $C$DW$119, DW_AT_decl_line(0x45)
    2264                            .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    2265                    
    2266                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2267                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x3f)
    2268                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2269                            .dwendtag $C$DW$T$36
    2270                    
    2271                    $C$DW$T$37      .dwtag  DW_TAG_typedef
    2272                            .dwattr $C$DW$T$37, DW_AT_name("Chord")
    2273                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2274                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2275                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2276                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x46)
    2277                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    2278                    
    2279                    
    2280                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2281                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
    2282                    $C$DW$120       .dwtag  DW_TAG_member
    2283                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$16)
    2284                            .dwattr $C$DW$120, DW_AT_name("freq")
    2285                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("freq")
    2286                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2288                            .dwattr $C$DW$120, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2289                            .dwattr $C$DW$120, DW_AT_decl_line(0x12)
    2290                            .dwattr $C$DW$120, DW_AT_decl_column(0x08)
    2291                    
    2292                    $C$DW$121       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2294                            .dwattr $C$DW$121, DW_AT_name("name")
    2295                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("name")
    2296                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2297                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2298                            .dwattr $C$DW$121, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2299                            .dwattr $C$DW$121, DW_AT_decl_line(0x13)
    2300                            .dwattr $C$DW$121, DW_AT_decl_column(0x07)
    2301                    
    2302                    $C$DW$122       .dwtag  DW_TAG_member
    2303                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$22)
    2304                            .dwattr $C$DW$122, DW_AT_name("active")
    2305                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("active")
    2306                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2307                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2308                            .dwattr $C$DW$122, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2309                            .dwattr $C$DW$122, DW_AT_decl_line(0x14)
    2310                            .dwattr $C$DW$122, DW_AT_decl_column(0x07)
TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE   43

    2311                    
    2312                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2313                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x11)
    2314                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    2315                            .dwendtag $C$DW$T$23
    2316                    
    2317                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2318                            .dwattr $C$DW$T$51, DW_AT_name("Note_t")
    2319                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$23)
    2320                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2321                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2322                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x15)
    2323                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2324                    
    2325                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2326                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2327                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2328                    
    2329                    $C$DW$T$58      .dwtag  DW_TAG_const_type
    2330                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$52)
    2331                    
    2332                    
    2333                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2334                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x6c)
    2335                    $C$DW$123       .dwtag  DW_TAG_member
    2336                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$24)
    2337                            .dwattr $C$DW$123, DW_AT_name("isActive")
    2338                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("isActive")
    2339                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2341                            .dwattr $C$DW$123, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2342                            .dwattr $C$DW$123, DW_AT_decl_line(0x32)
    2343                            .dwattr $C$DW$123, DW_AT_decl_column(0x0a)
    2344                    
    2345                    $C$DW$124       .dwtag  DW_TAG_member
    2346                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$27)
    2347                            .dwattr $C$DW$124, DW_AT_name("tune")
    2348                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("tune")
    2349                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2350                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$124, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2352                            .dwattr $C$DW$124, DW_AT_decl_line(0x33)
    2353                            .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    2354                    
    2355                    $C$DW$125       .dwtag  DW_TAG_member
    2356                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$28)
    2357                            .dwattr $C$DW$125, DW_AT_name("Scale")
    2358                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("Scale")
    2359                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2360                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2361                            .dwattr $C$DW$125, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2362                            .dwattr $C$DW$125, DW_AT_decl_line(0x34)
    2363                            .dwattr $C$DW$125, DW_AT_decl_column(0x0a)
    2364                    
    2365                    $C$DW$126       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE   44

    2366                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$28)
    2367                            .dwattr $C$DW$126, DW_AT_name("Chord")
    2368                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("Chord")
    2369                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2370                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2371                            .dwattr $C$DW$126, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2372                            .dwattr $C$DW$126, DW_AT_decl_line(0x35)
    2373                            .dwattr $C$DW$126, DW_AT_decl_column(0x0a)
    2374                    
    2375                    $C$DW$127       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$31)
    2377                            .dwattr $C$DW$127, DW_AT_name("Volume")
    2378                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("Volume")
    2379                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2380                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$127, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2382                            .dwattr $C$DW$127, DW_AT_decl_line(0x36)
    2383                            .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2384                    
    2385                    $C$DW$128       .dwtag  DW_TAG_member
    2386                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
    2387                            .dwattr $C$DW$128, DW_AT_name("isChordMode")
    2388                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("isChordMode")
    2389                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2390                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2391                            .dwattr $C$DW$128, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2392                            .dwattr $C$DW$128, DW_AT_decl_line(0x37)
    2393                            .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    2394                    
    2395                    $C$DW$129       .dwtag  DW_TAG_member
    2396                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$33)
    2397                            .dwattr $C$DW$129, DW_AT_name("ChordTonic")
    2398                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("ChordTonic")
    2399                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2400                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2401                            .dwattr $C$DW$129, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2402                            .dwattr $C$DW$129, DW_AT_decl_line(0x38)
    2403                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    2404                    
    2405                    $C$DW$130       .dwtag  DW_TAG_member
    2406                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    2407                            .dwattr $C$DW$130, DW_AT_name("ScaleTonic")
    2408                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("ScaleTonic")
    2409                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2410                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2411                            .dwattr $C$DW$130, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2412                            .dwattr $C$DW$130, DW_AT_decl_line(0x39)
    2413                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    2414                    
    2415                    $C$DW$131       .dwtag  DW_TAG_member
    2416                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$35)
    2417                            .dwattr $C$DW$131, DW_AT_name("ScaleType")
    2418                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("ScaleType")
    2419                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2420                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE   45

    2421                            .dwattr $C$DW$131, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2422                            .dwattr $C$DW$131, DW_AT_decl_line(0x3a)
    2423                            .dwattr $C$DW$131, DW_AT_decl_column(0x0b)
    2424                    
    2425                    $C$DW$132       .dwtag  DW_TAG_member
    2426                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    2427                            .dwattr $C$DW$132, DW_AT_name("ChordType")
    2428                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("ChordType")
    2429                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2430                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2431                            .dwattr $C$DW$132, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voca
    2432                            .dwattr $C$DW$132, DW_AT_decl_line(0x3b)
    2433                            .dwattr $C$DW$132, DW_AT_decl_column(0x0b)
    2434                    
    2435                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2436                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x31)
    2437                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2438                            .dwendtag $C$DW$T$38
    2439                    
    2440                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2441                            .dwattr $C$DW$T$62, DW_AT_name("MicCheckPreset")
    2442                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$38)
    2443                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2444                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
    2445                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3c)
    2446                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    2447                    
    2448                    
    2449                    $C$DW$T$41      .dwtag  DW_TAG_union_type
    2450                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2451                    $C$DW$133       .dwtag  DW_TAG_member
    2452                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
    2453                            .dwattr $C$DW$133, DW_AT_name("f")
    2454                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("f")
    2455                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2456                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2457                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2458                            .dwattr $C$DW$133, DW_AT_decl_line(0xb6)
    2459                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    2460                    
    2461                    $C$DW$134       .dwtag  DW_TAG_member
    2462                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$40)
    2463                            .dwattr $C$DW$134, DW_AT_name("a")
    2464                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("a")
    2465                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2467                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2468                            .dwattr $C$DW$134, DW_AT_decl_line(0xb7)
    2469                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    2470                    
    2471                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2472                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xb5)
    2473                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0f)
    2474                            .dwendtag $C$DW$T$41
    2475                    
TMS320C6x Assembler PC v8.1.3 Wed Apr 19 22:40:38 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AutoTune.asm                                                         PAGE   46

    2476                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    2477                            .dwattr $C$DW$T$63, DW_AT_name("xdc_FloatData")
    2478                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$41)
    2479                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2480                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2481                            .dwattr $C$DW$T$63, DW_AT_decl_line(0xb8)
    2482                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2483                    
    2484                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2485                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2486                    
    2487                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2488                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2489                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2490                    
    2491                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    2492                            .dwattr $C$DW$T$64, DW_AT_name("xdc_Ptr")
    2493                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$3)
    2494                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2495                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2496                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x2e)
    2497                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x1a)
    2498                    
    2499                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    2500                            .dwattr $C$DW$T$65, DW_AT_name("Ptr")
    2501                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2502                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2503                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
    2504                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xf6)
    2505                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
    2506                    
    2507                    $C$DW$T$66      .dwtag  DW_TAG_const_type
    2508                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$2)
    2509                    
    2510                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    2511                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2512                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    2513                    
    2514                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    2515                            .dwattr $C$DW$T$68, DW_AT_name("xdc_CPtr")
    2516                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
