;******************************************************************************
;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
;* Date/Time created: Thu Apr 13 15:31:34 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=elf --silicon_version=6740 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C674x                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$150, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$150, DW_AT_decl_column(0x05)

$C$DW$151	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$151, DW_AT_name("HW_PSC_MCBSP0")
	.dwattr $C$DW$151, DW_AT_const_value(0x0e)
	.dwattr $C$DW$151, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$151, DW_AT_decl_column(0x05)

$C$DW$152	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$152, DW_AT_name("HW_PSC_MCBSP1")
	.dwattr $C$DW$152, DW_AT_const_value(0x0f)
	.dwattr $C$DW$152, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$152, DW_AT_decl_column(0x05)

$C$DW$153	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$153, DW_AT_name("HW_PSC_LCDC")
	.dwattr $C$DW$153, DW_AT_const_value(0x10)
	.dwattr $C$DW$153, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$153, DW_AT_decl_column(0x05)

$C$DW$154	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$154, DW_AT_name("HW_PSC_EHRPWM")
	.dwattr $C$DW$154, DW_AT_const_value(0x11)
	.dwattr $C$DW$154, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x60)
	.dwattr $C$DW$154, DW_AT_decl_column(0x05)

$C$DW$155	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$155, DW_AT_name("HW_PSC_MMCSD1")
	.dwattr $C$DW$155, DW_AT_const_value(0x12)
	.dwattr $C$DW$155, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x61)
	.dwattr $C$DW$155, DW_AT_decl_column(0x05)

$C$DW$156	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$156, DW_AT_name("HW_PSC_UPP")
	.dwattr $C$DW$156, DW_AT_const_value(0x13)
	.dwattr $C$DW$156, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x62)
	.dwattr $C$DW$156, DW_AT_decl_column(0x05)

$C$DW$157	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$157, DW_AT_name("HW_PSC_ECAP0_1_2")
	.dwattr $C$DW$157, DW_AT_const_value(0x14)
	.dwattr $C$DW$157, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x63)
	.dwattr $C$DW$157, DW_AT_decl_column(0x05)

$C$DW$158	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$158, DW_AT_name("HW_PSC_TC2")
	.dwattr $C$DW$158, DW_AT_const_value(0x15)
	.dwattr $C$DW$158, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x64)
	.dwattr $C$DW$158, DW_AT_decl_column(0x05)

$C$DW$159	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$159, DW_AT_name("HW_PSC_SCRF0_SS")
	.dwattr $C$DW$159, DW_AT_const_value(0x18)
	.dwattr $C$DW$159, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x65)
	.dwattr $C$DW$159, DW_AT_decl_column(0x05)

$C$DW$160	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$160, DW_AT_name("HW_PSC_SCRF1_SS")
	.dwattr $C$DW$160, DW_AT_const_value(0x19)
	.dwattr $C$DW$160, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x66)
	.dwattr $C$DW$160, DW_AT_decl_column(0x05)

$C$DW$161	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$161, DW_AT_name("HW_PSC_SCRF2_SS")
	.dwattr $C$DW$161, DW_AT_const_value(0x1a)
	.dwattr $C$DW$161, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x67)
	.dwattr $C$DW$161, DW_AT_decl_column(0x05)

$C$DW$162	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$162, DW_AT_name("HW_PSC_SCRF6_SS")
	.dwattr $C$DW$162, DW_AT_const_value(0x1b)
	.dwattr $C$DW$162, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x68)
	.dwattr $C$DW$162, DW_AT_decl_column(0x05)

$C$DW$163	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$163, DW_AT_name("HW_PSC_SCRF7_SS")
	.dwattr $C$DW$163, DW_AT_const_value(0x1c)
	.dwattr $C$DW$163, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x69)
	.dwattr $C$DW$163, DW_AT_decl_column(0x05)

$C$DW$164	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$164, DW_AT_name("HW_PSC_SCRF8_SS")
	.dwattr $C$DW$164, DW_AT_const_value(0x1d)
	.dwattr $C$DW$164, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$164, DW_AT_decl_column(0x05)

$C$DW$165	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$165, DW_AT_name("HW_PSC_BR_F7")
	.dwattr $C$DW$165, DW_AT_const_value(0x1e)
	.dwattr $C$DW$165, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$165, DW_AT_decl_column(0x05)

$C$DW$166	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$166, DW_AT_name("HW_PSC_SHRAM")
	.dwattr $C$DW$166, DW_AT_const_value(0x1f)
	.dwattr $C$DW$166, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$166, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$61

$C$DW$T$62	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$62, DW_AT_name("Psc1Peripheral")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6748.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x03)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x190)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$167, DW_AT_name("REVID")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("REVID")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x41)
	.dwattr $C$DW$167, DW_AT_decl_column(0x15)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$168, DW_AT_name("RSVD0")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x42)
	.dwattr $C$DW$168, DW_AT_decl_column(0x14)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$169, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("DIEIDR0")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x43)
	.dwattr $C$DW$169, DW_AT_decl_column(0x15)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$170, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("DIEIDR1")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x44)
	.dwattr $C$DW$170, DW_AT_decl_column(0x15)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$171, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("DIEIDR2")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x45)
	.dwattr $C$DW$171, DW_AT_decl_column(0x15)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$172, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("DIEIDR3")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x46)
	.dwattr $C$DW$172, DW_AT_decl_column(0x15)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$173, DW_AT_name("DEVIDR0")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("DEVIDR0")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x47)
	.dwattr $C$DW$173, DW_AT_decl_column(0x15)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$174, DW_AT_name("RSVD1")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x48)
	.dwattr $C$DW$174, DW_AT_decl_column(0x14)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$175, DW_AT_name("BOOTCFG")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("BOOTCFG")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x49)
	.dwattr $C$DW$175, DW_AT_decl_column(0x15)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$176, DW_AT_name("CHIPREVIDR")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("CHIPREVIDR")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$176, DW_AT_decl_column(0x15)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$177, DW_AT_name("RSVD2")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$177, DW_AT_decl_column(0x14)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$178, DW_AT_name("KICK0R")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("KICK0R")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$178, DW_AT_decl_column(0x15)

$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$179, DW_AT_name("KICK1R")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("KICK1R")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$179, DW_AT_decl_column(0x15)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$180, DW_AT_name("RSVD3")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$180, DW_AT_decl_column(0x14)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$181, DW_AT_name("HOST1CFG")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("HOST1CFG")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$181, DW_AT_decl_column(0x15)

$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$182, DW_AT_name("RSVD4")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x50)
	.dwattr $C$DW$182, DW_AT_decl_column(0x14)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$183, DW_AT_name("IRAWSTAT")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("IRAWSTAT")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x51)
	.dwattr $C$DW$183, DW_AT_decl_column(0x15)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$184, DW_AT_name("IENSTAT")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("IENSTAT")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x52)
	.dwattr $C$DW$184, DW_AT_decl_column(0x15)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$185, DW_AT_name("IENSET")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("IENSET")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x53)
	.dwattr $C$DW$185, DW_AT_decl_column(0x15)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$186, DW_AT_name("IENCLR")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("IENCLR")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x54)
	.dwattr $C$DW$186, DW_AT_decl_column(0x15)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$187, DW_AT_name("EOI")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("EOI")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x55)
	.dwattr $C$DW$187, DW_AT_decl_column(0x15)

$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$188, DW_AT_name("FLTADDRR")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("FLTADDRR")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x56)
	.dwattr $C$DW$188, DW_AT_decl_column(0x15)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$189, DW_AT_name("FLTSTAT")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("FLTSTAT")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x57)
	.dwattr $C$DW$189, DW_AT_decl_column(0x15)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$190, DW_AT_name("RSVD5")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x58)
	.dwattr $C$DW$190, DW_AT_decl_column(0x14)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$191, DW_AT_name("MSTPRI0")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("MSTPRI0")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x59)
	.dwattr $C$DW$191, DW_AT_decl_column(0x15)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$192, DW_AT_name("MSTPRI1")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("MSTPRI1")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$192, DW_AT_decl_column(0x15)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$193, DW_AT_name("MSTPRI2")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("MSTPRI2")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$193, DW_AT_decl_column(0x15)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$194, DW_AT_name("RSVD6")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("RSVD6")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$194, DW_AT_decl_column(0x14)

$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$195, DW_AT_name("PINMUX0")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("PINMUX0")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$195, DW_AT_decl_column(0x15)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$196, DW_AT_name("PINMUX1")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("PINMUX1")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$196, DW_AT_decl_column(0x15)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$197, DW_AT_name("PINMUX2")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("PINMUX2")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$197, DW_AT_decl_column(0x15)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$198, DW_AT_name("PINMUX3")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("PINMUX3")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x60)
	.dwattr $C$DW$198, DW_AT_decl_column(0x15)

$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$199, DW_AT_name("PINMUX4")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("PINMUX4")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x61)
	.dwattr $C$DW$199, DW_AT_decl_column(0x15)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$200, DW_AT_name("PINMUX5")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("PINMUX5")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x62)
	.dwattr $C$DW$200, DW_AT_decl_column(0x15)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$201, DW_AT_name("PINMUX6")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("PINMUX6")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x63)
	.dwattr $C$DW$201, DW_AT_decl_column(0x15)

$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$202, DW_AT_name("PINMUX7")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("PINMUX7")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x64)
	.dwattr $C$DW$202, DW_AT_decl_column(0x15)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$203, DW_AT_name("PINMUX8")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("PINMUX8")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x65)
	.dwattr $C$DW$203, DW_AT_decl_column(0x15)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$204, DW_AT_name("PINMUX9")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("PINMUX9")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x66)
	.dwattr $C$DW$204, DW_AT_decl_column(0x15)

$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$205, DW_AT_name("PINMUX10")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("PINMUX10")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x67)
	.dwattr $C$DW$205, DW_AT_decl_column(0x15)

$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$206, DW_AT_name("PINMUX11")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("PINMUX11")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x68)
	.dwattr $C$DW$206, DW_AT_decl_column(0x15)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$207, DW_AT_name("PINMUX12")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("PINMUX12")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x69)
	.dwattr $C$DW$207, DW_AT_decl_column(0x15)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$208, DW_AT_name("PINMUX13")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("PINMUX13")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$208, DW_AT_decl_column(0x15)

$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$209, DW_AT_name("PINMUX14")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("PINMUX14")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$209, DW_AT_decl_column(0x15)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$210, DW_AT_name("PINMUX15")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("PINMUX15")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$210, DW_AT_decl_column(0x15)

$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$211, DW_AT_name("PINMUX16")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("PINMUX16")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$211, DW_AT_decl_column(0x15)

$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$212, DW_AT_name("PINMUX17")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("PINMUX17")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$212, DW_AT_decl_column(0x15)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$213, DW_AT_name("PINMUX18")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("PINMUX18")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$213, DW_AT_decl_column(0x15)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$214, DW_AT_name("PINMUX19")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("PINMUX19")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x70)
	.dwattr $C$DW$214, DW_AT_decl_column(0x15)

$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$215, DW_AT_name("SUSPSRC")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("SUSPSRC")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x71)
	.dwattr $C$DW$215, DW_AT_decl_column(0x15)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$216, DW_AT_name("CHIPSIG")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("CHIPSIG")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x72)
	.dwattr $C$DW$216, DW_AT_decl_column(0x15)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$217, DW_AT_name("CHIPSIG_CLR")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("CHIPSIG_CLR")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x73)
	.dwattr $C$DW$217, DW_AT_decl_column(0x15)

$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$218, DW_AT_name("CFGCHIP0")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("CFGCHIP0")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x74)
	.dwattr $C$DW$218, DW_AT_decl_column(0x15)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$219, DW_AT_name("CFGCHIP1")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("CFGCHIP1")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x75)
	.dwattr $C$DW$219, DW_AT_decl_column(0x15)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$220, DW_AT_name("CFGCHIP2")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("CFGCHIP2")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x76)
	.dwattr $C$DW$220, DW_AT_decl_column(0x15)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$221, DW_AT_name("CFGCHIP3")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("CFGCHIP3")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x77)
	.dwattr $C$DW$221, DW_AT_decl_column(0x15)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$222, DW_AT_name("CFGCHIP4")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("CFGCHIP4")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x78)
	.dwattr $C$DW$222, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$33

$C$DW$T$65	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$65, DW_AT_name("CSL_SyscfgRegs")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x03)

$C$DW$T$66	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)

$C$DW$T$67	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_address_class(0x20)

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("CSL_SyscfgRegsOvly")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_C6748.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x2e)

$C$DW$T$69	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0xa80)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$223, DW_AT_name("REVID")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("REVID")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x78)
	.dwattr $C$DW$223, DW_AT_decl_column(0x15)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$224, DW_AT_name("RSVD0")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x79)
	.dwattr $C$DW$224, DW_AT_decl_column(0x14)

$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$225, DW_AT_name("INTEVAL")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("INTEVAL")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$225, DW_AT_decl_column(0x15)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$226, DW_AT_name("RSVD1")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$226, DW_AT_decl_column(0x14)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$227, DW_AT_name("MERRPR0")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("MERRPR0")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$227, DW_AT_decl_column(0x15)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$228, DW_AT_name("RSVD2")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$228, DW_AT_decl_column(0x14)

$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$229, DW_AT_name("MERRCR0")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("MERRCR0")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$229, DW_AT_decl_column(0x15)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$230, DW_AT_name("RSVD3")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$230, DW_AT_decl_column(0x14)

$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$231, DW_AT_name("PERRPR")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("PERRPR")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x80)
	.dwattr $C$DW$231, DW_AT_decl_column(0x15)

$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$232, DW_AT_name("RSVD4")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x81)
	.dwattr $C$DW$232, DW_AT_decl_column(0x14)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$233, DW_AT_name("PERRCR")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("PERRCR")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x82)
	.dwattr $C$DW$233, DW_AT_decl_column(0x15)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$234, DW_AT_name("RSVD5")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x83)
	.dwattr $C$DW$234, DW_AT_decl_column(0x14)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$235, DW_AT_name("PTCMD")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("PTCMD")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x84)
	.dwattr $C$DW$235, DW_AT_decl_column(0x15)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$236, DW_AT_name("RSVD6")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("RSVD6")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x85)
	.dwattr $C$DW$236, DW_AT_decl_column(0x14)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$237, DW_AT_name("PTSTAT")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("PTSTAT")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x86)
	.dwattr $C$DW$237, DW_AT_decl_column(0x15)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$238, DW_AT_name("RSVD7")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("RSVD7")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x87)
	.dwattr $C$DW$238, DW_AT_decl_column(0x14)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$239, DW_AT_name("PDSTAT0")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("PDSTAT0")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x88)
	.dwattr $C$DW$239, DW_AT_decl_column(0x15)

$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$240, DW_AT_name("PDSTAT1")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("PDSTAT1")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x89)
	.dwattr $C$DW$240, DW_AT_decl_column(0x15)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$241, DW_AT_name("RSVD8")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("RSVD8")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$241, DW_AT_decl_column(0x14)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$242, DW_AT_name("PDCTL0")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("PDCTL0")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$242, DW_AT_decl_column(0x15)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$243, DW_AT_name("PDCTL1")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("PDCTL1")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$243, DW_AT_decl_column(0x15)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$244, DW_AT_name("RSVD9")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("RSVD9")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$244, DW_AT_decl_column(0x14)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$245, DW_AT_name("PDCFG0")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("PDCFG0")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$245, DW_AT_decl_column(0x15)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$246, DW_AT_name("PDCFG1")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("PDCFG1")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$246, DW_AT_decl_column(0x15)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$247, DW_AT_name("RSVD10")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("RSVD10")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x90)
	.dwattr $C$DW$247, DW_AT_decl_column(0x14)

$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$248, DW_AT_name("MDSTAT")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("MDSTAT")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x91)
	.dwattr $C$DW$248, DW_AT_decl_column(0x15)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$249, DW_AT_name("RSVD11")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("RSVD11")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x92)
	.dwattr $C$DW$249, DW_AT_decl_column(0x14)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$250, DW_AT_name("MDCTL")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("MDCTL")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x93)
	.dwattr $C$DW$250, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$42

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("CSL_PscRegs")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x03)

$C$DW$T$71	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)

$C$DW$T$72	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$72, DW_AT_address_class(0x20)

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("CSL_PscRegsOvly")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6748.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x2b)


$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$251, DW_AT_name("f")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$251, DW_AT_decl_column(0x0f)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$252, DW_AT_name("a")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$46

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x03)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x1a)

$C$DW$T$76	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$76, DW_AT_name("Ptr")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x19)

$C$DW$T$83	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$2)

$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)

$C$DW$T$85	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$85, DW_AT_name("xdc_CPtr")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x1a)

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("CPtr")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x19)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$87	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$87, DW_AT_name("int8_t")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdint.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x1d)

$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdint.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x17)

$C$DW$T$89	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$89, DW_AT_name("xdc_Int8")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/targets/std.h")
