;******************************************************************************
;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
;* Date/Time created: Thu Apr 20 05:51:02 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=elf --silicon_version=6740 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C674x                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$298, DW_AT_name("CSL_EDMACC_ANY")
	.dwattr $C$DW$298, DW_AT_const_value(-1)
	.dwattr $C$DW$298, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x407)
	.dwattr $C$DW$298, DW_AT_decl_column(0x03)

$C$DW$299	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$299, DW_AT_name("CSL_EDMACC_0")
	.dwattr $C$DW$299, DW_AT_const_value(0x00)
	.dwattr $C$DW$299, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x408)
	.dwattr $C$DW$299, DW_AT_decl_column(0x03)

	.dwattr $C$DW$T$627, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$627, DW_AT_decl_line(0x406)
	.dwattr $C$DW$T$627, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$627

$C$DW$T$628	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$628, DW_AT_name("CSL_EdmaccNum")
	.dwattr $C$DW$T$628, DW_AT_type(*$C$DW$T$627)
	.dwattr $C$DW$T$628, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$628, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$628, DW_AT_decl_line(0x409)
	.dwattr $C$DW$T$628, DW_AT_decl_column(0x03)


$C$DW$T$629	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$629, DW_AT_byte_size(0x04)
$C$DW$300	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$300, DW_AT_name("CSL_EDMA3_QUE_0")
	.dwattr $C$DW$300, DW_AT_const_value(0x00)
	.dwattr $C$DW$300, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x40e)
	.dwattr $C$DW$300, DW_AT_decl_column(0x05)

$C$DW$301	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$301, DW_AT_name("CSL_EDMA3_QUE_1")
	.dwattr $C$DW$301, DW_AT_const_value(0x01)
	.dwattr $C$DW$301, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x40f)
	.dwattr $C$DW$301, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$629, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$629, DW_AT_decl_line(0x40d)
	.dwattr $C$DW$T$629, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$629

$C$DW$T$630	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$630, DW_AT_name("CSL_Edma3Que")
	.dwattr $C$DW$T$630, DW_AT_type(*$C$DW$T$629)
	.dwattr $C$DW$T$630, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$630, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$630, DW_AT_decl_line(0x410)
	.dwattr $C$DW$T$630, DW_AT_decl_column(0x03)


$C$DW$T$631	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$631, DW_AT_byte_size(0x04)
$C$DW$302	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$302, DW_AT_name("CSL_EDMATC_ANY")
	.dwattr $C$DW$302, DW_AT_const_value(-1)
	.dwattr $C$DW$302, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x419)
	.dwattr $C$DW$302, DW_AT_decl_column(0x03)

$C$DW$303	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$303, DW_AT_name("CSL_EDMATC_0")
	.dwattr $C$DW$303, DW_AT_const_value(0x00)
	.dwattr $C$DW$303, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x41a)
	.dwattr $C$DW$303, DW_AT_decl_column(0x03)

$C$DW$304	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$304, DW_AT_name("CSL_EDMATC_1")
	.dwattr $C$DW$304, DW_AT_const_value(0x01)
	.dwattr $C$DW$304, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x41b)
	.dwattr $C$DW$304, DW_AT_decl_column(0x03)

	.dwattr $C$DW$T$631, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$631, DW_AT_decl_line(0x418)
	.dwattr $C$DW$T$631, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$631

$C$DW$T$632	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$632, DW_AT_name("CSL_EdmatcNum")
	.dwattr $C$DW$T$632, DW_AT_type(*$C$DW$T$631)
	.dwattr $C$DW$T$632, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$632, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$632, DW_AT_decl_line(0x41c)
	.dwattr $C$DW$T$632, DW_AT_decl_column(0x03)


$C$DW$T$633	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$633, DW_AT_byte_size(0x04)
$C$DW$305	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$305, DW_AT_name("CSL_DAT_PRI_DEFAULT")
	.dwattr $C$DW$305, DW_AT_const_value(0x00)
	.dwattr $C$DW$305, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x449)
	.dwattr $C$DW$305, DW_AT_decl_column(0x05)

$C$DW$306	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$306, DW_AT_name("CSL_DAT_PRI_0")
	.dwattr $C$DW$306, DW_AT_const_value(0x00)
	.dwattr $C$DW$306, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x44a)
	.dwattr $C$DW$306, DW_AT_decl_column(0x05)

$C$DW$307	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$307, DW_AT_name("CSL_DAT_PRI_1")
	.dwattr $C$DW$307, DW_AT_const_value(0x01)
	.dwattr $C$DW$307, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x44b)
	.dwattr $C$DW$307, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$633, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$633, DW_AT_decl_line(0x448)
	.dwattr $C$DW$T$633, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$633

$C$DW$T$634	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$634, DW_AT_name("CSL_DatPriority")
	.dwattr $C$DW$T$634, DW_AT_type(*$C$DW$T$633)
	.dwattr $C$DW$T$634, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$634, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138.h")
	.dwattr $C$DW$T$634, DW_AT_decl_line(0x44c)
	.dwattr $C$DW$T$634, DW_AT_decl_column(0x03)


$C$DW$T$161	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x190)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$308, DW_AT_name("REVID")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("REVID")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x43)
	.dwattr $C$DW$308, DW_AT_decl_column(0x15)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$309, DW_AT_name("RSVD0")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x44)
	.dwattr $C$DW$309, DW_AT_decl_column(0x14)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$310, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("DIEIDR0")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x45)
	.dwattr $C$DW$310, DW_AT_decl_column(0x15)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$311, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("DIEIDR1")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x46)
	.dwattr $C$DW$311, DW_AT_decl_column(0x15)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$312, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("DIEIDR2")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x47)
	.dwattr $C$DW$312, DW_AT_decl_column(0x15)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$313, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("DIEIDR3")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x48)
	.dwattr $C$DW$313, DW_AT_decl_column(0x15)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$314, DW_AT_name("DEVIDR0")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("DEVIDR0")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x49)
	.dwattr $C$DW$314, DW_AT_decl_column(0x15)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$315, DW_AT_name("RSVD1")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$315, DW_AT_decl_column(0x14)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$316, DW_AT_name("BOOTCFG")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("BOOTCFG")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$316, DW_AT_decl_column(0x15)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$317, DW_AT_name("CHIPREVIDR")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("CHIPREVIDR")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$317, DW_AT_decl_column(0x15)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$158)
	.dwattr $C$DW$318, DW_AT_name("RSVD2")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$318, DW_AT_decl_column(0x14)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$319, DW_AT_name("KICK0R")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("KICK0R")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$319, DW_AT_decl_column(0x15)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$320, DW_AT_name("KICK1R")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("KICK1R")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$320, DW_AT_decl_column(0x15)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$321, DW_AT_name("HOST0CFG")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("HOST0CFG")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x50)
	.dwattr $C$DW$321, DW_AT_decl_column(0x15)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$322, DW_AT_name("HOST1CFG")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("HOST1CFG")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x51)
	.dwattr $C$DW$322, DW_AT_decl_column(0x15)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$323, DW_AT_name("RSVD3")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x52)
	.dwattr $C$DW$323, DW_AT_decl_column(0x14)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$324, DW_AT_name("IRAWSTAT")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("IRAWSTAT")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x53)
	.dwattr $C$DW$324, DW_AT_decl_column(0x15)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$325, DW_AT_name("IENSTAT")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("IENSTAT")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x54)
	.dwattr $C$DW$325, DW_AT_decl_column(0x15)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$326, DW_AT_name("IENSET")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("IENSET")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x55)
	.dwattr $C$DW$326, DW_AT_decl_column(0x15)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$327, DW_AT_name("IENCLR")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("IENCLR")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x56)
	.dwattr $C$DW$327, DW_AT_decl_column(0x15)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$328, DW_AT_name("EOI")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("EOI")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x57)
	.dwattr $C$DW$328, DW_AT_decl_column(0x15)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$329, DW_AT_name("FLTADDRR")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("FLTADDRR")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x58)
	.dwattr $C$DW$329, DW_AT_decl_column(0x15)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$330, DW_AT_name("FLTSTAT")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("FLTSTAT")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x59)
	.dwattr $C$DW$330, DW_AT_decl_column(0x15)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$331, DW_AT_name("RSVD4")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$331, DW_AT_decl_column(0x14)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$332, DW_AT_name("MSTPRI0")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("MSTPRI0")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$332, DW_AT_decl_column(0x15)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$333, DW_AT_name("MSTPRI1")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("MSTPRI1")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$333, DW_AT_decl_column(0x15)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$334, DW_AT_name("MSTPRI2")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("MSTPRI2")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$334, DW_AT_decl_column(0x15)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$335, DW_AT_name("RSVD5")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$335, DW_AT_decl_column(0x14)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$336, DW_AT_name("PINMUX0")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("PINMUX0")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$336, DW_AT_decl_column(0x15)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$337, DW_AT_name("PINMUX1")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("PINMUX1")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x60)
	.dwattr $C$DW$337, DW_AT_decl_column(0x15)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$338, DW_AT_name("PINMUX2")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("PINMUX2")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x61)
	.dwattr $C$DW$338, DW_AT_decl_column(0x15)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$339, DW_AT_name("PINMUX3")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("PINMUX3")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x62)
	.dwattr $C$DW$339, DW_AT_decl_column(0x15)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$340, DW_AT_name("PINMUX4")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("PINMUX4")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x63)
	.dwattr $C$DW$340, DW_AT_decl_column(0x15)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$341, DW_AT_name("PINMUX5")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("PINMUX5")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x64)
	.dwattr $C$DW$341, DW_AT_decl_column(0x15)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$342, DW_AT_name("PINMUX6")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("PINMUX6")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x65)
	.dwattr $C$DW$342, DW_AT_decl_column(0x15)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$343, DW_AT_name("PINMUX7")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("PINMUX7")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x66)
	.dwattr $C$DW$343, DW_AT_decl_column(0x15)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$344, DW_AT_name("PINMUX8")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("PINMUX8")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x67)
	.dwattr $C$DW$344, DW_AT_decl_column(0x15)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$345, DW_AT_name("PINMUX9")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("PINMUX9")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x68)
	.dwattr $C$DW$345, DW_AT_decl_column(0x15)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$346, DW_AT_name("PINMUX10")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("PINMUX10")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x69)
	.dwattr $C$DW$346, DW_AT_decl_column(0x15)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$347, DW_AT_name("PINMUX11")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("PINMUX11")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$347, DW_AT_decl_column(0x15)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$348, DW_AT_name("PINMUX12")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("PINMUX12")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$348, DW_AT_decl_column(0x15)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$349, DW_AT_name("PINMUX13")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("PINMUX13")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$349, DW_AT_decl_column(0x15)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$350, DW_AT_name("PINMUX14")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("PINMUX14")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$350, DW_AT_decl_column(0x15)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$351, DW_AT_name("PINMUX15")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("PINMUX15")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$351, DW_AT_decl_column(0x15)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$352, DW_AT_name("PINMUX16")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("PINMUX16")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$352, DW_AT_decl_column(0x15)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$353, DW_AT_name("PINMUX17")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("PINMUX17")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x70)
	.dwattr $C$DW$353, DW_AT_decl_column(0x15)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$354, DW_AT_name("PINMUX18")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("PINMUX18")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x71)
	.dwattr $C$DW$354, DW_AT_decl_column(0x15)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$355, DW_AT_name("PINMUX19")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("PINMUX19")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x72)
	.dwattr $C$DW$355, DW_AT_decl_column(0x15)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$356, DW_AT_name("SUSPSRC")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("SUSPSRC")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x73)
	.dwattr $C$DW$356, DW_AT_decl_column(0x15)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$357, DW_AT_name("CHIPSIG")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("CHIPSIG")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x74)
	.dwattr $C$DW$357, DW_AT_decl_column(0x15)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$358, DW_AT_name("CHIPSIG_CLR")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("CHIPSIG_CLR")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x75)
	.dwattr $C$DW$358, DW_AT_decl_column(0x15)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$359, DW_AT_name("CFGCHIP0")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("CFGCHIP0")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x76)
	.dwattr $C$DW$359, DW_AT_decl_column(0x15)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$360, DW_AT_name("CFGCHIP1")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("CFGCHIP1")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x77)
	.dwattr $C$DW$360, DW_AT_decl_column(0x15)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$361, DW_AT_name("CFGCHIP2")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("CFGCHIP2")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x78)
	.dwattr $C$DW$361, DW_AT_decl_column(0x15)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$362, DW_AT_name("CFGCHIP3")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("CFGCHIP3")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x79)
	.dwattr $C$DW$362, DW_AT_decl_column(0x15)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$363, DW_AT_name("CFGCHIP4")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("CFGCHIP4")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$363, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$161

$C$DW$T$637	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$637, DW_AT_name("CSL_SyscfgRegs")
	.dwattr $C$DW$T$637, DW_AT_type(*$C$DW$T$161)
	.dwattr $C$DW$T$637, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$637, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$T$637, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$637, DW_AT_decl_column(0x03)

$C$DW$T$638	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$637)

$C$DW$T$639	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$638)
	.dwattr $C$DW$T$639, DW_AT_address_class(0x20)

$C$DW$T$640	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$640, DW_AT_name("CSL_SyscfgRegsOvly")
	.dwattr $C$DW$T$640, DW_AT_type(*$C$DW$T$639)
	.dwattr $C$DW$T$640, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$640, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0_OMAPL138.h")
	.dwattr $C$DW$T$640, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$640, DW_AT_decl_column(0x2e)

$C$DW$T$641	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$641, DW_AT_type(*$C$DW$T$640)


$C$DW$T$165	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$165, DW_AT_byte_size(0x08)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$364, DW_AT_name("length")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$364, DW_AT_decl_column(0x16)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$365, DW_AT_name("elem")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$365, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$165, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$T$165, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$165

$C$DW$T$642	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$642, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$642, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$642, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$642, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$642, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$T$642, DW_AT_decl_column(0x48)

$C$DW$T$643	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$643, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$643, DW_AT_type(*$C$DW$T$642)
	.dwattr $C$DW$T$643, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$643, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$643, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$T$643, DW_AT_decl_column(0x2b)


$C$DW$T$166	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$166, DW_AT_byte_size(0x08)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$366, DW_AT_name("length")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$366, DW_AT_decl_column(0x16)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$367, DW_AT_name("elem")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$367, DW_AT_decl_column(0x40)

	.dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$166

$C$DW$T$644	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$644, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$644, DW_AT_type(*$C$DW$T$166)
	.dwattr $C$DW$T$644, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$644, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$644, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$644, DW_AT_decl_column(0x48)

$C$DW$T$645	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$645, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$644)
	.dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$645, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$645, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$645, DW_AT_decl_column(0x2c)


$C$DW$T$170	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$170, DW_AT_byte_size(0x08)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$368, DW_AT_name("length")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$368, DW_AT_decl_column(0x16)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$369, DW_AT_name("elem")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$369, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$170

$C$DW$T$646	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$646, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$646, DW_AT_type(*$C$DW$T$170)
	.dwattr $C$DW$T$646, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$646, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$646, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$646, DW_AT_decl_column(0x49)

$C$DW$T$647	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$647, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$647, DW_AT_type(*$C$DW$T$646)
	.dwattr $C$DW$T$647, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$647, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$647, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$647, DW_AT_decl_column(0x2c)


$C$DW$T$171	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$171, DW_AT_byte_size(0x08)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$370, DW_AT_name("length")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$370, DW_AT_decl_column(0x16)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$169)
	.dwattr $C$DW$371, DW_AT_name("elem")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$371, DW_AT_decl_column(0x41)

	.dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$171

$C$DW$T$648	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$648, DW_AT_name("__CARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$648, DW_AT_type(*$C$DW$T$171)
	.dwattr $C$DW$T$648, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$648, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$648, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$T$648, DW_AT_decl_column(0x49)

$C$DW$T$649	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$649, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$649, DW_AT_type(*$C$DW$T$648)
	.dwattr $C$DW$T$649, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$649, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$649, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$T$649, DW_AT_decl_column(0x2d)


$C$DW$T$180	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$180, DW_AT_byte_size(0xa80)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$372, DW_AT_name("REVID")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("REVID")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$372, DW_AT_decl_column(0x15)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$160)
	.dwattr $C$DW$373, DW_AT_name("RSVD0")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$373, DW_AT_decl_column(0x14)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$374, DW_AT_name("INTEVAL")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("INTEVAL")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$374, DW_AT_decl_column(0x15)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$172)
	.dwattr $C$DW$375, DW_AT_name("RSVD1")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$375, DW_AT_decl_column(0x14)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$376, DW_AT_name("MERRPR0")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("MERRPR0")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$376, DW_AT_decl_column(0x15)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$377, DW_AT_name("RSVD2")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x80)
	.dwattr $C$DW$377, DW_AT_decl_column(0x14)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$378, DW_AT_name("MERRCR0")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("MERRCR0")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x81)
	.dwattr $C$DW$378, DW_AT_decl_column(0x15)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$173)
	.dwattr $C$DW$379, DW_AT_name("RSVD3")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x82)
	.dwattr $C$DW$379, DW_AT_decl_column(0x14)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$380, DW_AT_name("PERRPR")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("PERRPR")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x83)
	.dwattr $C$DW$380, DW_AT_decl_column(0x15)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$381, DW_AT_name("RSVD4")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x84)
	.dwattr $C$DW$381, DW_AT_decl_column(0x14)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$382, DW_AT_name("PERRCR")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("PERRCR")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x85)
	.dwattr $C$DW$382, DW_AT_decl_column(0x15)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$174)
	.dwattr $C$DW$383, DW_AT_name("RSVD5")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x86)
	.dwattr $C$DW$383, DW_AT_decl_column(0x14)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$384, DW_AT_name("PTCMD")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("PTCMD")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x87)
	.dwattr $C$DW$384, DW_AT_decl_column(0x15)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$157)
	.dwattr $C$DW$385, DW_AT_name("RSVD6")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("RSVD6")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x88)
	.dwattr $C$DW$385, DW_AT_decl_column(0x14)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$386, DW_AT_name("PTSTAT")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("PTSTAT")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x89)
	.dwattr $C$DW$386, DW_AT_decl_column(0x15)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$175)
	.dwattr $C$DW$387, DW_AT_name("RSVD7")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("RSVD7")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$387, DW_AT_decl_column(0x14)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$388, DW_AT_name("PDSTAT0")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("PDSTAT0")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$388, DW_AT_decl_column(0x15)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$389, DW_AT_name("PDSTAT1")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("PDSTAT1")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$389, DW_AT_decl_column(0x15)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$390, DW_AT_name("RSVD8")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("RSVD8")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$390, DW_AT_decl_column(0x14)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$391, DW_AT_name("PDCTL0")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("PDCTL0")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$391, DW_AT_decl_column(0x15)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$392, DW_AT_name("PDCTL1")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("PDCTL1")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$392, DW_AT_decl_column(0x15)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$176)
	.dwattr $C$DW$393, DW_AT_name("RSVD9")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("RSVD9")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x90)
	.dwattr $C$DW$393, DW_AT_decl_column(0x14)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$394, DW_AT_name("PDCFG0")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("PDCFG0")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x91)
	.dwattr $C$DW$394, DW_AT_decl_column(0x15)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$151)
	.dwattr $C$DW$395, DW_AT_name("PDCFG1")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("PDCFG1")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x92)
	.dwattr $C$DW$395, DW_AT_decl_column(0x15)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$177)
	.dwattr $C$DW$396, DW_AT_name("RSVD10")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("RSVD10")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x93)
	.dwattr $C$DW$396, DW_AT_decl_column(0x14)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$397, DW_AT_name("MDSTAT")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("MDSTAT")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x94)
	.dwattr $C$DW$397, DW_AT_decl_column(0x15)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$179)
	.dwattr $C$DW$398, DW_AT_name("RSVD11")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("RSVD11")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x95)
	.dwattr $C$DW$398, DW_AT_decl_column(0x14)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$178)
	.dwattr $C$DW$399, DW_AT_name("MDCTL")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("MDCTL")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x96)
	.dwattr $C$DW$399, DW_AT_decl_column(0x15)

	.dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$T$180, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$180, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$180

$C$DW$T$650	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$650, DW_AT_name("CSL_PscRegs")
	.dwattr $C$DW$T$650, DW_AT_type(*$C$DW$T$180)
	.dwattr $C$DW$T$650, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$650, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$T$650, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$650, DW_AT_decl_column(0x03)

$C$DW$T$651	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$651, DW_AT_type(*$C$DW$T$650)

$C$DW$T$652	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$652, DW_AT_type(*$C$DW$T$651)
	.dwattr $C$DW$T$652, DW_AT_address_class(0x20)

$C$DW$T$653	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$653, DW_AT_name("CSL_PscRegsOvly")
	.dwattr $C$DW$T$653, DW_AT_type(*$C$DW$T$652)
	.dwattr $C$DW$T$653, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$653, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMAPL138.h")
	.dwattr $C$DW$T$653, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$653, DW_AT_decl_column(0x2b)


$C$DW$T$185	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$185, DW_AT_byte_size(0x04)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$400, DW_AT_name("X")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("X")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x35)
	.dwattr $C$DW$400, DW_AT_decl_column(0x0c)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$401, DW_AT_name("Y")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("Y")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x36)
	.dwattr $C$DW$401, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$185, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$T$185, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$185, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$185

$C$DW$T$654	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$654, DW_AT_name("Location")
	.dwattr $C$DW$T$654, DW_AT_type(*$C$DW$T$185)
	.dwattr $C$DW$T$654, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$654, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$T$654, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$654, DW_AT_decl_column(0x03)


$C$DW$T$188	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$188, DW_AT_byte_size(0x08)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$187)
	.dwattr $C$DW$402, DW_AT_name("Event")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x42)
	.dwattr $C$DW$402, DW_AT_decl_column(0x14)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$403, DW_AT_name("X")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("X")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x43)
	.dwattr $C$DW$403, DW_AT_decl_column(0x0c)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$184)
	.dwattr $C$DW$404, DW_AT_name("Y")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("Y")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x44)
	.dwattr $C$DW$404, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$188, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$T$188, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$188, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$188

$C$DW$T$655	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$655, DW_AT_name("TouchInfo")
	.dwattr $C$DW$T$655, DW_AT_type(*$C$DW$T$188)
	.dwattr $C$DW$T$655, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$655, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicCheckPeripherals/inc/LCD.h")
	.dwattr $C$DW$T$655, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$655, DW_AT_decl_column(0x03)


$C$DW$T$192	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$192, DW_AT_byte_size(0x04)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$189)
	.dwattr $C$DW$405, DW_AT_name("f")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$405, DW_AT_decl_column(0x0f)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$406, DW_AT_name("a")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$406, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$192

$C$DW$T$656	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$656, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$656, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$656, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$656, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$656, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$656, DW_AT_decl_column(0x03)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$262	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$262, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$262, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$262, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$262, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x1a)

$C$DW$T$657	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$657, DW_AT_name("CT__ti_sysbios_BIOS_Module__gateObj")
	.dwattr $C$DW$T$657, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$657, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$657, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$657, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$657, DW_AT_decl_column(0x11)

$C$DW$T$658	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$658, DW_AT_name("CT__ti_sysbios_BIOS_Module__gatePrms")
	.dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$658, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$658, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$658, DW_AT_decl_column(0x11)

$C$DW$T$659	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$659, DW_AT_name("CT__ti_sysbios_BIOS_Module__loggerObj")
	.dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$659, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$659, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$659, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$659, DW_AT_decl_column(0x11)

$C$DW$T$660	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$660, DW_AT_name("CT__ti_sysbios_BIOS_Object__table")
	.dwattr $C$DW$T$660, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$660, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$660, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/BIOS.h")
	.dwattr $C$DW$T$660, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$660, DW_AT_decl_column(0x11)

$C$DW$T$661	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$661, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__gateObj")
	.dwattr $C$DW$T$661, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$661, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$661, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$661, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$661, DW_AT_decl_column(0x11)

$C$DW$T$662	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$662, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__gatePrms")
	.dwattr $C$DW$T$662, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$662, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$662, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$662, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$662, DW_AT_decl_column(0x11)

$C$DW$T$663	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$663, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Module__loggerObj")
	.dwattr $C$DW$T$663, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$663, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$663, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$663, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$663, DW_AT_decl_column(0x11)

$C$DW$T$664	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$664, DW_AT_name("CT__ti_sysbios_BIOS_RtsGateProxy_Object__table")
	.dwattr $C$DW$T$664, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$664, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$664, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/package/BIOS_RtsGateProxy.h")
	.dwattr $C$DW$T$664, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$T$664, DW_AT_decl_column(0x11)

$C$DW$T$665	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$665, DW_AT_name("CT__ti_sysbios_hal_Hwi_HwiProxy_Module__gateObj")
	.dwattr $C$DW$T$665, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$665, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$665, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/package/Hwi_HwiProxy.h")
	.dwattr $C$DW$T$665, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$665, DW_AT_decl_column(0x11)

$C$DW$T$666	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$666, DW_AT_name("CT__ti_sysbios_hal_Hwi_HwiProxy_Module__gatePrms")
	.dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$666, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/package/Hwi_HwiProxy.h")
	.dwattr $C$DW$T$666, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$666, DW_AT_decl_column(0x11)

$C$DW$T$667	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$667, DW_AT_name("CT__ti_sysbios_hal_Hwi_HwiProxy_Module__loggerObj")
	.dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$667, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$667, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/package/Hwi_HwiProxy.h")
	.dwattr $C$DW$T$667, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$667, DW_AT_decl_column(0x11)

$C$DW$T$668	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$668, DW_AT_name("CT__ti_sysbios_hal_Hwi_HwiProxy_Object__table")
	.dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$668, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$668, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/package/Hwi_HwiProxy.h")
	.dwattr $C$DW$T$668, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$668, DW_AT_decl_column(0x11)

$C$DW$T$669	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$669, DW_AT_name("CT__ti_sysbios_hal_Hwi_Module__gateObj")
	.dwattr $C$DW$T$669, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$669, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$669, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/Hwi.h")
	.dwattr $C$DW$T$669, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$669, DW_AT_decl_column(0x11)

$C$DW$T$670	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$670, DW_AT_name("CT__ti_sysbios_hal_Hwi_Module__gatePrms")
	.dwattr $C$DW$T$670, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$670, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$670, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/Hwi.h")
	.dwattr $C$DW$T$670, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$T$670, DW_AT_decl_column(0x11)

$C$DW$T$671	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$671, DW_AT_name("CT__ti_sysbios_hal_Hwi_Module__loggerObj")
	.dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$671, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$671, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/Hwi.h")
	.dwattr $C$DW$T$671, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$671, DW_AT_decl_column(0x11)

$C$DW$T$672	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$672, DW_AT_name("CT__ti_sysbios_hal_Hwi_Object__table")
	.dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$672, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$672, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/hal/Hwi.h")
	.dwattr $C$DW$T$672, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$672, DW_AT_decl_column(0x11)

$C$DW$T$673	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$673, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__gateObj")
	.dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$673, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$673, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$673, DW_AT_decl_column(0x11)

$C$DW$T$674	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$674, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__gatePrms")
	.dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$674, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$674, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$674, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$674, DW_AT_decl_column(0x11)

$C$DW$T$675	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$675, DW_AT_name("CT__ti_sysbios_knl_Clock_Module__loggerObj")
	.dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$675, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$675, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$675, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$675, DW_AT_decl_column(0x11)

$C$DW$T$676	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$676, DW_AT_name("CT__ti_sysbios_knl_Clock_Object__table")
	.dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$676, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Clock.h")
	.dwattr $C$DW$T$676, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$676, DW_AT_decl_column(0x11)

$C$DW$T$677	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$677, DW_AT_name("CT__ti_sysbios_knl_Clock_TimerProxy_Module__gateObj")
	.dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$677, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$677, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Clock_TimerProxy.h")
	.dwattr $C$DW$T$677, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$677, DW_AT_decl_column(0x11)

$C$DW$T$678	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$678, DW_AT_name("CT__ti_sysbios_knl_Clock_TimerProxy_Module__gatePrms")
	.dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$678, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Clock_TimerProxy.h")
	.dwattr $C$DW$T$678, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$678, DW_AT_decl_column(0x11)

$C$DW$T$679	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$679, DW_AT_name("CT__ti_sysbios_knl_Clock_TimerProxy_Module__loggerObj")
	.dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$679, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$679, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Clock_TimerProxy.h")
	.dwattr $C$DW$T$679, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$679, DW_AT_decl_column(0x11)

$C$DW$T$680	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$680, DW_AT_name("CT__ti_sysbios_knl_Clock_TimerProxy_Object__table")
	.dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$680, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Clock_TimerProxy.h")
	.dwattr $C$DW$T$680, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$680, DW_AT_decl_column(0x11)

$C$DW$T$681	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$681, DW_AT_name("CT__ti_sysbios_knl_Event_Module__gateObj")
	.dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$681, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$681, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$681, DW_AT_decl_column(0x11)

$C$DW$T$682	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$682, DW_AT_name("CT__ti_sysbios_knl_Event_Module__gatePrms")
	.dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$682, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$682, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$682, DW_AT_decl_column(0x11)

$C$DW$T$683	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$683, DW_AT_name("CT__ti_sysbios_knl_Event_Module__loggerObj")
	.dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$683, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$683, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$683, DW_AT_decl_column(0x11)

$C$DW$T$684	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$684, DW_AT_name("CT__ti_sysbios_knl_Event_Object__table")
	.dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$684, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Event.h")
	.dwattr $C$DW$T$684, DW_AT_decl_line(0x158)
	.dwattr $C$DW$T$684, DW_AT_decl_column(0x11)

$C$DW$T$685	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$685, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__gateObj")
	.dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$685, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$685, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$685, DW_AT_decl_column(0x11)

$C$DW$T$686	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$686, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__gatePrms")
	.dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$686, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$686, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$686, DW_AT_decl_column(0x11)

$C$DW$T$687	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$687, DW_AT_name("CT__ti_sysbios_knl_Queue_Module__loggerObj")
	.dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$687, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$687, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$687, DW_AT_decl_column(0x11)

$C$DW$T$688	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$688, DW_AT_name("CT__ti_sysbios_knl_Queue_Object__table")
	.dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$688, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Queue.h")
	.dwattr $C$DW$T$688, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$688, DW_AT_decl_column(0x11)

$C$DW$T$689	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$689, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__gateObj")
	.dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$689, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$689, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$689, DW_AT_decl_column(0x11)

$C$DW$T$690	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$690, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__gatePrms")
	.dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$690, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$690, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$690, DW_AT_decl_column(0x11)

$C$DW$T$691	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$691, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Module__loggerObj")
	.dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$691, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$691, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$691, DW_AT_decl_column(0x11)

$C$DW$T$692	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$692, DW_AT_name("CT__ti_sysbios_knl_Semaphore_Object__table")
	.dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$692, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Semaphore.h")
	.dwattr $C$DW$T$692, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$692, DW_AT_decl_column(0x11)

$C$DW$T$693	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$693, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__gateObj")
	.dwattr $C$DW$T$693, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$693, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$693, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$693, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$693, DW_AT_decl_column(0x11)

$C$DW$T$694	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$694, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__gatePrms")
	.dwattr $C$DW$T$694, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$694, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$694, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$694, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$694, DW_AT_decl_column(0x11)

$C$DW$T$695	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$695, DW_AT_name("CT__ti_sysbios_knl_Swi_Module__loggerObj")
	.dwattr $C$DW$T$695, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$695, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$695, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$695, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$695, DW_AT_decl_column(0x11)

$C$DW$T$696	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$696, DW_AT_name("CT__ti_sysbios_knl_Swi_Object__table")
	.dwattr $C$DW$T$696, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$696, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$696, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$696, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$696, DW_AT_decl_column(0x11)

$C$DW$T$697	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$697, DW_AT_name("CT__ti_sysbios_knl_Task_Module__gateObj")
	.dwattr $C$DW$T$697, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$697, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$697, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$697, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$697, DW_AT_decl_column(0x11)

$C$DW$T$698	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$698, DW_AT_name("CT__ti_sysbios_knl_Task_Module__gatePrms")
	.dwattr $C$DW$T$698, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$698, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$698, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$698, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$698, DW_AT_decl_column(0x11)

$C$DW$T$699	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$699, DW_AT_name("CT__ti_sysbios_knl_Task_Module__loggerObj")
	.dwattr $C$DW$T$699, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$699, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$699, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$699, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$699, DW_AT_decl_column(0x11)

$C$DW$T$700	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$700, DW_AT_name("CT__ti_sysbios_knl_Task_Object__table")
	.dwattr $C$DW$T$700, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$700, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$700, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$700, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$700, DW_AT_decl_column(0x11)

$C$DW$T$701	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$701, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__gateObj")
	.dwattr $C$DW$T$701, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$701, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$701, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$701, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$701, DW_AT_decl_column(0x11)

$C$DW$T$702	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$702, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__gatePrms")
	.dwattr $C$DW$T$702, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$702, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$702, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$702, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$702, DW_AT_decl_column(0x11)

$C$DW$T$703	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$703, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Module__loggerObj")
	.dwattr $C$DW$T$703, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$703, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$703, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$703, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$703, DW_AT_decl_column(0x11)

$C$DW$T$704	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$704, DW_AT_name("CT__ti_sysbios_knl_Task_SupportProxy_Object__table")
	.dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$704, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$704, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/package/Task_SupportProxy.h")
	.dwattr $C$DW$T$704, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$704, DW_AT_decl_column(0x11)

$C$DW$T$705	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$705, DW_AT_name("CT__xdc_runtime_Assert_Module__gateObj")
	.dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$705, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$705, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$705, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$T$705, DW_AT_decl_column(0x11)

$C$DW$T$706	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$706, DW_AT_name("CT__xdc_runtime_Assert_Module__gatePrms")
	.dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$706, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$706, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$706, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$706, DW_AT_decl_column(0x11)

$C$DW$T$707	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$707, DW_AT_name("CT__xdc_runtime_Assert_Module__loggerObj")
	.dwattr $C$DW$T$707, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$707, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$707, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$707, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$707, DW_AT_decl_column(0x11)

$C$DW$T$708	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$708, DW_AT_name("CT__xdc_runtime_Assert_Object__table")
	.dwattr $C$DW$T$708, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$708, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$708, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Assert.h")
	.dwattr $C$DW$T$708, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$708, DW_AT_decl_column(0x11)

$C$DW$T$709	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$709, DW_AT_name("CT__xdc_runtime_Diags_Module__gateObj")
	.dwattr $C$DW$T$709, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$709, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$709, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$709, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$709, DW_AT_decl_column(0x11)

$C$DW$T$710	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$710, DW_AT_name("CT__xdc_runtime_Diags_Module__gatePrms")
	.dwattr $C$DW$T$710, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$710, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$710, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$710, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$710, DW_AT_decl_column(0x11)

$C$DW$T$711	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$711, DW_AT_name("CT__xdc_runtime_Diags_Module__loggerObj")
	.dwattr $C$DW$T$711, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$711, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$711, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$711, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$711, DW_AT_decl_column(0x11)

$C$DW$T$712	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$712, DW_AT_name("CT__xdc_runtime_Diags_Object__table")
	.dwattr $C$DW$T$712, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$712, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$712, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Diags.h")
	.dwattr $C$DW$T$712, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$712, DW_AT_decl_column(0x11)

$C$DW$T$713	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$713, DW_AT_name("CT__xdc_runtime_Error_Module__gateObj")
	.dwattr $C$DW$T$713, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$713, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$713, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$713, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$713, DW_AT_decl_column(0x11)

$C$DW$T$714	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$714, DW_AT_name("CT__xdc_runtime_Error_Module__gatePrms")
	.dwattr $C$DW$T$714, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$714, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$714, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$714, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$714, DW_AT_decl_column(0x11)

$C$DW$T$715	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$715, DW_AT_name("CT__xdc_runtime_Error_Module__loggerObj")
	.dwattr $C$DW$T$715, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$715, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$715, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$715, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$T$715, DW_AT_decl_column(0x11)

$C$DW$T$716	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$716, DW_AT_name("CT__xdc_runtime_Error_Object__table")
	.dwattr $C$DW$T$716, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$716, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$716, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Error.h")
	.dwattr $C$DW$T$716, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$716, DW_AT_decl_column(0x11)

$C$DW$T$717	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$717, DW_AT_name("CT__xdc_runtime_Log_Module__gateObj")
	.dwattr $C$DW$T$717, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$717, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$717, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$717, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$717, DW_AT_decl_column(0x11)

$C$DW$T$718	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$718, DW_AT_name("CT__xdc_runtime_Log_Module__gatePrms")
	.dwattr $C$DW$T$718, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$718, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$718, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$718, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$718, DW_AT_decl_column(0x11)

$C$DW$T$719	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$719, DW_AT_name("CT__xdc_runtime_Log_Module__loggerObj")
	.dwattr $C$DW$T$719, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$719, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$719, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$719, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$719, DW_AT_decl_column(0x11)

$C$DW$T$720	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$720, DW_AT_name("CT__xdc_runtime_Log_Object__table")
	.dwattr $C$DW$T$720, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$720, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$720, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Log.h")
	.dwattr $C$DW$T$720, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$720, DW_AT_decl_column(0x11)

$C$DW$T$721	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$721, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__gateObj")
	.dwattr $C$DW$T$721, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$721, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$721, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$721, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$721, DW_AT_decl_column(0x11)

$C$DW$T$722	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$722, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__gatePrms")
	.dwattr $C$DW$T$722, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$722, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$722, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$722, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$722, DW_AT_decl_column(0x11)

$C$DW$T$723	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$723, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Module__loggerObj")
	.dwattr $C$DW$T$723, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$723, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$723, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$723, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$723, DW_AT_decl_column(0x11)

$C$DW$T$724	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$724, DW_AT_name("CT__xdc_runtime_Main_Module_GateProxy_Object__table")
	.dwattr $C$DW$T$724, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$724, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$724, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Main_Module_GateProxy.h")
	.dwattr $C$DW$T$724, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$T$724, DW_AT_decl_column(0x11)

$C$DW$T$725	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$725, DW_AT_name("CT__xdc_runtime_Main_Module__gateObj")
	.dwattr $C$DW$T$725, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$725, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$725, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Main.h")
	.dwattr $C$DW$T$725, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$725, DW_AT_decl_column(0x11)

$C$DW$T$726	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$726, DW_AT_name("CT__xdc_runtime_Main_Module__gatePrms")
	.dwattr $C$DW$T$726, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$726, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$726, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Main.h")
	.dwattr $C$DW$T$726, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$726, DW_AT_decl_column(0x11)

$C$DW$T$727	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$727, DW_AT_name("CT__xdc_runtime_Main_Module__loggerObj")
	.dwattr $C$DW$T$727, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$727, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$727, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Main.h")
	.dwattr $C$DW$T$727, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$727, DW_AT_decl_column(0x11)

$C$DW$T$728	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$728, DW_AT_name("CT__xdc_runtime_Main_Object__table")
	.dwattr $C$DW$T$728, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$728, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$728, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Main.h")
	.dwattr $C$DW$T$728, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$728, DW_AT_decl_column(0x11)

$C$DW$T$729	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$729, DW_AT_name("CT__xdc_runtime_Memory_HeapProxy_Module__gateObj")
	.dwattr $C$DW$T$729, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$729, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$729, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Memory_HeapProxy.h")
	.dwattr $C$DW$T$729, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$729, DW_AT_decl_column(0x11)

$C$DW$T$730	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$730, DW_AT_name("CT__xdc_runtime_Memory_HeapProxy_Module__gatePrms")
	.dwattr $C$DW$T$730, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$730, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$730, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Memory_HeapProxy.h")
	.dwattr $C$DW$T$730, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$T$730, DW_AT_decl_column(0x11)

$C$DW$T$731	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$731, DW_AT_name("CT__xdc_runtime_Memory_HeapProxy_Module__loggerObj")
	.dwattr $C$DW$T$731, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$731, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$731, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Memory_HeapProxy.h")
	.dwattr $C$DW$T$731, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$731, DW_AT_decl_column(0x11)

$C$DW$T$732	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$732, DW_AT_name("CT__xdc_runtime_Memory_HeapProxy_Object__table")
	.dwattr $C$DW$T$732, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$732, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$732, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/package/Memory_HeapProxy.h")
	.dwattr $C$DW$T$732, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$732, DW_AT_decl_column(0x11)

$C$DW$T$733	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$733, DW_AT_name("CT__xdc_runtime_Memory_Module__gateObj")
	.dwattr $C$DW$T$733, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$733, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$733, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Memory.h")
	.dwattr $C$DW$T$733, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$733, DW_AT_decl_column(0x11)

$C$DW$T$734	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$734, DW_AT_name("CT__xdc_runtime_Memory_Module__gatePrms")
	.dwattr $C$DW$T$734, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$734, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$734, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Memory.h")
	.dwattr $C$DW$T$734, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$734, DW_AT_decl_column(0x11)

$C$DW$T$735	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$735, DW_AT_name("CT__xdc_runtime_Memory_Module__loggerObj")
	.dwattr $C$DW$T$735, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$735, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$735, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Memory.h")
	.dwattr $C$DW$T$735, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$735, DW_AT_decl_column(0x11)

$C$DW$T$736	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$736, DW_AT_name("CT__xdc_runtime_Memory_Object__table")
	.dwattr $C$DW$T$736, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$736, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$736, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Memory.h")
	.dwattr $C$DW$T$736, DW_AT_decl_line(0xea)
	.dwattr $C$DW$T$736, DW_AT_decl_column(0x11)

$C$DW$T$737	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$737, DW_AT_name("CT__xdc_runtime_Text_Module__gateObj")
	.dwattr $C$DW$T$737, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$737, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$737, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Text.h")
	.dwattr $C$DW$T$737, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$T$737, DW_AT_decl_column(0x11)

$C$DW$T$738	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$738, DW_AT_name("CT__xdc_runtime_Text_Module__gatePrms")
	.dwattr $C$DW$T$738, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$738, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$738, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Text.h")
	.dwattr $C$DW$T$738, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$738, DW_AT_decl_column(0x11)

$C$DW$T$739	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$739, DW_AT_name("CT__xdc_runtime_Text_Module__loggerObj")
	.dwattr $C$DW$T$739, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$739, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$739, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Text.h")
	.dwattr $C$DW$T$739, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$739, DW_AT_decl_column(0x11)

$C$DW$T$740	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$740, DW_AT_name("CT__xdc_runtime_Text_Object__table")
	.dwattr $C$DW$T$740, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$740, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$740, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Text.h")
	.dwattr $C$DW$T$740, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$740, DW_AT_decl_column(0x11)

$C$DW$T$741	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$741, DW_AT_name("CT__xdc_runtime_Types_Module__gateObj")
	.dwattr $C$DW$T$741, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$741, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$741, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/runtime/Types.h")
	.dwattr $C$DW$T$741, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$741, DW_AT_decl_column(0x11)

$C$DW$T$742	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$742, DW_AT_name("CT__xdc_runtime_Types_Module__gatePrms")
	.dwattr $C$DW$T$742, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$742, DW_AT_language(DW_LANG_C)
