TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 20 04:41:41 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

     382                    
     383                    $C$DW$T$32      .dwtag  DW_TAG_typedef
     384                            .dwattr $C$DW$T$32, DW_AT_name("Scale")
     385                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE    8

     386                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     387                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
     388                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3b)
     389                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
     390                    
     391                    
     392                    $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
     393                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
     394                    $C$DW$38        .dwtag  DW_TAG_enumerator
     395                            .dwattr $C$DW$38, DW_AT_name("ChordMajor")
     396                            .dwattr $C$DW$38, DW_AT_const_value(0x00)
     397                            .dwattr $C$DW$38, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     398                            .dwattr $C$DW$38, DW_AT_decl_line(0x40)
     399                            .dwattr $C$DW$38, DW_AT_decl_column(0x05)
     400                    
     401                    $C$DW$39        .dwtag  DW_TAG_enumerator
     402                            .dwattr $C$DW$39, DW_AT_name("ChordMinor")
     403                            .dwattr $C$DW$39, DW_AT_const_value(0x01)
     404                            .dwattr $C$DW$39, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     405                            .dwattr $C$DW$39, DW_AT_decl_line(0x41)
     406                            .dwattr $C$DW$39, DW_AT_decl_column(0x05)
     407                    
     408                    $C$DW$40        .dwtag  DW_TAG_enumerator
     409                            .dwattr $C$DW$40, DW_AT_name("Dominant7")
     410                            .dwattr $C$DW$40, DW_AT_const_value(0x02)
     411                            .dwattr $C$DW$40, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     412                            .dwattr $C$DW$40, DW_AT_decl_line(0x42)
     413                            .dwattr $C$DW$40, DW_AT_decl_column(0x05)
     414                    
     415                    $C$DW$41        .dwtag  DW_TAG_enumerator
     416                            .dwattr $C$DW$41, DW_AT_name("Minor7")
     417                            .dwattr $C$DW$41, DW_AT_const_value(0x03)
     418                            .dwattr $C$DW$41, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     419                            .dwattr $C$DW$41, DW_AT_decl_line(0x43)
     420                            .dwattr $C$DW$41, DW_AT_decl_column(0x05)
     421                    
     422                    $C$DW$42        .dwtag  DW_TAG_enumerator
     423                            .dwattr $C$DW$42, DW_AT_name("Sus4")
     424                            .dwattr $C$DW$42, DW_AT_const_value(0x04)
     425                            .dwattr $C$DW$42, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     426                            .dwattr $C$DW$42, DW_AT_decl_line(0x44)
     427                            .dwattr $C$DW$42, DW_AT_decl_column(0x05)
     428                    
     429                    $C$DW$43        .dwtag  DW_TAG_enumerator
     430                            .dwattr $C$DW$43, DW_AT_name("Sus2")
     431                            .dwattr $C$DW$43, DW_AT_const_value(0x05)
     432                            .dwattr $C$DW$43, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     433                            .dwattr $C$DW$43, DW_AT_decl_line(0x45)
     434                            .dwattr $C$DW$43, DW_AT_decl_column(0x05)
     435                    
     436                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
     437                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f)
     438                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
     439                            .dwendtag $C$DW$T$33
     440                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE    9

     441                    $C$DW$T$34      .dwtag  DW_TAG_typedef
     442                            .dwattr $C$DW$T$34, DW_AT_name("Chord")
     443                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     444                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     445                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
     446                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x46)
     447                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
     448                    
     449                    
     450                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
     451                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x6c)
     452                    $C$DW$44        .dwtag  DW_TAG_member
     453                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$21)
     454                            .dwattr $C$DW$44, DW_AT_name("isActive")
     455                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("isActive")
     456                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     457                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     458                            .dwattr $C$DW$44, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     459                            .dwattr $C$DW$44, DW_AT_decl_line(0x32)
     460                            .dwattr $C$DW$44, DW_AT_decl_column(0x0a)
     461                    
     462                    $C$DW$45        .dwtag  DW_TAG_member
     463                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     464                            .dwattr $C$DW$45, DW_AT_name("tune")
     465                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("tune")
     466                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     467                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     468                            .dwattr $C$DW$45, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     469                            .dwattr $C$DW$45, DW_AT_decl_line(0x33)
     470                            .dwattr $C$DW$45, DW_AT_decl_column(0x0e)
     471                    
     472                    $C$DW$46        .dwtag  DW_TAG_member
     473                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     474                            .dwattr $C$DW$46, DW_AT_name("Scale")
     475                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("Scale")
     476                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     477                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     478                            .dwattr $C$DW$46, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     479                            .dwattr $C$DW$46, DW_AT_decl_line(0x34)
     480                            .dwattr $C$DW$46, DW_AT_decl_column(0x0a)
     481                    
     482                    $C$DW$47        .dwtag  DW_TAG_member
     483                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
     484                            .dwattr $C$DW$47, DW_AT_name("Chord")
     485                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("Chord")
     486                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     487                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     488                            .dwattr $C$DW$47, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     489                            .dwattr $C$DW$47, DW_AT_decl_line(0x35)
     490                            .dwattr $C$DW$47, DW_AT_decl_column(0x0a)
     491                    
     492                    $C$DW$48        .dwtag  DW_TAG_member
     493                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$28)
     494                            .dwattr $C$DW$48, DW_AT_name("Volume")
     495                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("Volume")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE   10

     496                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     497                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     498                            .dwattr $C$DW$48, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     499                            .dwattr $C$DW$48, DW_AT_decl_line(0x36)
     500                            .dwattr $C$DW$48, DW_AT_decl_column(0x0b)
     501                    
     502                    $C$DW$49        .dwtag  DW_TAG_member
     503                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     504                            .dwattr $C$DW$49, DW_AT_name("isChordMode")
     505                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("isChordMode")
     506                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     507                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     508                            .dwattr $C$DW$49, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     509                            .dwattr $C$DW$49, DW_AT_decl_line(0x37)
     510                            .dwattr $C$DW$49, DW_AT_decl_column(0x0a)
     511                    
     512                    $C$DW$50        .dwtag  DW_TAG_member
     513                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$30)
     514                            .dwattr $C$DW$50, DW_AT_name("ChordTonic")
     515                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("ChordTonic")
     516                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     517                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     518                            .dwattr $C$DW$50, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     519                            .dwattr $C$DW$50, DW_AT_decl_line(0x38)
     520                            .dwattr $C$DW$50, DW_AT_decl_column(0x0f)
     521                    
     522                    $C$DW$51        .dwtag  DW_TAG_member
     523                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$30)
     524                            .dwattr $C$DW$51, DW_AT_name("ScaleTonic")
     525                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ScaleTonic")
     526                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     527                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     528                            .dwattr $C$DW$51, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     529                            .dwattr $C$DW$51, DW_AT_decl_line(0x39)
     530                            .dwattr $C$DW$51, DW_AT_decl_column(0x0f)
     531                    
     532                    $C$DW$52        .dwtag  DW_TAG_member
     533                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$32)
     534                            .dwattr $C$DW$52, DW_AT_name("ScaleType")
     535                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ScaleType")
     536                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     537                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     538                            .dwattr $C$DW$52, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     539                            .dwattr $C$DW$52, DW_AT_decl_line(0x3a)
     540                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     541                    
     542                    $C$DW$53        .dwtag  DW_TAG_member
     543                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$34)
     544                            .dwattr $C$DW$53, DW_AT_name("ChordType")
     545                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("ChordType")
     546                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     547                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     548                            .dwattr $C$DW$53, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Vocal
     549                            .dwattr $C$DW$53, DW_AT_decl_line(0x3b)
     550                            .dwattr $C$DW$53, DW_AT_decl_column(0x0b)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE   11

     551                    
     552                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
     553                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x31)
     554                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
     555                            .dwendtag $C$DW$T$35
     556                    
     557                    $C$DW$T$39      .dwtag  DW_TAG_typedef
     558                            .dwattr $C$DW$T$39, DW_AT_name("MicCheckPreset")
     559                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
     560                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     561                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/Voc
     562                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x3c)
     563                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
     564                    
     565                    
     566                    $C$DW$T$40      .dwtag  DW_TAG_array_type
     567                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
     568                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     569                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x1b0)
     570                    $C$DW$54        .dwtag  DW_TAG_subrange_type
     571                            .dwattr $C$DW$54, DW_AT_upper_bound(0x03)
     572                    
     573                            .dwendtag $C$DW$T$40
     574                    
     575                    
     576                    $C$DW$T$38      .dwtag  DW_TAG_union_type
     577                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
     578                    $C$DW$55        .dwtag  DW_TAG_member
     579                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     580                            .dwattr $C$DW$55, DW_AT_name("f")
     581                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("f")
     582                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     584                            .dwattr $C$DW$55, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     585                            .dwattr $C$DW$55, DW_AT_decl_line(0xb6)
     586                            .dwattr $C$DW$55, DW_AT_decl_column(0x0f)
     587                    
     588                    $C$DW$56        .dwtag  DW_TAG_member
     589                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$37)
     590                            .dwattr $C$DW$56, DW_AT_name("a")
     591                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("a")
     592                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     594                            .dwattr $C$DW$56, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     595                            .dwattr $C$DW$56, DW_AT_decl_line(0xb7)
     596                            .dwattr $C$DW$56, DW_AT_decl_column(0x0f)
     597                    
     598                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     599                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xb5)
     600                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0f)
     601                            .dwendtag $C$DW$T$38
     602                    
     603                    $C$DW$T$41      .dwtag  DW_TAG_typedef
     604                            .dwattr $C$DW$T$41, DW_AT_name("xdc_FloatData")
     605                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$38)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:41 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
MicCheckPreset.asm                                                   PAGE   12

     606                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     607                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     608                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xb8)
     609                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
     610                    
     611                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     612                            .dwattr $C$DW$T$2, DW_AT_name("void")
     613                    
     614                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     615                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     616                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     617                    
     618                    $C$DW$T$42      .dwtag  DW_TAG_typedef
     619                            .dwattr $C$DW$T$42, DW_AT_name("xdc_Ptr")
     620                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$3)
     621                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     622                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     623                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2e)
     624                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x1a)
     625                    
     626                    $C$DW$T$43      .dwtag  DW_TAG_typedef
     627                            .dwattr $C$DW$T$43, DW_AT_name("Ptr")
     628                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     629                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     630                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/xdctools_3_50_01_12_core/packages/xdc/std.h")
     631                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xf6)
     632                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x19)
     633                    
     634                    $C$DW$T$44      .dwtag  DW_TAG_const_type
     635                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$2)
     636                    
     637                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
     638                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
     639                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
     640                    
     641                    $C$DW$T$46      .dwtag  DW_TAG_typedef
     642                            .dwattr $C$DW$T$46, DW_AT_name("xdc_CPtr")
     643                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
