TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 20 04:41:34 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    6163                    ;******************************************************************************
    6164                    EDMA3ChannelToParamMap:
    6165                    ;** --------------------------------------------------------------------------*
    6166                    $C$DW$297       .dwtag  DW_TAG_variable
    6167                            .dwattr $C$DW$297, DW_AT_name("paramSet")
    6168                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("paramSet")
    6169                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$62)
    6170                            .dwattr $C$DW$297, DW_AT_location[DW_OP_reg6]
    6171                    
    6172                    $C$DW$298       .dwtag  DW_TAG_variable
    6173                            .dwattr $C$DW$298, DW_AT_name("channel")
    6174                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("channel")
    6175                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$62)
    6176                            .dwattr $C$DW$298, DW_AT_location[DW_OP_reg3]
    6177                    
    6178                    $C$DW$299       .dwtag  DW_TAG_variable
    6179                            .dwattr $C$DW$299, DW_AT_name("baseAdd")
    6180                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("baseAdd")
    6181                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$62)
    6182                            .dwattr $C$DW$299, DW_AT_location[DW_OP_reg4]
    6183                    
    6184                            .dwcfi  cfa_offset, 0
    6185                            .dwpsn  file "C:/ti/OMAPL138_StarterWare_1_10_04_01/drivers/edma.c",line 265,column 1,is_stmt,
    6186                    $C$DW$300       .dwtag  DW_TAG_TI_branch
    6187                            .dwattr $C$DW$300, DW_AT_low_pc(0x00)
    6188                            .dwattr $C$DW$300, DW_AT_TI_return
    6189                    
    6190 00001204 008c4362             RETNOP          B3,2              ; [] |265| 
    6191                            .dwpsn  file "C:/ti/OMAPL138_StarterWare_1_10_04_01/drivers/edma.c",line 263,column 1,is_stmt,
    6192                    
    6193 00001208 01901fd9             MV      .L1X    B4,A3             ; [A_L674] |263| 
    6194 0000120c 02802028  ||         MVK     .S1     64,A5             ; [A_S674] |264| 
    6195                    
    6196                            .dwpsn  file "C:/ti/OMAPL138_StarterWare_1_10_04_01/drivers/edma.c",line 264,column 5,is_stmt,
    6197                    
    6198 00001210 02107c41             ADDAW   .D1     A4,A3,A4          ; [A_D64P] |264| 
    6199 00001214 0198aca0  ||         SHL     .S1     A6,5,A3           ; [A_S674] |264| 
    6200                    
    6201 00001218 0190aa74             STW     .D1T1   A3,*+A4[A5]       ; [A_D64P] |264| 
    6202                            .dwpsn  file "C:/ti/OMAPL138_StarterWare_1_10_04_01/drivers/edma.c",line 265,column 1,is_stmt,
    6203                               ; BRANCH OCCURS {B3}              ; [] |265| 
    6204                            .dwattr $C$DW$293, DW_AT_TI_end_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/drivers/edma.c")
    6205                            .dwattr $C$DW$293, DW_AT_TI_end_line(0x109)
    6206                            .dwattr $C$DW$293, DW_AT_TI_end_column(0x01)
    6207                            .dwendentry
    6208                            .dwendtag $C$DW$293
    6209                    
    6210                    
    6211                    ;******************************************************************************
    6212                    ;* BUILD ATTRIBUTES                                                           *
    6213                    ;******************************************************************************
    6214                            .battr "TI", Tag_File, 1, Tag_Long_Precision_Bits(2)
    6215                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  114

    6216                            .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    6217                            .battr "c6xabi", Tag_File, 1, Tag_ABI_wchar_t(1)
    6218                            .battr "c6xabi", Tag_File, 1, Tag_ABI_array_object_alignment(0)
    6219                            .battr "c6xabi", Tag_File, 1, Tag_ABI_array_object_align_expected(0)
    6220                            .battr "c6xabi", Tag_File, 1, Tag_ABI_PIC(0)
    6221                            .battr "c6xabi", Tag_File, 1, Tag_ABI_PID(0)
    6222                            .battr "c6xabi", Tag_File, 1, Tag_ABI_DSBT(0)
    6223                            .battr "c6xabi", Tag_File, 1, Tag_ABI_stack_align_needed(0)
    6224                            .battr "c6xabi", Tag_File, 1, Tag_ABI_stack_align_preserved(0)
    6225                            .battr "TI", Tag_File, 1, Tag_Tramps_Use_SOC(1)
    6226                    
    6227                    ;******************************************************************************
    6228                    ;* TYPE INFORMATION                                                           *
    6229                    ;******************************************************************************
    6230                    
    6231                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6232                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    6233                    $C$DW$301       .dwtag  DW_TAG_member
    6234                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$10)
    6235                            .dwattr $C$DW$301, DW_AT_name("fd")
    6236                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("fd")
    6237                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6238                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6239                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6240                            .dwattr $C$DW$301, DW_AT_decl_line(0x49)
    6241                            .dwattr $C$DW$301, DW_AT_decl_column(0x0b)
    6242                    
    6243                    $C$DW$302       .dwtag  DW_TAG_member
    6244                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    6245                            .dwattr $C$DW$302, DW_AT_name("buf")
    6246                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("buf")
    6247                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6248                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6249                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6250                            .dwattr $C$DW$302, DW_AT_decl_line(0x4a)
    6251                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    6252                    
    6253                    $C$DW$303       .dwtag  DW_TAG_member
    6254                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    6255                            .dwattr $C$DW$303, DW_AT_name("pos")
    6256                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("pos")
    6257                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6258                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6259                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6260                            .dwattr $C$DW$303, DW_AT_decl_line(0x4b)
    6261                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    6262                    
    6263                    $C$DW$304       .dwtag  DW_TAG_member
    6264                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    6265                            .dwattr $C$DW$304, DW_AT_name("bufend")
    6266                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("bufend")
    6267                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6268                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6269                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6270                            .dwattr $C$DW$304, DW_AT_decl_line(0x4c)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  115

    6271                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    6272                    
    6273                    $C$DW$305       .dwtag  DW_TAG_member
    6274                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    6275                            .dwattr $C$DW$305, DW_AT_name("buff_stop")
    6276                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("buff_stop")
    6277                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6278                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6279                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6280                            .dwattr $C$DW$305, DW_AT_decl_line(0x4d)
    6281                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    6282                    
    6283                    $C$DW$306       .dwtag  DW_TAG_member
    6284                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$11)
    6285                            .dwattr $C$DW$306, DW_AT_name("flags")
    6286                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("flags")
    6287                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6288                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6289                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdi
    6290                            .dwattr $C$DW$306, DW_AT_decl_line(0x4e)
    6291                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    6292                    
    6293                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6294                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x48)
    6295                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    6296                            .dwendtag $C$DW$T$20
    6297                    
    6298                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    6299                            .dwattr $C$DW$T$29, DW_AT_name("FILE")
    6300                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$20)
    6301                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6302                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6303                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x4f)
    6304                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    6305                    
    6306                    
    6307                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    6308                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    6309                    $C$DW$307       .dwtag  DW_TAG_member
    6310                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$10)
    6311                            .dwattr $C$DW$307, DW_AT_name("quot")
    6312                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("quot")
    6313                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6314                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6315                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    6316                            .dwattr $C$DW$307, DW_AT_decl_line(0x49)
    6317                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    6318                    
    6319                    $C$DW$308       .dwtag  DW_TAG_member
    6320                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$10)
    6321                            .dwattr $C$DW$308, DW_AT_name("rem")
    6322                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("rem")
    6323                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6324                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6325                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  116

    6326                            .dwattr $C$DW$308, DW_AT_decl_line(0x49)
    6327                            .dwattr $C$DW$308, DW_AT_decl_column(0x1c)
    6328                    
    6329                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6330                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49)
    6331                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    6332                            .dwendtag $C$DW$T$21
    6333                    
    6334                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    6335                            .dwattr $C$DW$T$30, DW_AT_name("div_t")
    6336                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
    6337                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    6338                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6339                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x49)
    6340                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x23)
    6341                    
    6342                    
    6343                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6344                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    6345                    $C$DW$309       .dwtag  DW_TAG_member
    6346                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$10)
    6347                            .dwattr $C$DW$309, DW_AT_name("quot")
    6348                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("quot")
    6349                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6350                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6351                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    6352                            .dwattr $C$DW$309, DW_AT_decl_line(0x4b)
    6353                            .dwattr $C$DW$309, DW_AT_decl_column(0x17)
    6354                    
    6355                    $C$DW$310       .dwtag  DW_TAG_member
    6356                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$10)
    6357                            .dwattr $C$DW$310, DW_AT_name("rem")
    6358                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("rem")
    6359                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6360                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    6361                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    6362                            .dwattr $C$DW$310, DW_AT_decl_line(0x4b)
    6363                            .dwattr $C$DW$310, DW_AT_decl_column(0x1d)
    6364                    
    6365                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6366                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x4b)
    6367                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    6368                            .dwendtag $C$DW$T$22
    6369                    
    6370                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    6371                            .dwattr $C$DW$T$31, DW_AT_name("ldiv_t")
    6372                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$22)
    6373                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    6374                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6375                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x4b)
    6376                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x24)
    6377                    
    6378                    
    6379                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6380                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  117

    6381                    $C$DW$311       .dwtag  DW_TAG_member
    6382                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$14)
    6383                            .dwattr $C$DW$311, DW_AT_name("quot")
    6384                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("quot")
    6385                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6386                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6387                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    6388                            .dwattr $C$DW$311, DW_AT_decl_line(0x4e)
    6389                            .dwattr $C$DW$311, DW_AT_decl_column(0x1c)
    6390                    
    6391                    $C$DW$312       .dwtag  DW_TAG_member
    6392                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$14)
    6393                            .dwattr $C$DW$312, DW_AT_name("rem")
    6394                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("rem")
    6395                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6396                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6397                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/stdl
    6398                            .dwattr $C$DW$312, DW_AT_decl_line(0x4e)
    6399                            .dwattr $C$DW$312, DW_AT_decl_column(0x22)
    6400                    
    6401                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6402                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4e)
    6403                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    6404                            .dwendtag $C$DW$T$23
    6405                    
    6406                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    6407                            .dwattr $C$DW$T$32, DW_AT_name("lldiv_t")
    6408                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    6409                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    6410                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6411                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4e)
    6412                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x29)
    6413                    
    6414                    
    6415                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6416                            .dwattr $C$DW$T$24, DW_AT_name("EDMA3CCPaRAMEntry")
    6417                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
    6418                    $C$DW$313       .dwtag  DW_TAG_member
    6419                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$11)
    6420                            .dwattr $C$DW$313, DW_AT_name("opt")
    6421                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("opt")
    6422                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6423                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6424                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6425                            .dwattr $C$DW$313, DW_AT_decl_line(0xe6)
    6426                            .dwattr $C$DW$313, DW_AT_decl_column(0x16)
    6427                    
    6428                    $C$DW$314       .dwtag  DW_TAG_member
    6429                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$11)
    6430                            .dwattr $C$DW$314, DW_AT_name("srcAddr")
    6431                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("srcAddr")
    6432                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6433                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6434                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6435                            .dwattr $C$DW$314, DW_AT_decl_line(0xec)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  118

    6436                            .dwattr $C$DW$314, DW_AT_decl_column(0x16)
    6437                    
    6438                    $C$DW$315       .dwtag  DW_TAG_member
    6439                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$9)
    6440                            .dwattr $C$DW$315, DW_AT_name("aCnt")
    6441                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("aCnt")
    6442                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6443                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6444                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6445                            .dwattr $C$DW$315, DW_AT_decl_line(0xf1)
    6446                            .dwattr $C$DW$315, DW_AT_decl_column(0x18)
    6447                    
    6448                    $C$DW$316       .dwtag  DW_TAG_member
    6449                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$9)
    6450                            .dwattr $C$DW$316, DW_AT_name("bCnt")
    6451                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("bCnt")
    6452                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6453                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6454                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6455                            .dwattr $C$DW$316, DW_AT_decl_line(0xf6)
    6456                            .dwattr $C$DW$316, DW_AT_decl_column(0x18)
    6457                    
    6458                    $C$DW$317       .dwtag  DW_TAG_member
    6459                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$11)
    6460                            .dwattr $C$DW$317, DW_AT_name("destAddr")
    6461                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("destAddr")
    6462                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6463                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6464                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6465                            .dwattr $C$DW$317, DW_AT_decl_line(0xfd)
    6466                            .dwattr $C$DW$317, DW_AT_decl_column(0x16)
    6467                    
    6468                    $C$DW$318       .dwtag  DW_TAG_member
    6469                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$8)
    6470                            .dwattr $C$DW$318, DW_AT_name("srcBIdx")
    6471                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("srcBIdx")
    6472                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6473                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6474                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6475                            .dwattr $C$DW$318, DW_AT_decl_line(0x102)
    6476                            .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    6477                    
    6478                    $C$DW$319       .dwtag  DW_TAG_member
    6479                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$8)
    6480                            .dwattr $C$DW$319, DW_AT_name("destBIdx")
    6481                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("destBIdx")
    6482                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6483                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6484                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6485                            .dwattr $C$DW$319, DW_AT_decl_line(0x107)
    6486                            .dwattr $C$DW$319, DW_AT_decl_column(0x10)
    6487                    
    6488                    $C$DW$320       .dwtag  DW_TAG_member
    6489                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$9)
    6490                            .dwattr $C$DW$320, DW_AT_name("linkAddr")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  119

    6491                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("linkAddr")
    6492                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6493                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6494                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6495                            .dwattr $C$DW$320, DW_AT_decl_line(0x10e)
    6496                            .dwattr $C$DW$320, DW_AT_decl_column(0x18)
    6497                    
    6498                    $C$DW$321       .dwtag  DW_TAG_member
    6499                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$9)
    6500                            .dwattr $C$DW$321, DW_AT_name("bCntReload")
    6501                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("bCntReload")
    6502                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6503                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6504                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6505                            .dwattr $C$DW$321, DW_AT_decl_line(0x114)
    6506                            .dwattr $C$DW$321, DW_AT_decl_column(0x18)
    6507                    
    6508                    $C$DW$322       .dwtag  DW_TAG_member
    6509                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$8)
    6510                            .dwattr $C$DW$322, DW_AT_name("srcCIdx")
    6511                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("srcCIdx")
    6512                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6513                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6514                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6515                            .dwattr $C$DW$322, DW_AT_decl_line(0x119)
    6516                            .dwattr $C$DW$322, DW_AT_decl_column(0x10)
    6517                    
    6518                    $C$DW$323       .dwtag  DW_TAG_member
    6519                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$8)
    6520                            .dwattr $C$DW$323, DW_AT_name("destCIdx")
    6521                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("destCIdx")
    6522                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6523                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6524                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6525                            .dwattr $C$DW$323, DW_AT_decl_line(0x11e)
    6526                            .dwattr $C$DW$323, DW_AT_decl_column(0x10)
    6527                    
    6528                    $C$DW$324       .dwtag  DW_TAG_member
    6529                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$9)
    6530                            .dwattr $C$DW$324, DW_AT_name("cCnt")
    6531                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("cCnt")
    6532                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6533                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6534                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6535                            .dwattr $C$DW$324, DW_AT_decl_line(0x123)
    6536                            .dwattr $C$DW$324, DW_AT_decl_column(0x18)
    6537                    
    6538                    $C$DW$325       .dwtag  DW_TAG_member
    6539                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$9)
    6540                            .dwattr $C$DW$325, DW_AT_name("rsvd")
    6541                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("rsvd")
    6542                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6543                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6544                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6545                            .dwattr $C$DW$325, DW_AT_decl_line(0x128)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  120

    6546                            .dwattr $C$DW$325, DW_AT_decl_column(0x18)
    6547                    
    6548                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6549                            .dwattr $C$DW$T$24, DW_AT_decl_line(0xe4)
    6550                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    6551                            .dwendtag $C$DW$T$24
    6552                    
    6553                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    6554                            .dwattr $C$DW$T$33, DW_AT_name("EDMA3CCPaRAMEntry")
    6555                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    6556                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    6557                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6558                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x12a)
    6559                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x02)
    6560                    
    6561                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    6562                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    6563                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    6564                    
    6565                    
    6566                    $C$DW$T$27      .dwtag  DW_TAG_array_type
    6567                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    6568                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    6569                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4000)
    6570                    $C$DW$326       .dwtag  DW_TAG_subrange_type
    6571                            .dwattr $C$DW$326, DW_AT_upper_bound(0x1ff)
    6572                    
    6573                            .dwendtag $C$DW$T$27
    6574                    
    6575                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6576                            .dwattr $C$DW$T$2, DW_AT_name("void")
    6577                    
    6578                    
    6579                    $C$DW$T$50      .dwtag  DW_TAG_subroutine_type
    6580                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6581                            .dwendtag $C$DW$T$50
    6582                    
    6583                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    6584                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    6585                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    6586                    
    6587                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    6588                            .dwattr $C$DW$T$52, DW_AT_name("__TI_atexit_fn")
    6589                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    6590                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6591                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6592                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xa1)
    6593                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x14)
    6594                    
    6595                    $C$DW$T$53      .dwtag  DW_TAG_const_type
    6596                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$2)
    6597                    
    6598                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    6599                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    6600                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  121

    6601                    
    6602                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    6603                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6604                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    6605                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6606                    
    6607                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    6608                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6609                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6610                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6611                    
    6612                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    6613                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6614                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6615                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6616                    
    6617                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    6618                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    6619                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    6620                    
    6621                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    6622                            .dwattr $C$DW$T$55, DW_AT_name("tBoolean")
    6623                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$6)
    6624                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6625                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_types
    6626                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x32)
    6627                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x17)
    6628                    
    6629                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    6630                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6631                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6632                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    6633                    
    6634                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    6635                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6636                            .dwattr $C$DW$T$8, DW_AT_name("short")
    6637                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    6638                    
    6639                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    6640                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6641                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6642                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    6643                    
    6644                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    6645                            .dwattr $C$DW$T$56, DW_AT_name("wchar_t")
    6646                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$9)
    6647                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6648                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6649                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x60)
    6650                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x1a)
    6651                    
    6652                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    6653                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6654                            .dwattr $C$DW$T$10, DW_AT_name("int")
    6655                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  122

    6656                    
    6657                    
    6658                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    6659                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$10)
    6660                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6661                    $C$DW$327       .dwtag  DW_TAG_formal_parameter
    6662                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$54)
    6663                    
    6664                    $C$DW$328       .dwtag  DW_TAG_formal_parameter
    6665                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$54)
    6666                    
    6667                            .dwendtag $C$DW$T$57
    6668                    
    6669                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    6670                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    6671                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    6672                    
    6673                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    6674                            .dwattr $C$DW$T$59, DW_AT_name("__TI_compar_fn")
    6675                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    6676                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6677                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6678                            .dwattr $C$DW$T$59, DW_AT_decl_line(0xa4)
    6679                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x13)
    6680                    
    6681                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    6682                            .dwattr $C$DW$T$60, DW_AT_name("fpos_t")
    6683                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$10)
    6684                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6685                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6686                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x53)
    6687                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x0d)
    6688                    
    6689                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    6690                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6691                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6692                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    6693                    
    6694                    
    6695                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    6696                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
    6697                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    6698                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x100)
    6699                    $C$DW$329       .dwtag  DW_TAG_subrange_type
    6700                            .dwattr $C$DW$329, DW_AT_upper_bound(0x3f)
    6701                    
    6702                            .dwendtag $C$DW$T$25
    6703                    
    6704                    
    6705                    $C$DW$T$26      .dwtag  DW_TAG_array_type
    6706                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
    6707                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    6708                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    6709                    $C$DW$330       .dwtag  DW_TAG_subrange_type
    6710                            .dwattr $C$DW$330, DW_AT_upper_bound(0x07)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  123

    6711                    
    6712                            .dwendtag $C$DW$T$26
    6713                    
    6714                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6715                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$11)
    6716                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    6717                    
    6718                    $C$DW$T$61      .dwtag  DW_TAG_const_type
    6719                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$43)
    6720                    
    6721                    $C$DW$T$62      .dwtag  DW_TAG_const_type
    6722                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$11)
    6723                    
    6724                    $C$DW$T$69      .dwtag  DW_TAG_volatile_type
    6725                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$11)
    6726                    
    6727                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    6728                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    6729                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    6730                    
    6731                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    6732                            .dwattr $C$DW$T$71, DW_AT_name("size_t")
    6733                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$11)
    6734                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6735                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6736                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x45)
    6737                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x19)
    6738                    
    6739                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    6740                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6741                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    6742                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    6743                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    6744                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    6745                    
    6746                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    6747                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6748                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    6749                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
    6750                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    6751                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
    6752                    
    6753                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    6754                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6755                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    6756                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    6757                    
    6758                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    6759                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6760                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6761                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    6762                    
    6763                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    6764                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6765                            .dwattr $C$DW$T$16, DW_AT_name("float")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  124

    6766                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    6767                    
    6768                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    6769                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6770                            .dwattr $C$DW$T$17, DW_AT_name("double")
    6771                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    6772                    
    6773                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    6774                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6775                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    6776                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    6777                    
    6778                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    6779                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$5)
    6780                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    6781                    
    6782                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    6783                            .dwattr $C$DW$T$74, DW_AT_name("va_list")
    6784                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    6785                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    6786                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-c6000_8.1.3/include/std
    6787                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x37)
    6788                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x13)
    6789                    
    6790                    
    6791                    $C$DW$T$89      .dwtag  DW_TAG_array_type
    6792                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$5)
    6793                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x02)
    6794                    $C$DW$331       .dwtag  DW_TAG_subrange_type
    6795                            .dwattr $C$DW$331, DW_AT_upper_bound(0x01)
    6796                    
    6797                            .dwendtag $C$DW$T$89
    6798                    
    6799                    
    6800                    $C$DW$T$90      .dwtag  DW_TAG_array_type
    6801                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$8)
    6802                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x04)
    6803                    $C$DW$332       .dwtag  DW_TAG_subrange_type
    6804                            .dwattr $C$DW$332, DW_AT_upper_bound(0x01)
    6805                    
    6806                            .dwendtag $C$DW$T$90
    6807                    
    6808                    
    6809                    $C$DW$T$91      .dwtag  DW_TAG_array_type
    6810                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    6811                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x08)
    6812                    $C$DW$333       .dwtag  DW_TAG_subrange_type
    6813                            .dwattr $C$DW$333, DW_AT_upper_bound(0x01)
    6814                    
    6815                            .dwendtag $C$DW$T$91
    6816                    
    6817                    
    6818                    $C$DW$T$92      .dwtag  DW_TAG_array_type
    6819                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$12)
    6820                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x0a)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  125

    6821                    $C$DW$334       .dwtag  DW_TAG_subrange_type
    6822                            .dwattr $C$DW$334, DW_AT_upper_bound(0x01)
    6823                    
    6824                            .dwendtag $C$DW$T$92
    6825                    
    6826                    
    6827                    $C$DW$T$93      .dwtag  DW_TAG_array_type
    6828                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$14)
    6829                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x10)
    6830                    $C$DW$335       .dwtag  DW_TAG_subrange_type
    6831                            .dwattr $C$DW$335, DW_AT_upper_bound(0x01)
    6832                    
    6833                            .dwendtag $C$DW$T$93
    6834                    
    6835                    
    6836                    $C$DW$T$94      .dwtag  DW_TAG_array_type
    6837                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$16)
    6838                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x08)
    6839                    $C$DW$336       .dwtag  DW_TAG_subrange_type
    6840                            .dwattr $C$DW$336, DW_AT_upper_bound(0x01)
    6841                    
    6842                            .dwendtag $C$DW$T$94
    6843                    
    6844                    
    6845                    $C$DW$T$95      .dwtag  DW_TAG_array_type
    6846                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$17)
    6847                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x10)
    6848                    $C$DW$337       .dwtag  DW_TAG_subrange_type
    6849                            .dwattr $C$DW$337, DW_AT_upper_bound(0x01)
    6850                    
    6851                            .dwendtag $C$DW$T$95
    6852                    
    6853                    
    6854                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6855                            .dwattr $C$DW$T$28, DW_AT_name("edmaContext")
    6856                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x4140)
    6857                    $C$DW$338       .dwtag  DW_TAG_member
    6858                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$25)
    6859                            .dwattr $C$DW$338, DW_AT_name("dchMap")
    6860                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("dchMap")
    6861                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6862                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6863                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6864                            .dwattr $C$DW$338, DW_AT_decl_line(0x131)
    6865                            .dwattr $C$DW$338, DW_AT_decl_column(0x12)
    6866                    
    6867                    $C$DW$339       .dwtag  DW_TAG_member
    6868                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$26)
    6869                            .dwattr $C$DW$339, DW_AT_name("dmaQNum")
    6870                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("dmaQNum")
    6871                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6872                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6873                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6874                            .dwattr $C$DW$339, DW_AT_decl_line(0x133)
    6875                            .dwattr $C$DW$339, DW_AT_decl_column(0x12)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  126

    6876                    
    6877                    $C$DW$340       .dwtag  DW_TAG_member
    6878                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$11)
    6879                            .dwattr $C$DW$340, DW_AT_name("regAccEnableLow")
    6880                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("regAccEnableLow")
    6881                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    6882                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6883                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6884                            .dwattr $C$DW$340, DW_AT_decl_line(0x136)
    6885                            .dwattr $C$DW$340, DW_AT_decl_column(0x12)
    6886                    
    6887                    $C$DW$341       .dwtag  DW_TAG_member
    6888                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$11)
    6889                            .dwattr $C$DW$341, DW_AT_name("regAccEnableHigh")
    6890                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("regAccEnableHigh")
    6891                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    6892                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6893                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6894                            .dwattr $C$DW$341, DW_AT_decl_line(0x137)
    6895                            .dwattr $C$DW$341, DW_AT_decl_column(0x12)
    6896                    
    6897                    $C$DW$342       .dwtag  DW_TAG_member
    6898                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$11)
    6899                            .dwattr $C$DW$342, DW_AT_name("eventSetRegLow")
    6900                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("eventSetRegLow")
    6901                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    6902                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6903                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6904                            .dwattr $C$DW$342, DW_AT_decl_line(0x13a)
    6905                            .dwattr $C$DW$342, DW_AT_decl_column(0x12)
    6906                    
    6907                    $C$DW$343       .dwtag  DW_TAG_member
    6908                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$11)
    6909                            .dwattr $C$DW$343, DW_AT_name("eventSetRegHigh")
    6910                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("eventSetRegHigh")
    6911                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    6912                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6913                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6914                            .dwattr $C$DW$343, DW_AT_decl_line(0x13b)
    6915                            .dwattr $C$DW$343, DW_AT_decl_column(0x12)
    6916                    
    6917                    $C$DW$344       .dwtag  DW_TAG_member
    6918                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$11)
    6919                            .dwattr $C$DW$344, DW_AT_name("enableEvtSetRegLow")
    6920                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("enableEvtSetRegLow")
    6921                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    6922                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6923                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6924                            .dwattr $C$DW$344, DW_AT_decl_line(0x13e)
    6925                            .dwattr $C$DW$344, DW_AT_decl_column(0x12)
    6926                    
    6927                    $C$DW$345       .dwtag  DW_TAG_member
    6928                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$11)
    6929                            .dwattr $C$DW$345, DW_AT_name("enableEvtSetRegHigh")
    6930                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("enableEvtSetRegHigh")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  127

    6931                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    6932                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6933                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6934                            .dwattr $C$DW$345, DW_AT_decl_line(0x13f)
    6935                            .dwattr $C$DW$345, DW_AT_decl_column(0x12)
    6936                    
    6937                    $C$DW$346       .dwtag  DW_TAG_member
    6938                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$11)
    6939                            .dwattr $C$DW$346, DW_AT_name("intEnableSetRegLow")
    6940                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("intEnableSetRegLow")
    6941                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    6942                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6943                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6944                            .dwattr $C$DW$346, DW_AT_decl_line(0x142)
    6945                            .dwattr $C$DW$346, DW_AT_decl_column(0x12)
    6946                    
    6947                    $C$DW$347       .dwtag  DW_TAG_member
    6948                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$11)
    6949                            .dwattr $C$DW$347, DW_AT_name("intEnableSetRegHigh")
    6950                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("intEnableSetRegHigh")
    6951                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    6952                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6953                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6954                            .dwattr $C$DW$347, DW_AT_decl_line(0x143)
    6955                            .dwattr $C$DW$347, DW_AT_decl_column(0x12)
    6956                    
    6957                    $C$DW$348       .dwtag  DW_TAG_member
    6958                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$27)
    6959                            .dwattr $C$DW$348, DW_AT_name("dmaParEntry")
    6960                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("dmaParEntry")
    6961                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    6962                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6963                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6964                            .dwattr $C$DW$348, DW_AT_decl_line(0x145)
    6965                            .dwattr $C$DW$348, DW_AT_decl_column(0x1e)
    6966                    
    6967                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6968                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x12f)
    6969                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    6970                            .dwendtag $C$DW$T$28
    6971                    
    6972                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    6973                            .dwattr $C$DW$T$47, DW_AT_name("EDMACONTEXT")
    6974                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$28)
    6975                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6976                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/edma.h")
    6977                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    6978                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    6979                    
    6980                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    6981                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    6982                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    6983                    
    6984                    $C$DW$T$75      .dwtag  DW_TAG_const_type
    6985                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$48)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
edma.asm                                                             PAGE  128

    6986                    
    6987                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6988                    
    6989                    ;***************************************************************
    6990                    ;* DWARF CIE ENTRIES                                           *
    6991                    ;***************************************************************
    6992                    
    6993                    $C$DW$CIE       .dwcie 19
    6994                            .dwcfi  cfa_register, 31
    6995                            .dwcfi  cfa_offset, 0
    6996                            .dwcfi  undefined, 0
    6997                            .dwcfi  undefined, 1
    6998                            .dwcfi  undefined, 2
    6999                            .dwcfi  undefined, 3
    7000                            .dwcfi  undefined, 4
    7001                            .dwcfi  undefined, 5
    7002                            .dwcfi  undefined, 6
    7003                            .dwcfi  undefined, 7
    7004                            .dwcfi  undefined, 8
    7005                            .dwcfi  undefined, 9
    7006                            .dwcfi  same_value, 10
    7007                            .dwcfi  same_value, 11
    7008                            .dwcfi  same_value, 12
    7009                            .dwcfi  same_value, 13
    7010                            .dwcfi  same_value, 14
    7011                            .dwcfi  same_value, 15
    7012                            .dwcfi  undefined, 32
    7013                            .dwcfi  undefined, 37
    7014                            .dwcfi  undefined, 38
    7015                            .dwcfi  undefined, 39
    7016                            .dwcfi  undefined, 40
    7017                            .dwcfi  undefined, 41
