TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Fri Apr 14 08:40:33 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    5311                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    5312                    
    5313                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    5314                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5315                            .dwattr $C$DW$T$8, DW_AT_name("short")
    5316                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    5317                    
    5318                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    5319                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5320                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    5321                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    5322                    
    5323                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    5324                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    5325                            .dwattr $C$DW$T$10, DW_AT_name("int")
    5326                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    5327                    
    5328                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    5329                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5330                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    5331                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    5332                    
    5333                    
    5334                    $C$DW$T$19      .dwtag  DW_TAG_array_type
    5335                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE   98

    5336                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    5337                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x40)
    5338                    $C$DW$323       .dwtag  DW_TAG_subrange_type
    5339                            .dwattr $C$DW$323, DW_AT_upper_bound(0x0f)
    5340                    
    5341                            .dwendtag $C$DW$T$19
    5342                    
    5343                    $C$DW$T$32      .dwtag  DW_TAG_const_type
    5344                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$11)
    5345                    
    5346                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    5347                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    5348                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    5349                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    5350                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    5351                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    5352                    
    5353                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    5354                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5355                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    5356                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
    5357                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    5358                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
    5359                    
    5360                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    5361                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5362                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    5363                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    5364                    
    5365                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    5366                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5367                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5368                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    5369                    
    5370                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    5371                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5372                            .dwattr $C$DW$T$16, DW_AT_name("float")
    5373                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    5374                    
    5375                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    5376                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5377                            .dwattr $C$DW$T$17, DW_AT_name("double")
    5378                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    5379                    
    5380                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    5381                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5382                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    5383                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    5384                    
    5385                    
    5386                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5387                            .dwattr $C$DW$T$20, DW_AT_name("mcaspContext")
    5388                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x8c)
    5389                    $C$DW$324       .dwtag  DW_TAG_member
    5390                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$11)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE   99

    5391                            .dwattr $C$DW$324, DW_AT_name("fifoWfifoCtl")
    5392                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("fifoWfifoCtl")
    5393                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5394                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5395                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5396                            .dwattr $C$DW$324, DW_AT_decl_line(0x191)
    5397                            .dwattr $C$DW$324, DW_AT_decl_column(0x12)
    5398                    
    5399                    $C$DW$325       .dwtag  DW_TAG_member
    5400                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$11)
    5401                            .dwattr $C$DW$325, DW_AT_name("xmask")
    5402                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("xmask")
    5403                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5404                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5405                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5406                            .dwattr $C$DW$325, DW_AT_decl_line(0x192)
    5407                            .dwattr $C$DW$325, DW_AT_decl_column(0x12)
    5408                    
    5409                    $C$DW$326       .dwtag  DW_TAG_member
    5410                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$11)
    5411                            .dwattr $C$DW$326, DW_AT_name("xfmt")
    5412                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("xfmt")
    5413                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5414                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5415                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5416                            .dwattr $C$DW$326, DW_AT_decl_line(0x193)
    5417                            .dwattr $C$DW$326, DW_AT_decl_column(0x12)
    5418                    
    5419                    $C$DW$327       .dwtag  DW_TAG_member
    5420                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$11)
    5421                            .dwattr $C$DW$327, DW_AT_name("afsxctl")
    5422                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("afsxctl")
    5423                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5424                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5425                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5426                            .dwattr $C$DW$327, DW_AT_decl_line(0x194)
    5427                            .dwattr $C$DW$327, DW_AT_decl_column(0x12)
    5428                    
    5429                    $C$DW$328       .dwtag  DW_TAG_member
    5430                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$11)
    5431                            .dwattr $C$DW$328, DW_AT_name("aclkxctl")
    5432                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("aclkxctl")
    5433                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5434                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5435                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5436                            .dwattr $C$DW$328, DW_AT_decl_line(0x195)
    5437                            .dwattr $C$DW$328, DW_AT_decl_column(0x12)
    5438                    
    5439                    $C$DW$329       .dwtag  DW_TAG_member
    5440                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$11)
    5441                            .dwattr $C$DW$329, DW_AT_name("ahclkxctl")
    5442                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("ahclkxctl")
    5443                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5444                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5445                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE  100

    5446                            .dwattr $C$DW$329, DW_AT_decl_line(0x196)
    5447                            .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    5448                    
    5449                    $C$DW$330       .dwtag  DW_TAG_member
    5450                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$11)
    5451                            .dwattr $C$DW$330, DW_AT_name("xclkchk")
    5452                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("xclkchk")
    5453                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5454                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5455                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5456                            .dwattr $C$DW$330, DW_AT_decl_line(0x197)
    5457                            .dwattr $C$DW$330, DW_AT_decl_column(0x12)
    5458                    
    5459                    $C$DW$331       .dwtag  DW_TAG_member
    5460                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$11)
    5461                            .dwattr $C$DW$331, DW_AT_name("xtdm")
    5462                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("xtdm")
    5463                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5464                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5465                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5466                            .dwattr $C$DW$331, DW_AT_decl_line(0x198)
    5467                            .dwattr $C$DW$331, DW_AT_decl_column(0x12)
    5468                    
    5469                    $C$DW$332       .dwtag  DW_TAG_member
    5470                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    5471                            .dwattr $C$DW$332, DW_AT_name("srctl")
    5472                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("srctl")
    5473                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5474                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5475                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5476                            .dwattr $C$DW$332, DW_AT_decl_line(0x199)
    5477                            .dwattr $C$DW$332, DW_AT_decl_column(0x12)
    5478                    
    5479                    $C$DW$333       .dwtag  DW_TAG_member
    5480                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$11)
    5481                            .dwattr $C$DW$333, DW_AT_name("pfunc")
    5482                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("pfunc")
    5483                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5484                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5485                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5486                            .dwattr $C$DW$333, DW_AT_decl_line(0x19a)
    5487                            .dwattr $C$DW$333, DW_AT_decl_column(0x12)
    5488                    
    5489                    $C$DW$334       .dwtag  DW_TAG_member
    5490                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$11)
    5491                            .dwattr $C$DW$334, DW_AT_name("pdir")
    5492                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("pdir")
    5493                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    5494                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5495                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5496                            .dwattr $C$DW$334, DW_AT_decl_line(0x19b)
    5497                            .dwattr $C$DW$334, DW_AT_decl_column(0x12)
    5498                    
    5499                    $C$DW$335       .dwtag  DW_TAG_member
    5500                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$11)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE  101

    5501                            .dwattr $C$DW$335, DW_AT_name("fifoRfifoCtl")
    5502                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("fifoRfifoCtl")
    5503                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    5504                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5505                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5506                            .dwattr $C$DW$335, DW_AT_decl_line(0x19c)
    5507                            .dwattr $C$DW$335, DW_AT_decl_column(0x12)
    5508                    
    5509                    $C$DW$336       .dwtag  DW_TAG_member
    5510                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$11)
    5511                            .dwattr $C$DW$336, DW_AT_name("rmask")
    5512                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("rmask")
    5513                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5514                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5515                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5516                            .dwattr $C$DW$336, DW_AT_decl_line(0x19d)
    5517                            .dwattr $C$DW$336, DW_AT_decl_column(0x12)
    5518                    
    5519                    $C$DW$337       .dwtag  DW_TAG_member
    5520                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$11)
    5521                            .dwattr $C$DW$337, DW_AT_name("rfmt")
    5522                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("rfmt")
    5523                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    5524                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5525                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5526                            .dwattr $C$DW$337, DW_AT_decl_line(0x19e)
    5527                            .dwattr $C$DW$337, DW_AT_decl_column(0x12)
    5528                    
    5529                    $C$DW$338       .dwtag  DW_TAG_member
    5530                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$11)
    5531                            .dwattr $C$DW$338, DW_AT_name("afsrctl")
    5532                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("afsrctl")
    5533                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    5534                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5535                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5536                            .dwattr $C$DW$338, DW_AT_decl_line(0x19f)
    5537                            .dwattr $C$DW$338, DW_AT_decl_column(0x12)
    5538                    
    5539                    $C$DW$339       .dwtag  DW_TAG_member
    5540                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$11)
    5541                            .dwattr $C$DW$339, DW_AT_name("aclkrctl")
    5542                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("aclkrctl")
    5543                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5544                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5545                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5546                            .dwattr $C$DW$339, DW_AT_decl_line(0x1a0)
    5547                            .dwattr $C$DW$339, DW_AT_decl_column(0x12)
    5548                    
    5549                    $C$DW$340       .dwtag  DW_TAG_member
    5550                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$11)
    5551                            .dwattr $C$DW$340, DW_AT_name("ahclkrctl")
    5552                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("ahclkrctl")
    5553                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5554                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5555                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE  102

    5556                            .dwattr $C$DW$340, DW_AT_decl_line(0x1a1)
    5557                            .dwattr $C$DW$340, DW_AT_decl_column(0x12)
    5558                    
    5559                    $C$DW$341       .dwtag  DW_TAG_member
    5560                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$11)
    5561                            .dwattr $C$DW$341, DW_AT_name("rclkchk")
    5562                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("rclkchk")
    5563                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    5564                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5565                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5566                            .dwattr $C$DW$341, DW_AT_decl_line(0x1a2)
    5567                            .dwattr $C$DW$341, DW_AT_decl_column(0x12)
    5568                    
    5569                    $C$DW$342       .dwtag  DW_TAG_member
    5570                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$11)
    5571                            .dwattr $C$DW$342, DW_AT_name("rtdm")
    5572                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("rtdm")
    5573                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5574                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5575                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5576                            .dwattr $C$DW$342, DW_AT_decl_line(0x1a3)
    5577                            .dwattr $C$DW$342, DW_AT_decl_column(0x12)
    5578                    
    5579                    $C$DW$343       .dwtag  DW_TAG_member
    5580                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$11)
    5581                            .dwattr $C$DW$343, DW_AT_name("gblctl")
    5582                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("gblctl")
    5583                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    5584                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5585                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5586                            .dwattr $C$DW$343, DW_AT_decl_line(0x1a4)
    5587                            .dwattr $C$DW$343, DW_AT_decl_column(0x12)
    5588                    
    5589                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5590                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x190)
    5591                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    5592                            .dwendtag $C$DW$T$20
    5593                    
    5594                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    5595                            .dwattr $C$DW$T$26, DW_AT_name("MCASPCONTEXT")
    5596                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    5597                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    5598                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/mcasp.h")
    5599                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x1a5)
    5600                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    5601                    
    5602                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    5603                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5604                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    5605                    
    5606                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    5607                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$27)
    5608                    
    5609                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5610                    
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
mcasp.asm                                                            PAGE  103

    5611                    ;***************************************************************
    5612                    ;* DWARF CIE ENTRIES                                           *
    5613                    ;***************************************************************
    5614                    
    5615                    $C$DW$CIE       .dwcie 19
    5616                            .dwcfi  cfa_register, 31
    5617                            .dwcfi  cfa_offset, 0
    5618                            .dwcfi  undefined, 0
    5619                            .dwcfi  undefined, 1
    5620                            .dwcfi  undefined, 2
    5621                            .dwcfi  undefined, 3
    5622                            .dwcfi  undefined, 4
    5623                            .dwcfi  undefined, 5
    5624                            .dwcfi  undefined, 6
    5625                            .dwcfi  undefined, 7
    5626                            .dwcfi  undefined, 8
    5627                            .dwcfi  undefined, 9
    5628                            .dwcfi  same_value, 10
    5629                            .dwcfi  same_value, 11
    5630                            .dwcfi  same_value, 12
    5631                            .dwcfi  same_value, 13
    5632                            .dwcfi  same_value, 14
    5633                            .dwcfi  same_value, 15
    5634                            .dwcfi  undefined, 32
    5635                            .dwcfi  undefined, 37
    5636                            .dwcfi  undefined, 38
    5637                            .dwcfi  undefined, 39
    5638                            .dwcfi  undefined, 40
    5639                            .dwcfi  undefined, 41
