TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
raster.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Fri Apr 14 08:40:34 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    4348                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    4349                            .dwattr $C$DW$T$28, DW_AT_name("tBoolean")
    4350                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
    4351                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4352                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_types
    4353                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x32)
    4354                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x17)
    4355                    
    4356                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4357                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4358                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4359                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4360                    
    4361                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4362                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4363                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4364                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4365                    
    4366                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4367                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4368                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4369                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4370                    
    4371                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4372                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4373                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4374                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4375                    
    4376                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    4377                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4378                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4379                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    4380                    
    4381                    $C$DW$T$30      .dwtag  DW_TAG_const_type
    4382                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$11)
    4383                    
    4384                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4385                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4386                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    4387                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    4388                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    4389                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    4390                    
    4391                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    4392                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4393                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    4394                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
    4395                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    4396                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
    4397                    
    4398                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    4399                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4400                            .dwattr $C$DW$T$14, DW_AT_name("long long")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
raster.asm                                                           PAGE   81

    4401                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4402                    
    4403                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    4404                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4405                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4406                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4407                    
    4408                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4409                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4410                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4411                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4412                    
    4413                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4414                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4415                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4416                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4417                    
    4418                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    4419                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4420                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4421                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4422                    
    4423                    
    4424                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4425                            .dwattr $C$DW$T$19, DW_AT_name("rasterContext")
    4426                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x30)
    4427                    $C$DW$271       .dwtag  DW_TAG_member
    4428                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$11)
    4429                            .dwattr $C$DW$271, DW_AT_name("clkcEnable")
    4430                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("clkcEnable")
    4431                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4432                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4433                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4434                            .dwattr $C$DW$271, DW_AT_decl_line(0x140)
    4435                            .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    4436                    
    4437                    $C$DW$272       .dwtag  DW_TAG_member
    4438                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$11)
    4439                            .dwattr $C$DW$272, DW_AT_name("lcdCtrl")
    4440                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("lcdCtrl")
    4441                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4442                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4443                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4444                            .dwattr $C$DW$272, DW_AT_decl_line(0x141)
    4445                            .dwattr $C$DW$272, DW_AT_decl_column(0x12)
    4446                    
    4447                    $C$DW$273       .dwtag  DW_TAG_member
    4448                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$11)
    4449                            .dwattr $C$DW$273, DW_AT_name("lcddmaCtrl")
    4450                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("lcddmaCtrl")
    4451                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4452                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4453                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4454                            .dwattr $C$DW$273, DW_AT_decl_line(0x142)
    4455                            .dwattr $C$DW$273, DW_AT_decl_column(0x12)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
raster.asm                                                           PAGE   82

    4456                    
    4457                    $C$DW$274       .dwtag  DW_TAG_member
    4458                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$11)
    4459                            .dwattr $C$DW$274, DW_AT_name("rasterTiming0")
    4460                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("rasterTiming0")
    4461                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4462                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4463                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4464                            .dwattr $C$DW$274, DW_AT_decl_line(0x143)
    4465                            .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    4466                    
    4467                    $C$DW$275       .dwtag  DW_TAG_member
    4468                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$11)
    4469                            .dwattr $C$DW$275, DW_AT_name("rasterTiming1")
    4470                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("rasterTiming1")
    4471                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4472                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4473                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4474                            .dwattr $C$DW$275, DW_AT_decl_line(0x144)
    4475                            .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    4476                    
    4477                    $C$DW$276       .dwtag  DW_TAG_member
    4478                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$11)
    4479                            .dwattr $C$DW$276, DW_AT_name("rasterTiming2")
    4480                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("rasterTiming2")
    4481                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4482                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4483                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4484                            .dwattr $C$DW$276, DW_AT_decl_line(0x145)
    4485                            .dwattr $C$DW$276, DW_AT_decl_column(0x12)
    4486                    
    4487                    $C$DW$277       .dwtag  DW_TAG_member
    4488                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$11)
    4489                            .dwattr $C$DW$277, DW_AT_name("rasterCtrl")
    4490                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("rasterCtrl")
    4491                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4492                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4493                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4494                            .dwattr $C$DW$277, DW_AT_decl_line(0x146)
    4495                            .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    4496                    
    4497                    $C$DW$278       .dwtag  DW_TAG_member
    4498                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$11)
    4499                            .dwattr $C$DW$278, DW_AT_name("irqEnableSet")
    4500                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("irqEnableSet")
    4501                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4502                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4503                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4504                            .dwattr $C$DW$278, DW_AT_decl_line(0x147)
    4505                            .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    4506                    
    4507                    $C$DW$279       .dwtag  DW_TAG_member
    4508                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$11)
    4509                            .dwattr $C$DW$279, DW_AT_name("lcddmaFb0Base")
    4510                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("lcddmaFb0Base")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
raster.asm                                                           PAGE   83

    4511                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4512                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4513                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4514                            .dwattr $C$DW$279, DW_AT_decl_line(0x148)
    4515                            .dwattr $C$DW$279, DW_AT_decl_column(0x12)
    4516                    
    4517                    $C$DW$280       .dwtag  DW_TAG_member
    4518                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$11)
    4519                            .dwattr $C$DW$280, DW_AT_name("lcddmaFb0Ceiling")
    4520                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("lcddmaFb0Ceiling")
    4521                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4522                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4523                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4524                            .dwattr $C$DW$280, DW_AT_decl_line(0x149)
    4525                            .dwattr $C$DW$280, DW_AT_decl_column(0x12)
    4526                    
    4527                    $C$DW$281       .dwtag  DW_TAG_member
    4528                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$11)
    4529                            .dwattr $C$DW$281, DW_AT_name("lcddmaFb1Base")
    4530                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("lcddmaFb1Base")
    4531                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4532                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4533                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4534                            .dwattr $C$DW$281, DW_AT_decl_line(0x14a)
    4535                            .dwattr $C$DW$281, DW_AT_decl_column(0x12)
    4536                    
    4537                    $C$DW$282       .dwtag  DW_TAG_member
    4538                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$11)
    4539                            .dwattr $C$DW$282, DW_AT_name("lcddmaFb1Ceiling")
    4540                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("lcddmaFb1Ceiling")
    4541                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4542                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4543                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4544                            .dwattr $C$DW$282, DW_AT_decl_line(0x14b)
    4545                            .dwattr $C$DW$282, DW_AT_decl_column(0x12)
    4546                    
    4547                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4548                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x13f)
    4549                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    4550                            .dwendtag $C$DW$T$19
    4551                    
    4552                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    4553                            .dwattr $C$DW$T$25, DW_AT_name("RASTERCONTEXT")
    4554                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$19)
    4555                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4556                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/raster.h")
    4557                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x14c)
    4558                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x02)
    4559                    
    4560                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4561                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4562                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    4563                    
    4564                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    4565                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:35 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
raster.asm                                                           PAGE   84

    4566                    
    4567                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4568                    
    4569                    ;***************************************************************
    4570                    ;* DWARF CIE ENTRIES                                           *
    4571                    ;***************************************************************
    4572                    
    4573                    $C$DW$CIE       .dwcie 19
    4574                            .dwcfi  cfa_register, 31
    4575                            .dwcfi  cfa_offset, 0
    4576                            .dwcfi  undefined, 0
    4577                            .dwcfi  undefined, 1
    4578                            .dwcfi  undefined, 2
    4579                            .dwcfi  undefined, 3
    4580                            .dwcfi  undefined, 4
    4581                            .dwcfi  undefined, 5
    4582                            .dwcfi  undefined, 6
    4583                            .dwcfi  undefined, 7
    4584                            .dwcfi  undefined, 8
    4585                            .dwcfi  undefined, 9
    4586                            .dwcfi  same_value, 10
    4587                            .dwcfi  same_value, 11
    4588                            .dwcfi  same_value, 12
    4589                            .dwcfi  same_value, 13
    4590                            .dwcfi  same_value, 14
    4591                            .dwcfi  same_value, 15
    4592                            .dwcfi  undefined, 32
    4593                            .dwcfi  undefined, 37
    4594                            .dwcfi  undefined, 38
    4595                            .dwcfi  undefined, 39
    4596                            .dwcfi  undefined, 40
    4597                            .dwcfi  undefined, 41
