TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 20 05:51:02 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    3790                            .dwattr $C$DW$302, DW_AT_decl_column(0x03)
    3791                    
    3792                    $C$DW$303       .dwtag  DW_TAG_enumerator
    3793                            .dwattr $C$DW$303, DW_AT_name("CSL_EDMATC_0")
    3794                            .dwattr $C$DW$303, DW_AT_const_value(0x00)
    3795                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   70

    3796                            .dwattr $C$DW$303, DW_AT_decl_line(0x41a)
    3797                            .dwattr $C$DW$303, DW_AT_decl_column(0x03)
    3798                    
    3799                    $C$DW$304       .dwtag  DW_TAG_enumerator
    3800                            .dwattr $C$DW$304, DW_AT_name("CSL_EDMATC_1")
    3801                            .dwattr $C$DW$304, DW_AT_const_value(0x01)
    3802                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    3803                            .dwattr $C$DW$304, DW_AT_decl_line(0x41b)
    3804                            .dwattr $C$DW$304, DW_AT_decl_column(0x03)
    3805                    
    3806                            .dwattr $C$DW$T$631, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    3807                            .dwattr $C$DW$T$631, DW_AT_decl_line(0x418)
    3808                            .dwattr $C$DW$T$631, DW_AT_decl_column(0x0e)
    3809                            .dwendtag $C$DW$T$631
    3810                    
    3811                    $C$DW$T$632     .dwtag  DW_TAG_typedef
    3812                            .dwattr $C$DW$T$632, DW_AT_name("CSL_EdmatcNum")
    3813                            .dwattr $C$DW$T$632, DW_AT_type(*$C$DW$T$631)
    3814                            .dwattr $C$DW$T$632, DW_AT_language(DW_LANG_C)
    3815                            .dwattr $C$DW$T$632, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    3816                            .dwattr $C$DW$T$632, DW_AT_decl_line(0x41c)
    3817                            .dwattr $C$DW$T$632, DW_AT_decl_column(0x03)
    3818                    
    3819                    
    3820                    $C$DW$T$633     .dwtag  DW_TAG_enumeration_type
    3821                            .dwattr $C$DW$T$633, DW_AT_byte_size(0x04)
    3822                    $C$DW$305       .dwtag  DW_TAG_enumerator
    3823                            .dwattr $C$DW$305, DW_AT_name("CSL_DAT_PRI_DEFAULT")
    3824                            .dwattr $C$DW$305, DW_AT_const_value(0x00)
    3825                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    3826                            .dwattr $C$DW$305, DW_AT_decl_line(0x449)
    3827                            .dwattr $C$DW$305, DW_AT_decl_column(0x05)
    3828                    
    3829                    $C$DW$306       .dwtag  DW_TAG_enumerator
    3830                            .dwattr $C$DW$306, DW_AT_name("CSL_DAT_PRI_0")
    3831                            .dwattr $C$DW$306, DW_AT_const_value(0x00)
    3832                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    3833                            .dwattr $C$DW$306, DW_AT_decl_line(0x44a)
    3834                            .dwattr $C$DW$306, DW_AT_decl_column(0x05)
    3835                    
    3836                    $C$DW$307       .dwtag  DW_TAG_enumerator
    3837                            .dwattr $C$DW$307, DW_AT_name("CSL_DAT_PRI_1")
    3838                            .dwattr $C$DW$307, DW_AT_const_value(0x01)
    3839                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL138
    3840                            .dwattr $C$DW$307, DW_AT_decl_line(0x44b)
    3841                            .dwattr $C$DW$307, DW_AT_decl_column(0x05)
    3842                    
    3843                            .dwattr $C$DW$T$633, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    3844                            .dwattr $C$DW$T$633, DW_AT_decl_line(0x448)
    3845                            .dwattr $C$DW$T$633, DW_AT_decl_column(0x0e)
    3846                            .dwendtag $C$DW$T$633
    3847                    
    3848                    $C$DW$T$634     .dwtag  DW_TAG_typedef
    3849                            .dwattr $C$DW$T$634, DW_AT_name("CSL_DatPriority")
    3850                            .dwattr $C$DW$T$634, DW_AT_type(*$C$DW$T$633)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   71

    3851                            .dwattr $C$DW$T$634, DW_AT_language(DW_LANG_C)
    3852                            .dwattr $C$DW$T$634, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/soc_OMAPL1
    3853                            .dwattr $C$DW$T$634, DW_AT_decl_line(0x44c)
    3854                            .dwattr $C$DW$T$634, DW_AT_decl_column(0x03)
    3855                    
    3856                    
    3857                    $C$DW$T$161     .dwtag  DW_TAG_structure_type
    3858                            .dwattr $C$DW$T$161, DW_AT_byte_size(0x190)
    3859                    $C$DW$308       .dwtag  DW_TAG_member
    3860                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$151)
    3861                            .dwattr $C$DW$308, DW_AT_name("REVID")
    3862                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("REVID")
    3863                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3864                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3865                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3866                            .dwattr $C$DW$308, DW_AT_decl_line(0x43)
    3867                            .dwattr $C$DW$308, DW_AT_decl_column(0x15)
    3868                    
    3869                    $C$DW$309       .dwtag  DW_TAG_member
    3870                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$157)
    3871                            .dwattr $C$DW$309, DW_AT_name("RSVD0")
    3872                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("RSVD0")
    3873                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3874                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3875                            .dwattr $C$DW$309, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3876                            .dwattr $C$DW$309, DW_AT_decl_line(0x44)
    3877                            .dwattr $C$DW$309, DW_AT_decl_column(0x14)
    3878                    
    3879                    $C$DW$310       .dwtag  DW_TAG_member
    3880                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$151)
    3881                            .dwattr $C$DW$310, DW_AT_name("DIEIDR0")
    3882                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("DIEIDR0")
    3883                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3884                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3885                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3886                            .dwattr $C$DW$310, DW_AT_decl_line(0x45)
    3887                            .dwattr $C$DW$310, DW_AT_decl_column(0x15)
    3888                    
    3889                    $C$DW$311       .dwtag  DW_TAG_member
    3890                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$151)
    3891                            .dwattr $C$DW$311, DW_AT_name("DIEIDR1")
    3892                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("DIEIDR1")
    3893                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3894                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3896                            .dwattr $C$DW$311, DW_AT_decl_line(0x46)
    3897                            .dwattr $C$DW$311, DW_AT_decl_column(0x15)
    3898                    
    3899                    $C$DW$312       .dwtag  DW_TAG_member
    3900                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$151)
    3901                            .dwattr $C$DW$312, DW_AT_name("DIEIDR2")
    3902                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("DIEIDR2")
    3903                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3904                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3905                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   72

    3906                            .dwattr $C$DW$312, DW_AT_decl_line(0x47)
    3907                            .dwattr $C$DW$312, DW_AT_decl_column(0x15)
    3908                    
    3909                    $C$DW$313       .dwtag  DW_TAG_member
    3910                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$151)
    3911                            .dwattr $C$DW$313, DW_AT_name("DIEIDR3")
    3912                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("DIEIDR3")
    3913                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3914                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3915                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3916                            .dwattr $C$DW$313, DW_AT_decl_line(0x48)
    3917                            .dwattr $C$DW$313, DW_AT_decl_column(0x15)
    3918                    
    3919                    $C$DW$314       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$151)
    3921                            .dwattr $C$DW$314, DW_AT_name("DEVIDR0")
    3922                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("DEVIDR0")
    3923                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3924                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3926                            .dwattr $C$DW$314, DW_AT_decl_line(0x49)
    3927                            .dwattr $C$DW$314, DW_AT_decl_column(0x15)
    3928                    
    3929                    $C$DW$315       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$157)
    3931                            .dwattr $C$DW$315, DW_AT_name("RSVD1")
    3932                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("RSVD1")
    3933                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3934                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3936                            .dwattr $C$DW$315, DW_AT_decl_line(0x4a)
    3937                            .dwattr $C$DW$315, DW_AT_decl_column(0x14)
    3938                    
    3939                    $C$DW$316       .dwtag  DW_TAG_member
    3940                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$151)
    3941                            .dwattr $C$DW$316, DW_AT_name("BOOTCFG")
    3942                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("BOOTCFG")
    3943                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3944                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3946                            .dwattr $C$DW$316, DW_AT_decl_line(0x4b)
    3947                            .dwattr $C$DW$316, DW_AT_decl_column(0x15)
    3948                    
    3949                    $C$DW$317       .dwtag  DW_TAG_member
    3950                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$151)
    3951                            .dwattr $C$DW$317, DW_AT_name("CHIPREVIDR")
    3952                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("CHIPREVIDR")
    3953                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3954                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3955                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3956                            .dwattr $C$DW$317, DW_AT_decl_line(0x4c)
    3957                            .dwattr $C$DW$317, DW_AT_decl_column(0x15)
    3958                    
    3959                    $C$DW$318       .dwtag  DW_TAG_member
    3960                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$158)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   73

    3961                            .dwattr $C$DW$318, DW_AT_name("RSVD2")
    3962                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("RSVD2")
    3963                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3964                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3965                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3966                            .dwattr $C$DW$318, DW_AT_decl_line(0x4d)
    3967                            .dwattr $C$DW$318, DW_AT_decl_column(0x14)
    3968                    
    3969                    $C$DW$319       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$151)
    3971                            .dwattr $C$DW$319, DW_AT_name("KICK0R")
    3972                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("KICK0R")
    3973                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3974                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3976                            .dwattr $C$DW$319, DW_AT_decl_line(0x4e)
    3977                            .dwattr $C$DW$319, DW_AT_decl_column(0x15)
    3978                    
    3979                    $C$DW$320       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$151)
    3981                            .dwattr $C$DW$320, DW_AT_name("KICK1R")
    3982                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("KICK1R")
    3983                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3984                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3985                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3986                            .dwattr $C$DW$320, DW_AT_decl_line(0x4f)
    3987                            .dwattr $C$DW$320, DW_AT_decl_column(0x15)
    3988                    
    3989                    $C$DW$321       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$151)
    3991                            .dwattr $C$DW$321, DW_AT_name("HOST0CFG")
    3992                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("HOST0CFG")
    3993                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3994                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3995                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3996                            .dwattr $C$DW$321, DW_AT_decl_line(0x50)
    3997                            .dwattr $C$DW$321, DW_AT_decl_column(0x15)
    3998                    
    3999                    $C$DW$322       .dwtag  DW_TAG_member
    4000                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$151)
    4001                            .dwattr $C$DW$322, DW_AT_name("HOST1CFG")
    4002                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("HOST1CFG")
    4003                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4004                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4005                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4006                            .dwattr $C$DW$322, DW_AT_decl_line(0x51)
    4007                            .dwattr $C$DW$322, DW_AT_decl_column(0x15)
    4008                    
    4009                    $C$DW$323       .dwtag  DW_TAG_member
    4010                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$159)
    4011                            .dwattr $C$DW$323, DW_AT_name("RSVD3")
    4012                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("RSVD3")
    4013                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4014                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4015                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   74

    4016                            .dwattr $C$DW$323, DW_AT_decl_line(0x52)
    4017                            .dwattr $C$DW$323, DW_AT_decl_column(0x14)
    4018                    
    4019                    $C$DW$324       .dwtag  DW_TAG_member
    4020                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$151)
    4021                            .dwattr $C$DW$324, DW_AT_name("IRAWSTAT")
    4022                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("IRAWSTAT")
    4023                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4024                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4025                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4026                            .dwattr $C$DW$324, DW_AT_decl_line(0x53)
    4027                            .dwattr $C$DW$324, DW_AT_decl_column(0x15)
    4028                    
    4029                    $C$DW$325       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$151)
    4031                            .dwattr $C$DW$325, DW_AT_name("IENSTAT")
    4032                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("IENSTAT")
    4033                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    4034                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4036                            .dwattr $C$DW$325, DW_AT_decl_line(0x54)
    4037                            .dwattr $C$DW$325, DW_AT_decl_column(0x15)
    4038                    
    4039                    $C$DW$326       .dwtag  DW_TAG_member
    4040                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$151)
    4041                            .dwattr $C$DW$326, DW_AT_name("IENSET")
    4042                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("IENSET")
    4043                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4044                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4045                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4046                            .dwattr $C$DW$326, DW_AT_decl_line(0x55)
    4047                            .dwattr $C$DW$326, DW_AT_decl_column(0x15)
    4048                    
    4049                    $C$DW$327       .dwtag  DW_TAG_member
    4050                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$151)
    4051                            .dwattr $C$DW$327, DW_AT_name("IENCLR")
    4052                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("IENCLR")
    4053                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4054                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4055                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4056                            .dwattr $C$DW$327, DW_AT_decl_line(0x56)
    4057                            .dwattr $C$DW$327, DW_AT_decl_column(0x15)
    4058                    
    4059                    $C$DW$328       .dwtag  DW_TAG_member
    4060                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$151)
    4061                            .dwattr $C$DW$328, DW_AT_name("EOI")
    4062                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("EOI")
    4063                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4064                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4065                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4066                            .dwattr $C$DW$328, DW_AT_decl_line(0x57)
    4067                            .dwattr $C$DW$328, DW_AT_decl_column(0x15)
    4068                    
    4069                    $C$DW$329       .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$151)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   75

    4071                            .dwattr $C$DW$329, DW_AT_name("FLTADDRR")
    4072                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("FLTADDRR")
    4073                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4074                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4076                            .dwattr $C$DW$329, DW_AT_decl_line(0x58)
    4077                            .dwattr $C$DW$329, DW_AT_decl_column(0x15)
    4078                    
    4079                    $C$DW$330       .dwtag  DW_TAG_member
    4080                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$151)
    4081                            .dwattr $C$DW$330, DW_AT_name("FLTSTAT")
    4082                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("FLTSTAT")
    4083                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    4084                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4085                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4086                            .dwattr $C$DW$330, DW_AT_decl_line(0x59)
    4087                            .dwattr $C$DW$330, DW_AT_decl_column(0x15)
    4088                    
    4089                    $C$DW$331       .dwtag  DW_TAG_member
    4090                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$160)
    4091                            .dwattr $C$DW$331, DW_AT_name("RSVD4")
    4092                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("RSVD4")
    4093                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    4094                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4095                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4096                            .dwattr $C$DW$331, DW_AT_decl_line(0x5a)
    4097                            .dwattr $C$DW$331, DW_AT_decl_column(0x14)
    4098                    
    4099                    $C$DW$332       .dwtag  DW_TAG_member
    4100                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$151)
    4101                            .dwattr $C$DW$332, DW_AT_name("MSTPRI0")
    4102                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("MSTPRI0")
    4103                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4104                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4105                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4106                            .dwattr $C$DW$332, DW_AT_decl_line(0x5b)
    4107                            .dwattr $C$DW$332, DW_AT_decl_column(0x15)
    4108                    
    4109                    $C$DW$333       .dwtag  DW_TAG_member
    4110                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$151)
    4111                            .dwattr $C$DW$333, DW_AT_name("MSTPRI1")
    4112                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("MSTPRI1")
    4113                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4114                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4115                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4116                            .dwattr $C$DW$333, DW_AT_decl_line(0x5c)
    4117                            .dwattr $C$DW$333, DW_AT_decl_column(0x15)
    4118                    
    4119                    $C$DW$334       .dwtag  DW_TAG_member
    4120                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$151)
    4121                            .dwattr $C$DW$334, DW_AT_name("MSTPRI2")
    4122                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("MSTPRI2")
    4123                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    4124                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4125                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   76

    4126                            .dwattr $C$DW$334, DW_AT_decl_line(0x5d)
    4127                            .dwattr $C$DW$334, DW_AT_decl_column(0x15)
    4128                    
    4129                    $C$DW$335       .dwtag  DW_TAG_member
    4130                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$157)
    4131                            .dwattr $C$DW$335, DW_AT_name("RSVD5")
    4132                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("RSVD5")
    4133                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    4134                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4135                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4136                            .dwattr $C$DW$335, DW_AT_decl_line(0x5e)
    4137                            .dwattr $C$DW$335, DW_AT_decl_column(0x14)
    4138                    
    4139                    $C$DW$336       .dwtag  DW_TAG_member
    4140                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$151)
    4141                            .dwattr $C$DW$336, DW_AT_name("PINMUX0")
    4142                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("PINMUX0")
    4143                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    4144                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4145                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4146                            .dwattr $C$DW$336, DW_AT_decl_line(0x5f)
    4147                            .dwattr $C$DW$336, DW_AT_decl_column(0x15)
    4148                    
    4149                    $C$DW$337       .dwtag  DW_TAG_member
    4150                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$151)
    4151                            .dwattr $C$DW$337, DW_AT_name("PINMUX1")
    4152                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("PINMUX1")
    4153                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4154                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4155                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4156                            .dwattr $C$DW$337, DW_AT_decl_line(0x60)
    4157                            .dwattr $C$DW$337, DW_AT_decl_column(0x15)
    4158                    
    4159                    $C$DW$338       .dwtag  DW_TAG_member
    4160                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$151)
    4161                            .dwattr $C$DW$338, DW_AT_name("PINMUX2")
    4162                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("PINMUX2")
    4163                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    4164                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4165                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4166                            .dwattr $C$DW$338, DW_AT_decl_line(0x61)
    4167                            .dwattr $C$DW$338, DW_AT_decl_column(0x15)
    4168                    
    4169                    $C$DW$339       .dwtag  DW_TAG_member
    4170                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$151)
    4171                            .dwattr $C$DW$339, DW_AT_name("PINMUX3")
    4172                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("PINMUX3")
    4173                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    4174                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4175                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4176                            .dwattr $C$DW$339, DW_AT_decl_line(0x62)
    4177                            .dwattr $C$DW$339, DW_AT_decl_column(0x15)
    4178                    
    4179                    $C$DW$340       .dwtag  DW_TAG_member
    4180                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$151)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   77

    4181                            .dwattr $C$DW$340, DW_AT_name("PINMUX4")
    4182                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("PINMUX4")
    4183                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    4184                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4185                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4186                            .dwattr $C$DW$340, DW_AT_decl_line(0x63)
    4187                            .dwattr $C$DW$340, DW_AT_decl_column(0x15)
    4188                    
    4189                    $C$DW$341       .dwtag  DW_TAG_member
    4190                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$151)
    4191                            .dwattr $C$DW$341, DW_AT_name("PINMUX5")
    4192                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("PINMUX5")
    4193                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    4194                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4195                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4196                            .dwattr $C$DW$341, DW_AT_decl_line(0x64)
    4197                            .dwattr $C$DW$341, DW_AT_decl_column(0x15)
    4198                    
    4199                    $C$DW$342       .dwtag  DW_TAG_member
    4200                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$151)
    4201                            .dwattr $C$DW$342, DW_AT_name("PINMUX6")
    4202                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("PINMUX6")
    4203                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    4204                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4205                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4206                            .dwattr $C$DW$342, DW_AT_decl_line(0x65)
    4207                            .dwattr $C$DW$342, DW_AT_decl_column(0x15)
    4208                    
    4209                    $C$DW$343       .dwtag  DW_TAG_member
    4210                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$151)
    4211                            .dwattr $C$DW$343, DW_AT_name("PINMUX7")
    4212                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("PINMUX7")
    4213                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    4214                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4215                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4216                            .dwattr $C$DW$343, DW_AT_decl_line(0x66)
    4217                            .dwattr $C$DW$343, DW_AT_decl_column(0x15)
    4218                    
    4219                    $C$DW$344       .dwtag  DW_TAG_member
    4220                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$151)
    4221                            .dwattr $C$DW$344, DW_AT_name("PINMUX8")
    4222                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("PINMUX8")
    4223                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    4224                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4225                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4226                            .dwattr $C$DW$344, DW_AT_decl_line(0x67)
    4227                            .dwattr $C$DW$344, DW_AT_decl_column(0x15)
    4228                    
    4229                    $C$DW$345       .dwtag  DW_TAG_member
    4230                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$151)
    4231                            .dwattr $C$DW$345, DW_AT_name("PINMUX9")
    4232                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("PINMUX9")
    4233                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    4234                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   78

    4236                            .dwattr $C$DW$345, DW_AT_decl_line(0x68)
    4237                            .dwattr $C$DW$345, DW_AT_decl_column(0x15)
    4238                    
    4239                    $C$DW$346       .dwtag  DW_TAG_member
    4240                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$151)
    4241                            .dwattr $C$DW$346, DW_AT_name("PINMUX10")
    4242                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("PINMUX10")
    4243                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    4244                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4245                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4246                            .dwattr $C$DW$346, DW_AT_decl_line(0x69)
    4247                            .dwattr $C$DW$346, DW_AT_decl_column(0x15)
    4248                    
    4249                    $C$DW$347       .dwtag  DW_TAG_member
    4250                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$151)
    4251                            .dwattr $C$DW$347, DW_AT_name("PINMUX11")
    4252                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("PINMUX11")
    4253                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    4254                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4255                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4256                            .dwattr $C$DW$347, DW_AT_decl_line(0x6a)
    4257                            .dwattr $C$DW$347, DW_AT_decl_column(0x15)
    4258                    
    4259                    $C$DW$348       .dwtag  DW_TAG_member
    4260                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$151)
    4261                            .dwattr $C$DW$348, DW_AT_name("PINMUX12")
    4262                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("PINMUX12")
    4263                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    4264                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4265                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4266                            .dwattr $C$DW$348, DW_AT_decl_line(0x6b)
    4267                            .dwattr $C$DW$348, DW_AT_decl_column(0x15)
    4268                    
    4269                    $C$DW$349       .dwtag  DW_TAG_member
    4270                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$151)
    4271                            .dwattr $C$DW$349, DW_AT_name("PINMUX13")
    4272                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("PINMUX13")
    4273                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    4274                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4275                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4276                            .dwattr $C$DW$349, DW_AT_decl_line(0x6c)
    4277                            .dwattr $C$DW$349, DW_AT_decl_column(0x15)
    4278                    
    4279                    $C$DW$350       .dwtag  DW_TAG_member
    4280                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$151)
    4281                            .dwattr $C$DW$350, DW_AT_name("PINMUX14")
    4282                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("PINMUX14")
    4283                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    4284                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4285                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4286                            .dwattr $C$DW$350, DW_AT_decl_line(0x6d)
    4287                            .dwattr $C$DW$350, DW_AT_decl_column(0x15)
    4288                    
    4289                    $C$DW$351       .dwtag  DW_TAG_member
    4290                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$151)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   79

    4291                            .dwattr $C$DW$351, DW_AT_name("PINMUX15")
    4292                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("PINMUX15")
    4293                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    4294                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4295                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4296                            .dwattr $C$DW$351, DW_AT_decl_line(0x6e)
    4297                            .dwattr $C$DW$351, DW_AT_decl_column(0x15)
    4298                    
    4299                    $C$DW$352       .dwtag  DW_TAG_member
    4300                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$151)
    4301                            .dwattr $C$DW$352, DW_AT_name("PINMUX16")
    4302                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("PINMUX16")
    4303                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    4304                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4305                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4306                            .dwattr $C$DW$352, DW_AT_decl_line(0x6f)
    4307                            .dwattr $C$DW$352, DW_AT_decl_column(0x15)
    4308                    
    4309                    $C$DW$353       .dwtag  DW_TAG_member
    4310                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$151)
    4311                            .dwattr $C$DW$353, DW_AT_name("PINMUX17")
    4312                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("PINMUX17")
    4313                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4314                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4315                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4316                            .dwattr $C$DW$353, DW_AT_decl_line(0x70)
    4317                            .dwattr $C$DW$353, DW_AT_decl_column(0x15)
    4318                    
    4319                    $C$DW$354       .dwtag  DW_TAG_member
    4320                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$151)
    4321                            .dwattr $C$DW$354, DW_AT_name("PINMUX18")
    4322                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("PINMUX18")
    4323                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    4324                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4325                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4326                            .dwattr $C$DW$354, DW_AT_decl_line(0x71)
    4327                            .dwattr $C$DW$354, DW_AT_decl_column(0x15)
    4328                    
    4329                    $C$DW$355       .dwtag  DW_TAG_member
    4330                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$151)
    4331                            .dwattr $C$DW$355, DW_AT_name("PINMUX19")
    4332                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("PINMUX19")
    4333                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    4334                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4335                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4336                            .dwattr $C$DW$355, DW_AT_decl_line(0x72)
    4337                            .dwattr $C$DW$355, DW_AT_decl_column(0x15)
    4338                    
    4339                    $C$DW$356       .dwtag  DW_TAG_member
    4340                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$151)
    4341                            .dwattr $C$DW$356, DW_AT_name("SUSPSRC")
    4342                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("SUSPSRC")
    4343                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    4344                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4345                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   80

    4346                            .dwattr $C$DW$356, DW_AT_decl_line(0x73)
    4347                            .dwattr $C$DW$356, DW_AT_decl_column(0x15)
    4348                    
    4349                    $C$DW$357       .dwtag  DW_TAG_member
    4350                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$151)
    4351                            .dwattr $C$DW$357, DW_AT_name("CHIPSIG")
    4352                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("CHIPSIG")
    4353                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    4354                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4355                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4356                            .dwattr $C$DW$357, DW_AT_decl_line(0x74)
    4357                            .dwattr $C$DW$357, DW_AT_decl_column(0x15)
    4358                    
    4359                    $C$DW$358       .dwtag  DW_TAG_member
    4360                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$151)
    4361                            .dwattr $C$DW$358, DW_AT_name("CHIPSIG_CLR")
    4362                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    4363                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    4364                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4365                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4366                            .dwattr $C$DW$358, DW_AT_decl_line(0x75)
    4367                            .dwattr $C$DW$358, DW_AT_decl_column(0x15)
    4368                    
    4369                    $C$DW$359       .dwtag  DW_TAG_member
    4370                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$151)
    4371                            .dwattr $C$DW$359, DW_AT_name("CFGCHIP0")
    4372                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("CFGCHIP0")
    4373                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    4374                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4375                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4376                            .dwattr $C$DW$359, DW_AT_decl_line(0x76)
    4377                            .dwattr $C$DW$359, DW_AT_decl_column(0x15)
    4378                    
    4379                    $C$DW$360       .dwtag  DW_TAG_member
    4380                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$151)
    4381                            .dwattr $C$DW$360, DW_AT_name("CFGCHIP1")
    4382                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("CFGCHIP1")
    4383                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    4384                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4385                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4386                            .dwattr $C$DW$360, DW_AT_decl_line(0x77)
    4387                            .dwattr $C$DW$360, DW_AT_decl_column(0x15)
    4388                    
    4389                    $C$DW$361       .dwtag  DW_TAG_member
    4390                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$151)
    4391                            .dwattr $C$DW$361, DW_AT_name("CFGCHIP2")
    4392                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("CFGCHIP2")
    4393                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    4394                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4395                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4396                            .dwattr $C$DW$361, DW_AT_decl_line(0x78)
    4397                            .dwattr $C$DW$361, DW_AT_decl_column(0x15)
    4398                    
    4399                    $C$DW$362       .dwtag  DW_TAG_member
    4400                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$151)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   81

    4401                            .dwattr $C$DW$362, DW_AT_name("CFGCHIP3")
    4402                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("CFGCHIP3")
    4403                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    4404                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4405                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4406                            .dwattr $C$DW$362, DW_AT_decl_line(0x79)
    4407                            .dwattr $C$DW$362, DW_AT_decl_column(0x15)
    4408                    
    4409                    $C$DW$363       .dwtag  DW_TAG_member
    4410                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$151)
    4411                            .dwattr $C$DW$363, DW_AT_name("CFGCHIP4")
    4412                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("CFGCHIP4")
    4413                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    4414                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4415                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4416                            .dwattr $C$DW$363, DW_AT_decl_line(0x7a)
    4417                            .dwattr $C$DW$363, DW_AT_decl_column(0x15)
    4418                    
    4419                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4420                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x42)
    4421                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x11)
    4422                            .dwendtag $C$DW$T$161
    4423                    
    4424                    $C$DW$T$637     .dwtag  DW_TAG_typedef
    4425                            .dwattr $C$DW$T$637, DW_AT_name("CSL_SyscfgRegs")
    4426                            .dwattr $C$DW$T$637, DW_AT_type(*$C$DW$T$161)
    4427                            .dwattr $C$DW$T$637, DW_AT_language(DW_LANG_C)
    4428                            .dwattr $C$DW$T$637, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4429                            .dwattr $C$DW$T$637, DW_AT_decl_line(0x7b)
    4430                            .dwattr $C$DW$T$637, DW_AT_decl_column(0x03)
    4431                    
    4432                    $C$DW$T$638     .dwtag  DW_TAG_volatile_type
    4433                            .dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$637)
    4434                    
    4435                    $C$DW$T$639     .dwtag  DW_TAG_pointer_type
    4436                            .dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$638)
    4437                            .dwattr $C$DW$T$639, DW_AT_address_class(0x20)
    4438                    
    4439                    $C$DW$T$640     .dwtag  DW_TAG_typedef
    4440                            .dwattr $C$DW$T$640, DW_AT_name("CSL_SyscfgRegsOvly")
    4441                            .dwattr $C$DW$T$640, DW_AT_type(*$C$DW$T$639)
    4442                            .dwattr $C$DW$T$640, DW_AT_language(DW_LANG_C)
    4443                            .dwattr $C$DW$T$640, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4444                            .dwattr $C$DW$T$640, DW_AT_decl_line(0x80)
    4445                            .dwattr $C$DW$T$640, DW_AT_decl_column(0x2e)
    4446                    
    4447                    $C$DW$T$641     .dwtag  DW_TAG_const_type
    4448                            .dwattr $C$DW$T$641, DW_AT_type(*$C$DW$T$640)
    4449                    
    4450                    
    4451                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    4452                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x08)
    4453                    $C$DW$364       .dwtag  DW_TAG_member
    4454                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$10)
    4455                            .dwattr $C$DW$364, DW_AT_name("length")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   82

    4456                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("length")
    4457                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4459                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4460                            .dwattr $C$DW$364, DW_AT_decl_line(0x14d)
    4461                            .dwattr $C$DW$364, DW_AT_decl_column(0x16)
    4462                    
    4463                    $C$DW$365       .dwtag  DW_TAG_member
    4464                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$164)
    4465                            .dwattr $C$DW$365, DW_AT_name("elem")
    4466                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("elem")
    4467                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4468                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4469                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4470                            .dwattr $C$DW$365, DW_AT_decl_line(0x14d)
    4471                            .dwattr $C$DW$365, DW_AT_decl_column(0x40)
    4472                    
    4473                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4474                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x14d)
    4475                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x10)
    4476                            .dwendtag $C$DW$T$165
    4477                    
    4478                    $C$DW$T$642     .dwtag  DW_TAG_typedef
    4479                            .dwattr $C$DW$T$642, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    4480                            .dwattr $C$DW$T$642, DW_AT_type(*$C$DW$T$165)
    4481                            .dwattr $C$DW$T$642, DW_AT_language(DW_LANG_C)
    4482                            .dwattr $C$DW$T$642, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4483                            .dwattr $C$DW$T$642, DW_AT_decl_line(0x14d)
    4484                            .dwattr $C$DW$T$642, DW_AT_decl_column(0x48)
    4485                    
    4486                    $C$DW$T$643     .dwtag  DW_TAG_typedef
    4487                            .dwattr $C$DW$T$643, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    4488                            .dwattr $C$DW$T$643, DW_AT_type(*$C$DW$T$642)
    4489                            .dwattr $C$DW$T$643, DW_AT_language(DW_LANG_C)
    4490                            .dwattr $C$DW$T$643, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4491                            .dwattr $C$DW$T$643, DW_AT_decl_line(0x14f)
    4492                            .dwattr $C$DW$T$643, DW_AT_decl_column(0x2b)
    4493                    
    4494                    
    4495                    $C$DW$T$166     .dwtag  DW_TAG_structure_type
    4496                            .dwattr $C$DW$T$166, DW_AT_byte_size(0x08)
    4497                    $C$DW$366       .dwtag  DW_TAG_member
    4498                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$10)
    4499                            .dwattr $C$DW$366, DW_AT_name("length")
    4500                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("length")
    4501                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4502                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4503                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4504                            .dwattr $C$DW$366, DW_AT_decl_line(0x14e)
    4505                            .dwattr $C$DW$366, DW_AT_decl_column(0x16)
    4506                    
    4507                    $C$DW$367       .dwtag  DW_TAG_member
    4508                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$164)
    4509                            .dwattr $C$DW$367, DW_AT_name("elem")
    4510                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("elem")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   83

    4511                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4512                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4513                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4514                            .dwattr $C$DW$367, DW_AT_decl_line(0x14e)
    4515                            .dwattr $C$DW$367, DW_AT_decl_column(0x40)
    4516                    
    4517                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4518                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x14e)
    4519                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x10)
    4520                            .dwendtag $C$DW$T$166
    4521                    
    4522                    $C$DW$T$644     .dwtag  DW_TAG_typedef
    4523                            .dwattr $C$DW$T$644, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    4524                            .dwattr $C$DW$T$644, DW_AT_type(*$C$DW$T$166)
    4525                            .dwattr $C$DW$T$644, DW_AT_language(DW_LANG_C)
    4526                            .dwattr $C$DW$T$644, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4527                            .dwattr $C$DW$T$644, DW_AT_decl_line(0x14e)
    4528                            .dwattr $C$DW$T$644, DW_AT_decl_column(0x48)
    4529                    
    4530                    $C$DW$T$645     .dwtag  DW_TAG_typedef
    4531                            .dwattr $C$DW$T$645, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    4532                            .dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$644)
    4533                            .dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)
    4534                            .dwattr $C$DW$T$645, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Swi.h")
    4535                            .dwattr $C$DW$T$645, DW_AT_decl_line(0x150)
    4536                            .dwattr $C$DW$T$645, DW_AT_decl_column(0x2c)
    4537                    
    4538                    
    4539                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    4540                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x08)
    4541                    $C$DW$368       .dwtag  DW_TAG_member
    4542                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$10)
    4543                            .dwattr $C$DW$368, DW_AT_name("length")
    4544                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("length")
    4545                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4546                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4547                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4548                            .dwattr $C$DW$368, DW_AT_decl_line(0x29b)
    4549                            .dwattr $C$DW$368, DW_AT_decl_column(0x16)
    4550                    
    4551                    $C$DW$369       .dwtag  DW_TAG_member
    4552                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$169)
    4553                            .dwattr $C$DW$369, DW_AT_name("elem")
    4554                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("elem")
    4555                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4556                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4557                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4558                            .dwattr $C$DW$369, DW_AT_decl_line(0x29b)
    4559                            .dwattr $C$DW$369, DW_AT_decl_column(0x41)
    4560                    
    4561                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4562                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x29b)
    4563                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x10)
    4564                            .dwendtag $C$DW$T$170
    4565                    
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   84

    4566                    $C$DW$T$646     .dwtag  DW_TAG_typedef
    4567                            .dwattr $C$DW$T$646, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
    4568                            .dwattr $C$DW$T$646, DW_AT_type(*$C$DW$T$170)
    4569                            .dwattr $C$DW$T$646, DW_AT_language(DW_LANG_C)
    4570                            .dwattr $C$DW$T$646, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4571                            .dwattr $C$DW$T$646, DW_AT_decl_line(0x29b)
    4572                            .dwattr $C$DW$T$646, DW_AT_decl_column(0x49)
    4573                    
    4574                    $C$DW$T$647     .dwtag  DW_TAG_typedef
    4575                            .dwattr $C$DW$T$647, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
    4576                            .dwattr $C$DW$T$647, DW_AT_type(*$C$DW$T$646)
    4577                            .dwattr $C$DW$T$647, DW_AT_language(DW_LANG_C)
    4578                            .dwattr $C$DW$T$647, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4579                            .dwattr $C$DW$T$647, DW_AT_decl_line(0x29d)
    4580                            .dwattr $C$DW$T$647, DW_AT_decl_column(0x2c)
    4581                    
    4582                    
    4583                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    4584                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x08)
    4585                    $C$DW$370       .dwtag  DW_TAG_member
    4586                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$10)
    4587                            .dwattr $C$DW$370, DW_AT_name("length")
    4588                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("length")
    4589                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4590                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4591                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4592                            .dwattr $C$DW$370, DW_AT_decl_line(0x29c)
    4593                            .dwattr $C$DW$370, DW_AT_decl_column(0x16)
    4594                    
    4595                    $C$DW$371       .dwtag  DW_TAG_member
    4596                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$169)
    4597                            .dwattr $C$DW$371, DW_AT_name("elem")
    4598                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("elem")
    4599                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4600                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4601                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4602                            .dwattr $C$DW$371, DW_AT_decl_line(0x29c)
    4603                            .dwattr $C$DW$371, DW_AT_decl_column(0x41)
    4604                    
    4605                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4606                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x29c)
    4607                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x10)
    4608                            .dwendtag $C$DW$T$171
    4609                    
    4610                    $C$DW$T$648     .dwtag  DW_TAG_typedef
    4611                            .dwattr $C$DW$T$648, DW_AT_name("__CARRAY1_ti_sysbios_knl_Task_hooks")
    4612                            .dwattr $C$DW$T$648, DW_AT_type(*$C$DW$T$171)
    4613                            .dwattr $C$DW$T$648, DW_AT_language(DW_LANG_C)
    4614                            .dwattr $C$DW$T$648, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4615                            .dwattr $C$DW$T$648, DW_AT_decl_line(0x29c)
    4616                            .dwattr $C$DW$T$648, DW_AT_decl_column(0x49)
    4617                    
    4618                    $C$DW$T$649     .dwtag  DW_TAG_typedef
    4619                            .dwattr $C$DW$T$649, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
    4620                            .dwattr $C$DW$T$649, DW_AT_type(*$C$DW$T$648)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   85

    4621                            .dwattr $C$DW$T$649, DW_AT_language(DW_LANG_C)
    4622                            .dwattr $C$DW$T$649, DW_AT_decl_file("C:/ti/bios_6_50_00_10/packages/ti/sysbios/knl/Task.h")
    4623                            .dwattr $C$DW$T$649, DW_AT_decl_line(0x29e)
    4624                            .dwattr $C$DW$T$649, DW_AT_decl_column(0x2d)
    4625                    
    4626                    
    4627                    $C$DW$T$180     .dwtag  DW_TAG_structure_type
    4628                            .dwattr $C$DW$T$180, DW_AT_byte_size(0xa80)
    4629                    $C$DW$372       .dwtag  DW_TAG_member
    4630                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$151)
    4631                            .dwattr $C$DW$372, DW_AT_name("REVID")
    4632                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("REVID")
    4633                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4634                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4635                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4636                            .dwattr $C$DW$372, DW_AT_decl_line(0x7b)
    4637                            .dwattr $C$DW$372, DW_AT_decl_column(0x15)
    4638                    
    4639                    $C$DW$373       .dwtag  DW_TAG_member
    4640                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$160)
    4641                            .dwattr $C$DW$373, DW_AT_name("RSVD0")
    4642                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("RSVD0")
    4643                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4644                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4645                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4646                            .dwattr $C$DW$373, DW_AT_decl_line(0x7c)
    4647                            .dwattr $C$DW$373, DW_AT_decl_column(0x14)
    4648                    
    4649                    $C$DW$374       .dwtag  DW_TAG_member
    4650                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$151)
    4651                            .dwattr $C$DW$374, DW_AT_name("INTEVAL")
    4652                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("INTEVAL")
    4653                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4654                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4655                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4656                            .dwattr $C$DW$374, DW_AT_decl_line(0x7d)
    4657                            .dwattr $C$DW$374, DW_AT_decl_column(0x15)
    4658                    
    4659                    $C$DW$375       .dwtag  DW_TAG_member
    4660                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$172)
    4661                            .dwattr $C$DW$375, DW_AT_name("RSVD1")
    4662                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("RSVD1")
    4663                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4664                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4665                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4666                            .dwattr $C$DW$375, DW_AT_decl_line(0x7e)
    4667                            .dwattr $C$DW$375, DW_AT_decl_column(0x14)
    4668                    
    4669                    $C$DW$376       .dwtag  DW_TAG_member
    4670                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$151)
    4671                            .dwattr $C$DW$376, DW_AT_name("MERRPR0")
    4672                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("MERRPR0")
    4673                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4674                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4675                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   86

    4676                            .dwattr $C$DW$376, DW_AT_decl_line(0x7f)
    4677                            .dwattr $C$DW$376, DW_AT_decl_column(0x15)
    4678                    
    4679                    $C$DW$377       .dwtag  DW_TAG_member
    4680                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$173)
    4681                            .dwattr $C$DW$377, DW_AT_name("RSVD2")
    4682                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("RSVD2")
    4683                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4684                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4685                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4686                            .dwattr $C$DW$377, DW_AT_decl_line(0x80)
    4687                            .dwattr $C$DW$377, DW_AT_decl_column(0x14)
    4688                    
    4689                    $C$DW$378       .dwtag  DW_TAG_member
    4690                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$151)
    4691                            .dwattr $C$DW$378, DW_AT_name("MERRCR0")
    4692                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("MERRCR0")
    4693                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4694                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4695                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4696                            .dwattr $C$DW$378, DW_AT_decl_line(0x81)
    4697                            .dwattr $C$DW$378, DW_AT_decl_column(0x15)
    4698                    
    4699                    $C$DW$379       .dwtag  DW_TAG_member
    4700                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$173)
    4701                            .dwattr $C$DW$379, DW_AT_name("RSVD3")
    4702                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("RSVD3")
    4703                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4704                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4705                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4706                            .dwattr $C$DW$379, DW_AT_decl_line(0x82)
    4707                            .dwattr $C$DW$379, DW_AT_decl_column(0x14)
    4708                    
    4709                    $C$DW$380       .dwtag  DW_TAG_member
    4710                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$151)
    4711                            .dwattr $C$DW$380, DW_AT_name("PERRPR")
    4712                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("PERRPR")
    4713                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4714                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4715                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4716                            .dwattr $C$DW$380, DW_AT_decl_line(0x83)
    4717                            .dwattr $C$DW$380, DW_AT_decl_column(0x15)
    4718                    
    4719                    $C$DW$381       .dwtag  DW_TAG_member
    4720                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$157)
    4721                            .dwattr $C$DW$381, DW_AT_name("RSVD4")
    4722                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("RSVD4")
    4723                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4724                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4725                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4726                            .dwattr $C$DW$381, DW_AT_decl_line(0x84)
    4727                            .dwattr $C$DW$381, DW_AT_decl_column(0x14)
    4728                    
    4729                    $C$DW$382       .dwtag  DW_TAG_member
    4730                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$151)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   87

    4731                            .dwattr $C$DW$382, DW_AT_name("PERRCR")
    4732                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("PERRCR")
    4733                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4734                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4735                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4736                            .dwattr $C$DW$382, DW_AT_decl_line(0x85)
    4737                            .dwattr $C$DW$382, DW_AT_decl_column(0x15)
    4738                    
    4739                    $C$DW$383       .dwtag  DW_TAG_member
    4740                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$174)
    4741                            .dwattr $C$DW$383, DW_AT_name("RSVD5")
    4742                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("RSVD5")
    4743                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4744                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4745                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4746                            .dwattr $C$DW$383, DW_AT_decl_line(0x86)
    4747                            .dwattr $C$DW$383, DW_AT_decl_column(0x14)
    4748                    
    4749                    $C$DW$384       .dwtag  DW_TAG_member
    4750                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$151)
    4751                            .dwattr $C$DW$384, DW_AT_name("PTCMD")
    4752                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("PTCMD")
    4753                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    4754                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4755                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4756                            .dwattr $C$DW$384, DW_AT_decl_line(0x87)
    4757                            .dwattr $C$DW$384, DW_AT_decl_column(0x15)
    4758                    
    4759                    $C$DW$385       .dwtag  DW_TAG_member
    4760                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$157)
    4761                            .dwattr $C$DW$385, DW_AT_name("RSVD6")
    4762                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("RSVD6")
    4763                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4764                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4765                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4766                            .dwattr $C$DW$385, DW_AT_decl_line(0x88)
    4767                            .dwattr $C$DW$385, DW_AT_decl_column(0x14)
    4768                    
    4769                    $C$DW$386       .dwtag  DW_TAG_member
    4770                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$151)
    4771                            .dwattr $C$DW$386, DW_AT_name("PTSTAT")
    4772                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("PTSTAT")
    4773                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    4774                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4775                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4776                            .dwattr $C$DW$386, DW_AT_decl_line(0x89)
    4777                            .dwattr $C$DW$386, DW_AT_decl_column(0x15)
    4778                    
    4779                    $C$DW$387       .dwtag  DW_TAG_member
    4780                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$175)
    4781                            .dwattr $C$DW$387, DW_AT_name("RSVD7")
    4782                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("RSVD7")
    4783                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    4784                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4785                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   88

    4786                            .dwattr $C$DW$387, DW_AT_decl_line(0x8a)
    4787                            .dwattr $C$DW$387, DW_AT_decl_column(0x14)
    4788                    
    4789                    $C$DW$388       .dwtag  DW_TAG_member
    4790                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$151)
    4791                            .dwattr $C$DW$388, DW_AT_name("PDSTAT0")
    4792                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("PDSTAT0")
    4793                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    4794                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4795                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4796                            .dwattr $C$DW$388, DW_AT_decl_line(0x8b)
    4797                            .dwattr $C$DW$388, DW_AT_decl_column(0x15)
    4798                    
    4799                    $C$DW$389       .dwtag  DW_TAG_member
    4800                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$151)
    4801                            .dwattr $C$DW$389, DW_AT_name("PDSTAT1")
    4802                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("PDSTAT1")
    4803                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
    4804                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4805                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4806                            .dwattr $C$DW$389, DW_AT_decl_line(0x8c)
    4807                            .dwattr $C$DW$389, DW_AT_decl_column(0x15)
    4808                    
    4809                    $C$DW$390       .dwtag  DW_TAG_member
    4810                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$176)
    4811                            .dwattr $C$DW$390, DW_AT_name("RSVD8")
    4812                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("RSVD8")
    4813                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    4814                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4815                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4816                            .dwattr $C$DW$390, DW_AT_decl_line(0x8d)
    4817                            .dwattr $C$DW$390, DW_AT_decl_column(0x14)
    4818                    
    4819                    $C$DW$391       .dwtag  DW_TAG_member
    4820                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$151)
    4821                            .dwattr $C$DW$391, DW_AT_name("PDCTL0")
    4822                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("PDCTL0")
    4823                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    4824                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4825                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4826                            .dwattr $C$DW$391, DW_AT_decl_line(0x8e)
    4827                            .dwattr $C$DW$391, DW_AT_decl_column(0x15)
    4828                    
    4829                    $C$DW$392       .dwtag  DW_TAG_member
    4830                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$151)
    4831                            .dwattr $C$DW$392, DW_AT_name("PDCTL1")
    4832                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("PDCTL1")
    4833                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
    4834                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4835                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4836                            .dwattr $C$DW$392, DW_AT_decl_line(0x8f)
    4837                            .dwattr $C$DW$392, DW_AT_decl_column(0x15)
    4838                    
    4839                    $C$DW$393       .dwtag  DW_TAG_member
    4840                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$176)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   89

    4841                            .dwattr $C$DW$393, DW_AT_name("RSVD9")
    4842                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("RSVD9")
    4843                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
    4844                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4845                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4846                            .dwattr $C$DW$393, DW_AT_decl_line(0x90)
    4847                            .dwattr $C$DW$393, DW_AT_decl_column(0x14)
    4848                    
    4849                    $C$DW$394       .dwtag  DW_TAG_member
    4850                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$151)
    4851                            .dwattr $C$DW$394, DW_AT_name("PDCFG0")
    4852                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("PDCFG0")
    4853                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
    4854                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4855                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4856                            .dwattr $C$DW$394, DW_AT_decl_line(0x91)
    4857                            .dwattr $C$DW$394, DW_AT_decl_column(0x15)
    4858                    
    4859                    $C$DW$395       .dwtag  DW_TAG_member
    4860                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$151)
    4861                            .dwattr $C$DW$395, DW_AT_name("PDCFG1")
    4862                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("PDCFG1")
    4863                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    4864                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4865                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4866                            .dwattr $C$DW$395, DW_AT_decl_line(0x92)
    4867                            .dwattr $C$DW$395, DW_AT_decl_column(0x15)
    4868                    
    4869                    $C$DW$396       .dwtag  DW_TAG_member
    4870                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$177)
    4871                            .dwattr $C$DW$396, DW_AT_name("RSVD10")
    4872                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("RSVD10")
    4873                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    4874                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4875                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4876                            .dwattr $C$DW$396, DW_AT_decl_line(0x93)
    4877                            .dwattr $C$DW$396, DW_AT_decl_column(0x14)
    4878                    
    4879                    $C$DW$397       .dwtag  DW_TAG_member
    4880                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$178)
    4881                            .dwattr $C$DW$397, DW_AT_name("MDSTAT")
    4882                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("MDSTAT")
    4883                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
    4884                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4885                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4886                            .dwattr $C$DW$397, DW_AT_decl_line(0x94)
    4887                            .dwattr $C$DW$397, DW_AT_decl_column(0x15)
    4888                    
    4889                    $C$DW$398       .dwtag  DW_TAG_member
    4890                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$179)
    4891                            .dwattr $C$DW$398, DW_AT_name("RSVD11")
    4892                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("RSVD11")
    4893                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
    4894                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4895                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   90

    4896                            .dwattr $C$DW$398, DW_AT_decl_line(0x95)
    4897                            .dwattr $C$DW$398, DW_AT_decl_column(0x14)
    4898                    
    4899                    $C$DW$399       .dwtag  DW_TAG_member
    4900                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$178)
    4901                            .dwattr $C$DW$399, DW_AT_name("MDCTL")
    4902                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("MDCTL")
    4903                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
    4904                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4905                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_OMA
    4906                            .dwattr $C$DW$399, DW_AT_decl_line(0x96)
    4907                            .dwattr $C$DW$399, DW_AT_decl_column(0x15)
    4908                    
    4909                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    4910                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x7a)
    4911                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x11)
    4912                            .dwendtag $C$DW$T$180
    4913                    
    4914                    $C$DW$T$650     .dwtag  DW_TAG_typedef
    4915                            .dwattr $C$DW$T$650, DW_AT_name("CSL_PscRegs")
    4916                            .dwattr $C$DW$T$650, DW_AT_type(*$C$DW$T$180)
    4917                            .dwattr $C$DW$T$650, DW_AT_language(DW_LANG_C)
    4918                            .dwattr $C$DW$T$650, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    4919                            .dwattr $C$DW$T$650, DW_AT_decl_line(0x97)
    4920                            .dwattr $C$DW$T$650, DW_AT_decl_column(0x03)
    4921                    
    4922                    $C$DW$T$651     .dwtag  DW_TAG_volatile_type
    4923                            .dwattr $C$DW$T$651, DW_AT_type(*$C$DW$T$650)
    4924                    
    4925                    $C$DW$T$652     .dwtag  DW_TAG_pointer_type
    4926                            .dwattr $C$DW$T$652, DW_AT_type(*$C$DW$T$651)
    4927                            .dwattr $C$DW$T$652, DW_AT_address_class(0x20)
    4928                    
    4929                    $C$DW$T$653     .dwtag  DW_TAG_typedef
    4930                            .dwattr $C$DW$T$653, DW_AT_name("CSL_PscRegsOvly")
    4931                            .dwattr $C$DW$T$653, DW_AT_type(*$C$DW$T$652)
    4932                            .dwattr $C$DW$T$653, DW_AT_language(DW_LANG_C)
    4933                            .dwattr $C$DW$T$653, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_O
    4934                            .dwattr $C$DW$T$653, DW_AT_decl_line(0x9d)
    4935                            .dwattr $C$DW$T$653, DW_AT_decl_column(0x2b)
    4936                    
    4937                    
    4938                    $C$DW$T$185     .dwtag  DW_TAG_structure_type
    4939                            .dwattr $C$DW$T$185, DW_AT_byte_size(0x04)
    4940                    $C$DW$400       .dwtag  DW_TAG_member
    4941                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$184)
    4942                            .dwattr $C$DW$400, DW_AT_name("X")
    4943                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("X")
    4944                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4946                            .dwattr $C$DW$400, DW_AT_decl_file("C:/Users/Raz Aloni/OneDrive/School/EEL4924/DSP/C_Libs/MicC
    4947                            .dwattr $C$DW$400, DW_AT_decl_line(0x35)
    4948                            .dwattr $C$DW$400, DW_AT_decl_column(0x0c)
    4949                    
    4950                    $C$DW$401       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 05:51:03 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
LCD.asm                                                              PAGE   91

