TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Thu Apr 20 04:41:31 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    1843                            .dwattr $C$DW$141, DW_AT_name("HW_PSC_SCRF0_SS")
    1844                            .dwattr $C$DW$141, DW_AT_const_value(0x18)
    1845                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1846                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    1847                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    1848                    
    1849                    $C$DW$142       .dwtag  DW_TAG_enumerator
    1850                            .dwattr $C$DW$142, DW_AT_name("HW_PSC_SCRF1_SS")
    1851                            .dwattr $C$DW$142, DW_AT_const_value(0x19)
    1852                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1853                            .dwattr $C$DW$142, DW_AT_decl_line(0x66)
    1854                            .dwattr $C$DW$142, DW_AT_decl_column(0x05)
    1855                    
    1856                    $C$DW$143       .dwtag  DW_TAG_enumerator
    1857                            .dwattr $C$DW$143, DW_AT_name("HW_PSC_SCRF2_SS")
    1858                            .dwattr $C$DW$143, DW_AT_const_value(0x1a)
    1859                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1860                            .dwattr $C$DW$143, DW_AT_decl_line(0x67)
    1861                            .dwattr $C$DW$143, DW_AT_decl_column(0x05)
    1862                    
    1863                    $C$DW$144       .dwtag  DW_TAG_enumerator
    1864                            .dwattr $C$DW$144, DW_AT_name("HW_PSC_SCRF6_SS")
    1865                            .dwattr $C$DW$144, DW_AT_const_value(0x1b)
    1866                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1867                            .dwattr $C$DW$144, DW_AT_decl_line(0x68)
    1868                            .dwattr $C$DW$144, DW_AT_decl_column(0x05)
    1869                    
    1870                    $C$DW$145       .dwtag  DW_TAG_enumerator
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   35

    1871                            .dwattr $C$DW$145, DW_AT_name("HW_PSC_SCRF7_SS")
    1872                            .dwattr $C$DW$145, DW_AT_const_value(0x1c)
    1873                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1874                            .dwattr $C$DW$145, DW_AT_decl_line(0x69)
    1875                            .dwattr $C$DW$145, DW_AT_decl_column(0x05)
    1876                    
    1877                    $C$DW$146       .dwtag  DW_TAG_enumerator
    1878                            .dwattr $C$DW$146, DW_AT_name("HW_PSC_SCRF8_SS")
    1879                            .dwattr $C$DW$146, DW_AT_const_value(0x1d)
    1880                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1881                            .dwattr $C$DW$146, DW_AT_decl_line(0x6a)
    1882                            .dwattr $C$DW$146, DW_AT_decl_column(0x05)
    1883                    
    1884                    $C$DW$147       .dwtag  DW_TAG_enumerator
    1885                            .dwattr $C$DW$147, DW_AT_name("HW_PSC_BR_F7")
    1886                            .dwattr $C$DW$147, DW_AT_const_value(0x1e)
    1887                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1888                            .dwattr $C$DW$147, DW_AT_decl_line(0x6b)
    1889                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    1890                    
    1891                    $C$DW$148       .dwtag  DW_TAG_enumerator
    1892                            .dwattr $C$DW$148, DW_AT_name("HW_PSC_SHRAM")
    1893                            .dwattr $C$DW$148, DW_AT_const_value(0x1f)
    1894                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    1895                            .dwattr $C$DW$148, DW_AT_decl_line(0x6c)
    1896                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    1897                    
    1898                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C
    1899                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x4e)
    1900                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x0e)
    1901                            .dwendtag $C$DW$T$65
    1902                    
    1903                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    1904                            .dwattr $C$DW$T$66, DW_AT_name("Psc1Peripheral")
    1905                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1906                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1907                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C
    1908                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x6d)
    1909                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    1910                    
    1911                    
    1912                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1913                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x190)
    1914                    $C$DW$149       .dwtag  DW_TAG_member
    1915                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$23)
    1916                            .dwattr $C$DW$149, DW_AT_name("REVID")
    1917                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("REVID")
    1918                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1920                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1921                            .dwattr $C$DW$149, DW_AT_decl_line(0x41)
    1922                            .dwattr $C$DW$149, DW_AT_decl_column(0x15)
    1923                    
    1924                    $C$DW$150       .dwtag  DW_TAG_member
    1925                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   36

    1926                            .dwattr $C$DW$150, DW_AT_name("RSVD0")
    1927                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("RSVD0")
    1928                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1929                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1930                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1931                            .dwattr $C$DW$150, DW_AT_decl_line(0x42)
    1932                            .dwattr $C$DW$150, DW_AT_decl_column(0x14)
    1933                    
    1934                    $C$DW$151       .dwtag  DW_TAG_member
    1935                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    1936                            .dwattr $C$DW$151, DW_AT_name("DIEIDR0")
    1937                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("DIEIDR0")
    1938                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1939                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1940                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1941                            .dwattr $C$DW$151, DW_AT_decl_line(0x43)
    1942                            .dwattr $C$DW$151, DW_AT_decl_column(0x15)
    1943                    
    1944                    $C$DW$152       .dwtag  DW_TAG_member
    1945                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$23)
    1946                            .dwattr $C$DW$152, DW_AT_name("DIEIDR1")
    1947                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("DIEIDR1")
    1948                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1949                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1950                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1951                            .dwattr $C$DW$152, DW_AT_decl_line(0x44)
    1952                            .dwattr $C$DW$152, DW_AT_decl_column(0x15)
    1953                    
    1954                    $C$DW$153       .dwtag  DW_TAG_member
    1955                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
    1956                            .dwattr $C$DW$153, DW_AT_name("DIEIDR2")
    1957                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("DIEIDR2")
    1958                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1959                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1960                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1961                            .dwattr $C$DW$153, DW_AT_decl_line(0x45)
    1962                            .dwattr $C$DW$153, DW_AT_decl_column(0x15)
    1963                    
    1964                    $C$DW$154       .dwtag  DW_TAG_member
    1965                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    1966                            .dwattr $C$DW$154, DW_AT_name("DIEIDR3")
    1967                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("DIEIDR3")
    1968                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1969                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1970                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1971                            .dwattr $C$DW$154, DW_AT_decl_line(0x46)
    1972                            .dwattr $C$DW$154, DW_AT_decl_column(0x15)
    1973                    
    1974                    $C$DW$155       .dwtag  DW_TAG_member
    1975                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    1976                            .dwattr $C$DW$155, DW_AT_name("DEVIDR0")
    1977                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("DEVIDR0")
    1978                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1979                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1980                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   37

    1981                            .dwattr $C$DW$155, DW_AT_decl_line(0x47)
    1982                            .dwattr $C$DW$155, DW_AT_decl_column(0x15)
    1983                    
    1984                    $C$DW$156       .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$29)
    1986                            .dwattr $C$DW$156, DW_AT_name("RSVD1")
    1987                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("RSVD1")
    1988                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1989                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    1991                            .dwattr $C$DW$156, DW_AT_decl_line(0x48)
    1992                            .dwattr $C$DW$156, DW_AT_decl_column(0x14)
    1993                    
    1994                    $C$DW$157       .dwtag  DW_TAG_member
    1995                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    1996                            .dwattr $C$DW$157, DW_AT_name("BOOTCFG")
    1997                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("BOOTCFG")
    1998                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1999                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2000                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2001                            .dwattr $C$DW$157, DW_AT_decl_line(0x49)
    2002                            .dwattr $C$DW$157, DW_AT_decl_column(0x15)
    2003                    
    2004                    $C$DW$158       .dwtag  DW_TAG_member
    2005                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    2006                            .dwattr $C$DW$158, DW_AT_name("CHIPREVIDR")
    2007                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("CHIPREVIDR")
    2008                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2009                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2010                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2011                            .dwattr $C$DW$158, DW_AT_decl_line(0x4a)
    2012                            .dwattr $C$DW$158, DW_AT_decl_column(0x15)
    2013                    
    2014                    $C$DW$159       .dwtag  DW_TAG_member
    2015                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$30)
    2016                            .dwattr $C$DW$159, DW_AT_name("RSVD2")
    2017                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("RSVD2")
    2018                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2019                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2020                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2021                            .dwattr $C$DW$159, DW_AT_decl_line(0x4b)
    2022                            .dwattr $C$DW$159, DW_AT_decl_column(0x14)
    2023                    
    2024                    $C$DW$160       .dwtag  DW_TAG_member
    2025                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    2026                            .dwattr $C$DW$160, DW_AT_name("KICK0R")
    2027                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("KICK0R")
    2028                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2029                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2030                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2031                            .dwattr $C$DW$160, DW_AT_decl_line(0x4c)
    2032                            .dwattr $C$DW$160, DW_AT_decl_column(0x15)
    2033                    
    2034                    $C$DW$161       .dwtag  DW_TAG_member
    2035                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$23)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   38

    2036                            .dwattr $C$DW$161, DW_AT_name("KICK1R")
    2037                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("KICK1R")
    2038                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2039                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2040                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2041                            .dwattr $C$DW$161, DW_AT_decl_line(0x4d)
    2042                            .dwattr $C$DW$161, DW_AT_decl_column(0x15)
    2043                    
    2044                    $C$DW$162       .dwtag  DW_TAG_member
    2045                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$29)
    2046                            .dwattr $C$DW$162, DW_AT_name("RSVD3")
    2047                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("RSVD3")
    2048                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2049                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2050                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2051                            .dwattr $C$DW$162, DW_AT_decl_line(0x4e)
    2052                            .dwattr $C$DW$162, DW_AT_decl_column(0x14)
    2053                    
    2054                    $C$DW$163       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    2056                            .dwattr $C$DW$163, DW_AT_name("HOST1CFG")
    2057                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("HOST1CFG")
    2058                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2059                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2060                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2061                            .dwattr $C$DW$163, DW_AT_decl_line(0x4f)
    2062                            .dwattr $C$DW$163, DW_AT_decl_column(0x15)
    2063                    
    2064                    $C$DW$164       .dwtag  DW_TAG_member
    2065                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    2066                            .dwattr $C$DW$164, DW_AT_name("RSVD4")
    2067                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("RSVD4")
    2068                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2069                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2071                            .dwattr $C$DW$164, DW_AT_decl_line(0x50)
    2072                            .dwattr $C$DW$164, DW_AT_decl_column(0x14)
    2073                    
    2074                    $C$DW$165       .dwtag  DW_TAG_member
    2075                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2076                            .dwattr $C$DW$165, DW_AT_name("IRAWSTAT")
    2077                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("IRAWSTAT")
    2078                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2079                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2080                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2081                            .dwattr $C$DW$165, DW_AT_decl_line(0x51)
    2082                            .dwattr $C$DW$165, DW_AT_decl_column(0x15)
    2083                    
    2084                    $C$DW$166       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    2086                            .dwattr $C$DW$166, DW_AT_name("IENSTAT")
    2087                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("IENSTAT")
    2088                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2089                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2090                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   39

    2091                            .dwattr $C$DW$166, DW_AT_decl_line(0x52)
    2092                            .dwattr $C$DW$166, DW_AT_decl_column(0x15)
    2093                    
    2094                    $C$DW$167       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2096                            .dwattr $C$DW$167, DW_AT_name("IENSET")
    2097                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("IENSET")
    2098                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2099                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2100                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2101                            .dwattr $C$DW$167, DW_AT_decl_line(0x53)
    2102                            .dwattr $C$DW$167, DW_AT_decl_column(0x15)
    2103                    
    2104                    $C$DW$168       .dwtag  DW_TAG_member
    2105                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    2106                            .dwattr $C$DW$168, DW_AT_name("IENCLR")
    2107                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("IENCLR")
    2108                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2109                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2110                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2111                            .dwattr $C$DW$168, DW_AT_decl_line(0x54)
    2112                            .dwattr $C$DW$168, DW_AT_decl_column(0x15)
    2113                    
    2114                    $C$DW$169       .dwtag  DW_TAG_member
    2115                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2116                            .dwattr $C$DW$169, DW_AT_name("EOI")
    2117                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("EOI")
    2118                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2119                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2121                            .dwattr $C$DW$169, DW_AT_decl_line(0x55)
    2122                            .dwattr $C$DW$169, DW_AT_decl_column(0x15)
    2123                    
    2124                    $C$DW$170       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    2126                            .dwattr $C$DW$170, DW_AT_name("FLTADDRR")
    2127                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("FLTADDRR")
    2128                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2129                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2131                            .dwattr $C$DW$170, DW_AT_decl_line(0x56)
    2132                            .dwattr $C$DW$170, DW_AT_decl_column(0x15)
    2133                    
    2134                    $C$DW$171       .dwtag  DW_TAG_member
    2135                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2136                            .dwattr $C$DW$171, DW_AT_name("FLTSTAT")
    2137                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("FLTSTAT")
    2138                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2139                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2141                            .dwattr $C$DW$171, DW_AT_decl_line(0x57)
    2142                            .dwattr $C$DW$171, DW_AT_decl_column(0x15)
    2143                    
    2144                    $C$DW$172       .dwtag  DW_TAG_member
    2145                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$32)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   40

    2146                            .dwattr $C$DW$172, DW_AT_name("RSVD5")
    2147                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("RSVD5")
    2148                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2149                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2150                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2151                            .dwattr $C$DW$172, DW_AT_decl_line(0x58)
    2152                            .dwattr $C$DW$172, DW_AT_decl_column(0x14)
    2153                    
    2154                    $C$DW$173       .dwtag  DW_TAG_member
    2155                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    2156                            .dwattr $C$DW$173, DW_AT_name("MSTPRI0")
    2157                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("MSTPRI0")
    2158                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2159                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2160                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2161                            .dwattr $C$DW$173, DW_AT_decl_line(0x59)
    2162                            .dwattr $C$DW$173, DW_AT_decl_column(0x15)
    2163                    
    2164                    $C$DW$174       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2166                            .dwattr $C$DW$174, DW_AT_name("MSTPRI1")
    2167                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("MSTPRI1")
    2168                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2169                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2170                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2171                            .dwattr $C$DW$174, DW_AT_decl_line(0x5a)
    2172                            .dwattr $C$DW$174, DW_AT_decl_column(0x15)
    2173                    
    2174                    $C$DW$175       .dwtag  DW_TAG_member
    2175                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2176                            .dwattr $C$DW$175, DW_AT_name("MSTPRI2")
    2177                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("MSTPRI2")
    2178                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2179                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2180                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2181                            .dwattr $C$DW$175, DW_AT_decl_line(0x5b)
    2182                            .dwattr $C$DW$175, DW_AT_decl_column(0x15)
    2183                    
    2184                    $C$DW$176       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$29)
    2186                            .dwattr $C$DW$176, DW_AT_name("RSVD6")
    2187                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("RSVD6")
    2188                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2189                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2191                            .dwattr $C$DW$176, DW_AT_decl_line(0x5c)
    2192                            .dwattr $C$DW$176, DW_AT_decl_column(0x14)
    2193                    
    2194                    $C$DW$177       .dwtag  DW_TAG_member
    2195                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2196                            .dwattr $C$DW$177, DW_AT_name("PINMUX0")
    2197                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("PINMUX0")
    2198                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2199                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2200                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   41

    2201                            .dwattr $C$DW$177, DW_AT_decl_line(0x5d)
    2202                            .dwattr $C$DW$177, DW_AT_decl_column(0x15)
    2203                    
    2204                    $C$DW$178       .dwtag  DW_TAG_member
    2205                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    2206                            .dwattr $C$DW$178, DW_AT_name("PINMUX1")
    2207                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("PINMUX1")
    2208                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2209                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2210                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2211                            .dwattr $C$DW$178, DW_AT_decl_line(0x5e)
    2212                            .dwattr $C$DW$178, DW_AT_decl_column(0x15)
    2213                    
    2214                    $C$DW$179       .dwtag  DW_TAG_member
    2215                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$23)
    2216                            .dwattr $C$DW$179, DW_AT_name("PINMUX2")
    2217                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("PINMUX2")
    2218                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2219                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2220                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2221                            .dwattr $C$DW$179, DW_AT_decl_line(0x5f)
    2222                            .dwattr $C$DW$179, DW_AT_decl_column(0x15)
    2223                    
    2224                    $C$DW$180       .dwtag  DW_TAG_member
    2225                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2226                            .dwattr $C$DW$180, DW_AT_name("PINMUX3")
    2227                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("PINMUX3")
    2228                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2229                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2230                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2231                            .dwattr $C$DW$180, DW_AT_decl_line(0x60)
    2232                            .dwattr $C$DW$180, DW_AT_decl_column(0x15)
    2233                    
    2234                    $C$DW$181       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
    2236                            .dwattr $C$DW$181, DW_AT_name("PINMUX4")
    2237                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("PINMUX4")
    2238                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    2239                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2241                            .dwattr $C$DW$181, DW_AT_decl_line(0x61)
    2242                            .dwattr $C$DW$181, DW_AT_decl_column(0x15)
    2243                    
    2244                    $C$DW$182       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$23)
    2246                            .dwattr $C$DW$182, DW_AT_name("PINMUX5")
    2247                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("PINMUX5")
    2248                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    2249                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2251                            .dwattr $C$DW$182, DW_AT_decl_line(0x62)
    2252                            .dwattr $C$DW$182, DW_AT_decl_column(0x15)
    2253                    
    2254                    $C$DW$183       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$23)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   42

    2256                            .dwattr $C$DW$183, DW_AT_name("PINMUX6")
    2257                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("PINMUX6")
    2258                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    2259                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2261                            .dwattr $C$DW$183, DW_AT_decl_line(0x63)
    2262                            .dwattr $C$DW$183, DW_AT_decl_column(0x15)
    2263                    
    2264                    $C$DW$184       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    2266                            .dwattr $C$DW$184, DW_AT_name("PINMUX7")
    2267                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("PINMUX7")
    2268                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    2269                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2271                            .dwattr $C$DW$184, DW_AT_decl_line(0x64)
    2272                            .dwattr $C$DW$184, DW_AT_decl_column(0x15)
    2273                    
    2274                    $C$DW$185       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    2276                            .dwattr $C$DW$185, DW_AT_name("PINMUX8")
    2277                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("PINMUX8")
    2278                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    2279                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2281                            .dwattr $C$DW$185, DW_AT_decl_line(0x65)
    2282                            .dwattr $C$DW$185, DW_AT_decl_column(0x15)
    2283                    
    2284                    $C$DW$186       .dwtag  DW_TAG_member
    2285                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
    2286                            .dwattr $C$DW$186, DW_AT_name("PINMUX9")
    2287                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("PINMUX9")
    2288                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    2289                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2290                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2291                            .dwattr $C$DW$186, DW_AT_decl_line(0x66)
    2292                            .dwattr $C$DW$186, DW_AT_decl_column(0x15)
    2293                    
    2294                    $C$DW$187       .dwtag  DW_TAG_member
    2295                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$23)
    2296                            .dwattr $C$DW$187, DW_AT_name("PINMUX10")
    2297                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("PINMUX10")
    2298                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    2299                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2300                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2301                            .dwattr $C$DW$187, DW_AT_decl_line(0x67)
    2302                            .dwattr $C$DW$187, DW_AT_decl_column(0x15)
    2303                    
    2304                    $C$DW$188       .dwtag  DW_TAG_member
    2305                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
    2306                            .dwattr $C$DW$188, DW_AT_name("PINMUX11")
    2307                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("PINMUX11")
    2308                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    2309                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2310                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   43

    2311                            .dwattr $C$DW$188, DW_AT_decl_line(0x68)
    2312                            .dwattr $C$DW$188, DW_AT_decl_column(0x15)
    2313                    
    2314                    $C$DW$189       .dwtag  DW_TAG_member
    2315                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$23)
    2316                            .dwattr $C$DW$189, DW_AT_name("PINMUX12")
    2317                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("PINMUX12")
    2318                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    2319                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2320                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2321                            .dwattr $C$DW$189, DW_AT_decl_line(0x69)
    2322                            .dwattr $C$DW$189, DW_AT_decl_column(0x15)
    2323                    
    2324                    $C$DW$190       .dwtag  DW_TAG_member
    2325                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
    2326                            .dwattr $C$DW$190, DW_AT_name("PINMUX13")
    2327                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("PINMUX13")
    2328                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    2329                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2330                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2331                            .dwattr $C$DW$190, DW_AT_decl_line(0x6a)
    2332                            .dwattr $C$DW$190, DW_AT_decl_column(0x15)
    2333                    
    2334                    $C$DW$191       .dwtag  DW_TAG_member
    2335                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$23)
    2336                            .dwattr $C$DW$191, DW_AT_name("PINMUX14")
    2337                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("PINMUX14")
    2338                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    2339                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2341                            .dwattr $C$DW$191, DW_AT_decl_line(0x6b)
    2342                            .dwattr $C$DW$191, DW_AT_decl_column(0x15)
    2343                    
    2344                    $C$DW$192       .dwtag  DW_TAG_member
    2345                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$23)
    2346                            .dwattr $C$DW$192, DW_AT_name("PINMUX15")
    2347                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("PINMUX15")
    2348                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    2349                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2350                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2351                            .dwattr $C$DW$192, DW_AT_decl_line(0x6c)
    2352                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2353                    
    2354                    $C$DW$193       .dwtag  DW_TAG_member
    2355                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    2356                            .dwattr $C$DW$193, DW_AT_name("PINMUX16")
    2357                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("PINMUX16")
    2358                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    2359                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2360                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2361                            .dwattr $C$DW$193, DW_AT_decl_line(0x6d)
    2362                            .dwattr $C$DW$193, DW_AT_decl_column(0x15)
    2363                    
    2364                    $C$DW$194       .dwtag  DW_TAG_member
    2365                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$23)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   44

    2366                            .dwattr $C$DW$194, DW_AT_name("PINMUX17")
    2367                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("PINMUX17")
    2368                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    2369                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2370                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2371                            .dwattr $C$DW$194, DW_AT_decl_line(0x6e)
    2372                            .dwattr $C$DW$194, DW_AT_decl_column(0x15)
    2373                    
    2374                    $C$DW$195       .dwtag  DW_TAG_member
    2375                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$23)
    2376                            .dwattr $C$DW$195, DW_AT_name("PINMUX18")
    2377                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("PINMUX18")
    2378                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    2379                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2380                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2381                            .dwattr $C$DW$195, DW_AT_decl_line(0x6f)
    2382                            .dwattr $C$DW$195, DW_AT_decl_column(0x15)
    2383                    
    2384                    $C$DW$196       .dwtag  DW_TAG_member
    2385                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$23)
    2386                            .dwattr $C$DW$196, DW_AT_name("PINMUX19")
    2387                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("PINMUX19")
    2388                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    2389                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2390                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2391                            .dwattr $C$DW$196, DW_AT_decl_line(0x70)
    2392                            .dwattr $C$DW$196, DW_AT_decl_column(0x15)
    2393                    
    2394                    $C$DW$197       .dwtag  DW_TAG_member
    2395                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
    2396                            .dwattr $C$DW$197, DW_AT_name("SUSPSRC")
    2397                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("SUSPSRC")
    2398                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    2399                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2400                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2401                            .dwattr $C$DW$197, DW_AT_decl_line(0x71)
    2402                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    2403                    
    2404                    $C$DW$198       .dwtag  DW_TAG_member
    2405                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$23)
    2406                            .dwattr $C$DW$198, DW_AT_name("CHIPSIG")
    2407                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("CHIPSIG")
    2408                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    2409                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2410                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2411                            .dwattr $C$DW$198, DW_AT_decl_line(0x72)
    2412                            .dwattr $C$DW$198, DW_AT_decl_column(0x15)
    2413                    
    2414                    $C$DW$199       .dwtag  DW_TAG_member
    2415                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$23)
    2416                            .dwattr $C$DW$199, DW_AT_name("CHIPSIG_CLR")
    2417                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    2418                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    2419                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2420                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   45

    2421                            .dwattr $C$DW$199, DW_AT_decl_line(0x73)
    2422                            .dwattr $C$DW$199, DW_AT_decl_column(0x15)
    2423                    
    2424                    $C$DW$200       .dwtag  DW_TAG_member
    2425                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$23)
    2426                            .dwattr $C$DW$200, DW_AT_name("CFGCHIP0")
    2427                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("CFGCHIP0")
    2428                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    2429                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2430                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2431                            .dwattr $C$DW$200, DW_AT_decl_line(0x74)
    2432                            .dwattr $C$DW$200, DW_AT_decl_column(0x15)
    2433                    
    2434                    $C$DW$201       .dwtag  DW_TAG_member
    2435                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$23)
    2436                            .dwattr $C$DW$201, DW_AT_name("CFGCHIP1")
    2437                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("CFGCHIP1")
    2438                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2439                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2440                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2441                            .dwattr $C$DW$201, DW_AT_decl_line(0x75)
    2442                            .dwattr $C$DW$201, DW_AT_decl_column(0x15)
    2443                    
    2444                    $C$DW$202       .dwtag  DW_TAG_member
    2445                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$23)
    2446                            .dwattr $C$DW$202, DW_AT_name("CFGCHIP2")
    2447                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("CFGCHIP2")
    2448                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    2449                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2450                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2451                            .dwattr $C$DW$202, DW_AT_decl_line(0x76)
    2452                            .dwattr $C$DW$202, DW_AT_decl_column(0x15)
    2453                    
    2454                    $C$DW$203       .dwtag  DW_TAG_member
    2455                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$23)
    2456                            .dwattr $C$DW$203, DW_AT_name("CFGCHIP3")
    2457                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("CFGCHIP3")
    2458                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    2459                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2460                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2461                            .dwattr $C$DW$203, DW_AT_decl_line(0x77)
    2462                            .dwattr $C$DW$203, DW_AT_decl_column(0x15)
    2463                    
    2464                    $C$DW$204       .dwtag  DW_TAG_member
    2465                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$23)
    2466                            .dwattr $C$DW$204, DW_AT_name("CFGCHIP4")
    2467                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("CFGCHIP4")
    2468                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    2469                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2470                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    2471                            .dwattr $C$DW$204, DW_AT_decl_line(0x78)
    2472                            .dwattr $C$DW$204, DW_AT_decl_column(0x15)
    2473                    
    2474                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2475                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x40)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   46

    2476                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
    2477                            .dwendtag $C$DW$T$33
    2478                    
    2479                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    2480                            .dwattr $C$DW$T$69, DW_AT_name("CSL_SyscfgRegs")
    2481                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$33)
    2482                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2483                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2484                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x79)
    2485                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    2486                    
    2487                    $C$DW$T$70      .dwtag  DW_TAG_volatile_type
    2488                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2489                    
    2490                    $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2491                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2492                            .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    2493                    
    2494                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    2495                            .dwattr $C$DW$T$72, DW_AT_name("CSL_SyscfgRegsOvly")
    2496                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2497                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2498                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg
    2499                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x7e)
    2500                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x2e)
    2501                    
    2502                    $C$DW$T$73      .dwtag  DW_TAG_const_type
    2503                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2504                    
    2505                    
    2506                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2507                            .dwattr $C$DW$T$42, DW_AT_byte_size(0xa80)
    2508                    $C$DW$205       .dwtag  DW_TAG_member
    2509                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$23)
    2510                            .dwattr $C$DW$205, DW_AT_name("REVID")
    2511                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("REVID")
    2512                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2514                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2515                            .dwattr $C$DW$205, DW_AT_decl_line(0x78)
    2516                            .dwattr $C$DW$205, DW_AT_decl_column(0x15)
    2517                    
    2518                    $C$DW$206       .dwtag  DW_TAG_member
    2519                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    2520                            .dwattr $C$DW$206, DW_AT_name("RSVD0")
    2521                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("RSVD0")
    2522                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2523                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2525                            .dwattr $C$DW$206, DW_AT_decl_line(0x79)
    2526                            .dwattr $C$DW$206, DW_AT_decl_column(0x14)
    2527                    
    2528                    $C$DW$207       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$23)
    2530                            .dwattr $C$DW$207, DW_AT_name("INTEVAL")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   47

    2531                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("INTEVAL")
    2532                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2533                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2534                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2535                            .dwattr $C$DW$207, DW_AT_decl_line(0x7a)
    2536                            .dwattr $C$DW$207, DW_AT_decl_column(0x15)
    2537                    
    2538                    $C$DW$208       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
    2540                            .dwattr $C$DW$208, DW_AT_name("RSVD1")
    2541                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("RSVD1")
    2542                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2543                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2545                            .dwattr $C$DW$208, DW_AT_decl_line(0x7b)
    2546                            .dwattr $C$DW$208, DW_AT_decl_column(0x14)
    2547                    
    2548                    $C$DW$209       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
    2550                            .dwattr $C$DW$209, DW_AT_name("MERRPR0")
    2551                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("MERRPR0")
    2552                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2553                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2555                            .dwattr $C$DW$209, DW_AT_decl_line(0x7c)
    2556                            .dwattr $C$DW$209, DW_AT_decl_column(0x15)
    2557                    
    2558                    $C$DW$210       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$35)
    2560                            .dwattr $C$DW$210, DW_AT_name("RSVD2")
    2561                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("RSVD2")
    2562                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2563                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2565                            .dwattr $C$DW$210, DW_AT_decl_line(0x7d)
    2566                            .dwattr $C$DW$210, DW_AT_decl_column(0x14)
    2567                    
    2568                    $C$DW$211       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$23)
    2570                            .dwattr $C$DW$211, DW_AT_name("MERRCR0")
    2571                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("MERRCR0")
    2572                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2573                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2575                            .dwattr $C$DW$211, DW_AT_decl_line(0x7e)
    2576                            .dwattr $C$DW$211, DW_AT_decl_column(0x15)
    2577                    
    2578                    $C$DW$212       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$35)
    2580                            .dwattr $C$DW$212, DW_AT_name("RSVD3")
    2581                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("RSVD3")
    2582                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2583                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2585                            .dwattr $C$DW$212, DW_AT_decl_line(0x7f)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   48

    2586                            .dwattr $C$DW$212, DW_AT_decl_column(0x14)
    2587                    
    2588                    $C$DW$213       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
    2590                            .dwattr $C$DW$213, DW_AT_name("PERRPR")
    2591                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("PERRPR")
    2592                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2593                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2595                            .dwattr $C$DW$213, DW_AT_decl_line(0x80)
    2596                            .dwattr $C$DW$213, DW_AT_decl_column(0x15)
    2597                    
    2598                    $C$DW$214       .dwtag  DW_TAG_member
    2599                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$29)
    2600                            .dwattr $C$DW$214, DW_AT_name("RSVD4")
    2601                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("RSVD4")
    2602                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2603                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2605                            .dwattr $C$DW$214, DW_AT_decl_line(0x81)
    2606                            .dwattr $C$DW$214, DW_AT_decl_column(0x14)
    2607                    
    2608                    $C$DW$215       .dwtag  DW_TAG_member
    2609                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
    2610                            .dwattr $C$DW$215, DW_AT_name("PERRCR")
    2611                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("PERRCR")
    2612                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2613                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2614                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2615                            .dwattr $C$DW$215, DW_AT_decl_line(0x82)
    2616                            .dwattr $C$DW$215, DW_AT_decl_column(0x15)
    2617                    
    2618                    $C$DW$216       .dwtag  DW_TAG_member
    2619                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$36)
    2620                            .dwattr $C$DW$216, DW_AT_name("RSVD5")
    2621                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("RSVD5")
    2622                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2623                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2624                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2625                            .dwattr $C$DW$216, DW_AT_decl_line(0x83)
    2626                            .dwattr $C$DW$216, DW_AT_decl_column(0x14)
    2627                    
    2628                    $C$DW$217       .dwtag  DW_TAG_member
    2629                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
    2630                            .dwattr $C$DW$217, DW_AT_name("PTCMD")
    2631                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("PTCMD")
    2632                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2633                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2634                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2635                            .dwattr $C$DW$217, DW_AT_decl_line(0x84)
    2636                            .dwattr $C$DW$217, DW_AT_decl_column(0x15)
    2637                    
    2638                    $C$DW$218       .dwtag  DW_TAG_member
    2639                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$29)
    2640                            .dwattr $C$DW$218, DW_AT_name("RSVD6")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   49

    2641                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("RSVD6")
    2642                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    2643                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2644                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2645                            .dwattr $C$DW$218, DW_AT_decl_line(0x85)
    2646                            .dwattr $C$DW$218, DW_AT_decl_column(0x14)
    2647                    
    2648                    $C$DW$219       .dwtag  DW_TAG_member
    2649                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
    2650                            .dwattr $C$DW$219, DW_AT_name("PTSTAT")
    2651                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("PTSTAT")
    2652                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    2653                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2654                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2655                            .dwattr $C$DW$219, DW_AT_decl_line(0x86)
    2656                            .dwattr $C$DW$219, DW_AT_decl_column(0x15)
    2657                    
    2658                    $C$DW$220       .dwtag  DW_TAG_member
    2659                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$37)
    2660                            .dwattr $C$DW$220, DW_AT_name("RSVD7")
    2661                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("RSVD7")
    2662                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    2663                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2664                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2665                            .dwattr $C$DW$220, DW_AT_decl_line(0x87)
    2666                            .dwattr $C$DW$220, DW_AT_decl_column(0x14)
    2667                    
    2668                    $C$DW$221       .dwtag  DW_TAG_member
    2669                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
    2670                            .dwattr $C$DW$221, DW_AT_name("PDSTAT0")
    2671                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("PDSTAT0")
    2672                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    2673                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2675                            .dwattr $C$DW$221, DW_AT_decl_line(0x88)
    2676                            .dwattr $C$DW$221, DW_AT_decl_column(0x15)
    2677                    
    2678                    $C$DW$222       .dwtag  DW_TAG_member
    2679                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    2680                            .dwattr $C$DW$222, DW_AT_name("PDSTAT1")
    2681                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("PDSTAT1")
    2682                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
    2683                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2684                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2685                            .dwattr $C$DW$222, DW_AT_decl_line(0x89)
    2686                            .dwattr $C$DW$222, DW_AT_decl_column(0x15)
    2687                    
    2688                    $C$DW$223       .dwtag  DW_TAG_member
    2689                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$38)
    2690                            .dwattr $C$DW$223, DW_AT_name("RSVD8")
    2691                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("RSVD8")
    2692                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
    2693                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2694                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2695                            .dwattr $C$DW$223, DW_AT_decl_line(0x8a)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   50

    2696                            .dwattr $C$DW$223, DW_AT_decl_column(0x14)
    2697                    
    2698                    $C$DW$224       .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$23)
    2700                            .dwattr $C$DW$224, DW_AT_name("PDCTL0")
    2701                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("PDCTL0")
    2702                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    2703                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2704                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2705                            .dwattr $C$DW$224, DW_AT_decl_line(0x8b)
    2706                            .dwattr $C$DW$224, DW_AT_decl_column(0x15)
    2707                    
    2708                    $C$DW$225       .dwtag  DW_TAG_member
    2709                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
    2710                            .dwattr $C$DW$225, DW_AT_name("PDCTL1")
    2711                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("PDCTL1")
    2712                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
    2713                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2715                            .dwattr $C$DW$225, DW_AT_decl_line(0x8c)
    2716                            .dwattr $C$DW$225, DW_AT_decl_column(0x15)
    2717                    
    2718                    $C$DW$226       .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$38)
    2720                            .dwattr $C$DW$226, DW_AT_name("RSVD9")
    2721                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("RSVD9")
    2722                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
    2723                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2725                            .dwattr $C$DW$226, DW_AT_decl_line(0x8d)
    2726                            .dwattr $C$DW$226, DW_AT_decl_column(0x14)
    2727                    
    2728                    $C$DW$227       .dwtag  DW_TAG_member
    2729                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    2730                            .dwattr $C$DW$227, DW_AT_name("PDCFG0")
    2731                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("PDCFG0")
    2732                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
    2733                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2734                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2735                            .dwattr $C$DW$227, DW_AT_decl_line(0x8e)
    2736                            .dwattr $C$DW$227, DW_AT_decl_column(0x15)
    2737                    
    2738                    $C$DW$228       .dwtag  DW_TAG_member
    2739                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    2740                            .dwattr $C$DW$228, DW_AT_name("PDCFG1")
    2741                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("PDCFG1")
    2742                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
    2743                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2744                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2745                            .dwattr $C$DW$228, DW_AT_decl_line(0x8f)
    2746                            .dwattr $C$DW$228, DW_AT_decl_column(0x15)
    2747                    
    2748                    $C$DW$229       .dwtag  DW_TAG_member
    2749                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$39)
    2750                            .dwattr $C$DW$229, DW_AT_name("RSVD10")
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   51

    2751                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("RSVD10")
    2752                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
    2753                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2754                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2755                            .dwattr $C$DW$229, DW_AT_decl_line(0x90)
    2756                            .dwattr $C$DW$229, DW_AT_decl_column(0x14)
    2757                    
    2758                    $C$DW$230       .dwtag  DW_TAG_member
    2759                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$40)
    2760                            .dwattr $C$DW$230, DW_AT_name("MDSTAT")
    2761                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("MDSTAT")
    2762                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
    2763                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2764                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2765                            .dwattr $C$DW$230, DW_AT_decl_line(0x91)
    2766                            .dwattr $C$DW$230, DW_AT_decl_column(0x15)
    2767                    
    2768                    $C$DW$231       .dwtag  DW_TAG_member
    2769                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$41)
    2770                            .dwattr $C$DW$231, DW_AT_name("RSVD11")
    2771                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("RSVD11")
    2772                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
    2773                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2774                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2775                            .dwattr $C$DW$231, DW_AT_decl_line(0x92)
    2776                            .dwattr $C$DW$231, DW_AT_decl_column(0x14)
    2777                    
    2778                    $C$DW$232       .dwtag  DW_TAG_member
    2779                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$40)
    2780                            .dwattr $C$DW$232, DW_AT_name("MDCTL")
    2781                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("MDCTL")
    2782                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
    2783                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2784                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C67
    2785                            .dwattr $C$DW$232, DW_AT_decl_line(0x93)
    2786                            .dwattr $C$DW$232, DW_AT_decl_column(0x15)
    2787                    
    2788                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2789                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x77)
    2790                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x11)
    2791                            .dwendtag $C$DW$T$42
    2792                    
    2793                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2794                            .dwattr $C$DW$T$74, DW_AT_name("CSL_PscRegs")
    2795                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$42)
    2796                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2797                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2798                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x94)
    2799                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    2800                    
    2801                    $C$DW$T$75      .dwtag  DW_TAG_volatile_type
    2802                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2803                    
    2804                    $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2805                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   52

    2806                            .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    2807                    
    2808                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    2809                            .dwattr $C$DW$T$77, DW_AT_name("CSL_PscRegsOvly")
    2810                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2811                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2812                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_psc_C6
    2813                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x9a)
    2814                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x2b)
    2815                    
    2816                    
    2817                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2818                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x28)
    2819                    $C$DW$233       .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
    2821                            .dwattr $C$DW$233, DW_AT_name("DIR")
    2822                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("DIR")
    2823                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2826                            .dwattr $C$DW$233, DW_AT_decl_line(0x43)
    2827                            .dwattr $C$DW$233, DW_AT_decl_column(0x15)
    2828                    
    2829                    $C$DW$234       .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$23)
    2831                            .dwattr $C$DW$234, DW_AT_name("OUT_DATA")
    2832                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("OUT_DATA")
    2833                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2834                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2835                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2836                            .dwattr $C$DW$234, DW_AT_decl_line(0x44)
    2837                            .dwattr $C$DW$234, DW_AT_decl_column(0x15)
    2838                    
    2839                    $C$DW$235       .dwtag  DW_TAG_member
    2840                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$23)
    2841                            .dwattr $C$DW$235, DW_AT_name("SET_DATA")
    2842                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("SET_DATA")
    2843                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2844                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2845                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2846                            .dwattr $C$DW$235, DW_AT_decl_line(0x45)
    2847                            .dwattr $C$DW$235, DW_AT_decl_column(0x15)
    2848                    
    2849                    $C$DW$236       .dwtag  DW_TAG_member
    2850                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$23)
    2851                            .dwattr $C$DW$236, DW_AT_name("CLR_DATA")
    2852                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("CLR_DATA")
    2853                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2854                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2855                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2856                            .dwattr $C$DW$236, DW_AT_decl_line(0x46)
    2857                            .dwattr $C$DW$236, DW_AT_decl_column(0x15)
    2858                    
    2859                    $C$DW$237       .dwtag  DW_TAG_member
    2860                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$23)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   53

    2861                            .dwattr $C$DW$237, DW_AT_name("IN_DATA")
    2862                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("IN_DATA")
    2863                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2864                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2865                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2866                            .dwattr $C$DW$237, DW_AT_decl_line(0x47)
    2867                            .dwattr $C$DW$237, DW_AT_decl_column(0x15)
    2868                    
    2869                    $C$DW$238       .dwtag  DW_TAG_member
    2870                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$23)
    2871                            .dwattr $C$DW$238, DW_AT_name("SET_RIS_TRIG")
    2872                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("SET_RIS_TRIG")
    2873                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2874                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2875                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2876                            .dwattr $C$DW$238, DW_AT_decl_line(0x48)
    2877                            .dwattr $C$DW$238, DW_AT_decl_column(0x15)
    2878                    
    2879                    $C$DW$239       .dwtag  DW_TAG_member
    2880                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$23)
    2881                            .dwattr $C$DW$239, DW_AT_name("CLR_RIS_TRIG")
    2882                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("CLR_RIS_TRIG")
    2883                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2884                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2885                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2886                            .dwattr $C$DW$239, DW_AT_decl_line(0x49)
    2887                            .dwattr $C$DW$239, DW_AT_decl_column(0x15)
    2888                    
    2889                    $C$DW$240       .dwtag  DW_TAG_member
    2890                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$23)
    2891                            .dwattr $C$DW$240, DW_AT_name("SET_FAL_TRIG")
    2892                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("SET_FAL_TRIG")
    2893                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2894                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2895                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2896                            .dwattr $C$DW$240, DW_AT_decl_line(0x4a)
    2897                            .dwattr $C$DW$240, DW_AT_decl_column(0x15)
    2898                    
    2899                    $C$DW$241       .dwtag  DW_TAG_member
    2900                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$23)
    2901                            .dwattr $C$DW$241, DW_AT_name("CLR_FAL_TRIG")
    2902                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("CLR_FAL_TRIG")
    2903                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2904                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2905                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2906                            .dwattr $C$DW$241, DW_AT_decl_line(0x4b)
    2907                            .dwattr $C$DW$241, DW_AT_decl_column(0x15)
    2908                    
    2909                    $C$DW$242       .dwtag  DW_TAG_member
    2910                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$23)
    2911                            .dwattr $C$DW$242, DW_AT_name("INTSTAT")
    2912                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("INTSTAT")
    2913                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2914                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2915                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   54

    2916                            .dwattr $C$DW$242, DW_AT_decl_line(0x4c)
    2917                            .dwattr $C$DW$242, DW_AT_decl_column(0x15)
    2918                    
    2919                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h
    2920                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x42)
    2921                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x11)
    2922                            .dwendtag $C$DW$T$43
    2923                    
    2924                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    2925                            .dwattr $C$DW$T$44, DW_AT_name("CSL_GpioBankRegs")
    2926                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2927                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2928                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h
    2929                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4d)
    2930                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    2931                    
    2932                    
    2933                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    2934                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2935                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2936                            .dwattr $C$DW$T$45, DW_AT_byte_size(0xc8)
    2937                    $C$DW$243       .dwtag  DW_TAG_subrange_type
    2938                            .dwattr $C$DW$243, DW_AT_upper_bound(0x04)
    2939                    
    2940                            .dwendtag $C$DW$T$45
    2941                    
    2942                    
    2943                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2944                            .dwattr $C$DW$T$46, DW_AT_byte_size(0xd8)
    2945                    $C$DW$244       .dwtag  DW_TAG_member
    2946                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$23)
    2947                            .dwattr $C$DW$244, DW_AT_name("REVID")
    2948                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("REVID")
    2949                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2950                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2951                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2952                            .dwattr $C$DW$244, DW_AT_decl_line(0x53)
    2953                            .dwattr $C$DW$244, DW_AT_decl_column(0x15)
    2954                    
    2955                    $C$DW$245       .dwtag  DW_TAG_member
    2956                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$29)
    2957                            .dwattr $C$DW$245, DW_AT_name("RSVD0")
    2958                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("RSVD0")
    2959                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2960                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2961                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2962                            .dwattr $C$DW$245, DW_AT_decl_line(0x54)
    2963                            .dwattr $C$DW$245, DW_AT_decl_column(0x14)
    2964                    
    2965                    $C$DW$246       .dwtag  DW_TAG_member
    2966                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
    2967                            .dwattr $C$DW$246, DW_AT_name("BINTEN")
    2968                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("BINTEN")
    2969                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2970                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v8.1.3 Thu Apr 20 04:41:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
leds.asm                                                             PAGE   55

    2971                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2972                            .dwattr $C$DW$246, DW_AT_decl_line(0x55)
    2973                            .dwattr $C$DW$246, DW_AT_decl_column(0x15)
    2974                    
    2975                    $C$DW$247       .dwtag  DW_TAG_member
    2976                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$29)
    2977                            .dwattr $C$DW$247, DW_AT_name("RSVD1")
    2978                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("RSVD1")
    2979                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2980                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2981                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2982                            .dwattr $C$DW$247, DW_AT_decl_line(0x56)
    2983                            .dwattr $C$DW$247, DW_AT_decl_column(0x14)
    2984                    
    2985                    $C$DW$248       .dwtag  DW_TAG_member
    2986                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$45)
    2987                            .dwattr $C$DW$248, DW_AT_name("BANK")
    2988                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("BANK")
    2989                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2990                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2991                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h"
    2992                            .dwattr $C$DW$248, DW_AT_decl_line(0x57)
    2993                            .dwattr $C$DW$248, DW_AT_decl_column(0x16)
    2994                    
    2995                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h
    2996                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x52)
    2997                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x11)
    2998                            .dwendtag $C$DW$T$46
    2999                    
    3000                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    3001                            .dwattr $C$DW$T$78, DW_AT_name("CSL_GpioRegs")
    3002                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$46)
    3003                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3004                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_gpio.h
