TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE    1

       1                    ;******************************************************************************
       2                    ;* G3 TMS320C6x C/C++ Codegen                                       PC v8.1.3 *
       3                    ;* Date/Time created: Fri Apr 14 08:40:17 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --array_alignment=8 --diag_wrap=off --endian=little --hll_source=on 
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C674x                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    3768                            .dwattr $C$DW$355, DW_AT_name("HW_PSC_SCRF0_SS")
    3769                            .dwattr $C$DW$355, DW_AT_const_value(0x18)
    3770                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3771                            .dwattr $C$DW$355, DW_AT_decl_line(0x65)
    3772                            .dwattr $C$DW$355, DW_AT_decl_column(0x05)
    3773                    
    3774                    $C$DW$356       .dwtag  DW_TAG_enumerator
    3775                            .dwattr $C$DW$356, DW_AT_name("HW_PSC_SCRF1_SS")
    3776                            .dwattr $C$DW$356, DW_AT_const_value(0x19)
    3777                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3778                            .dwattr $C$DW$356, DW_AT_decl_line(0x66)
    3779                            .dwattr $C$DW$356, DW_AT_decl_column(0x05)
    3780                    
    3781                    $C$DW$357       .dwtag  DW_TAG_enumerator
    3782                            .dwattr $C$DW$357, DW_AT_name("HW_PSC_SCRF2_SS")
    3783                            .dwattr $C$DW$357, DW_AT_const_value(0x1a)
    3784                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3785                            .dwattr $C$DW$357, DW_AT_decl_line(0x67)
    3786                            .dwattr $C$DW$357, DW_AT_decl_column(0x05)
    3787                    
    3788                    $C$DW$358       .dwtag  DW_TAG_enumerator
    3789                            .dwattr $C$DW$358, DW_AT_name("HW_PSC_SCRF6_SS")
    3790                            .dwattr $C$DW$358, DW_AT_const_value(0x1b)
    3791                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3792                            .dwattr $C$DW$358, DW_AT_decl_line(0x68)
    3793                            .dwattr $C$DW$358, DW_AT_decl_column(0x05)
    3794                    
    3795                    $C$DW$359       .dwtag  DW_TAG_enumerator
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   70

    3796                            .dwattr $C$DW$359, DW_AT_name("HW_PSC_SCRF7_SS")
    3797                            .dwattr $C$DW$359, DW_AT_const_value(0x1c)
    3798                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3799                            .dwattr $C$DW$359, DW_AT_decl_line(0x69)
    3800                            .dwattr $C$DW$359, DW_AT_decl_column(0x05)
    3801                    
    3802                    $C$DW$360       .dwtag  DW_TAG_enumerator
    3803                            .dwattr $C$DW$360, DW_AT_name("HW_PSC_SCRF8_SS")
    3804                            .dwattr $C$DW$360, DW_AT_const_value(0x1d)
    3805                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3806                            .dwattr $C$DW$360, DW_AT_decl_line(0x6a)
    3807                            .dwattr $C$DW$360, DW_AT_decl_column(0x05)
    3808                    
    3809                    $C$DW$361       .dwtag  DW_TAG_enumerator
    3810                            .dwattr $C$DW$361, DW_AT_name("HW_PSC_BR_F7")
    3811                            .dwattr $C$DW$361, DW_AT_const_value(0x1e)
    3812                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3813                            .dwattr $C$DW$361, DW_AT_decl_line(0x6b)
    3814                            .dwattr $C$DW$361, DW_AT_decl_column(0x05)
    3815                    
    3816                    $C$DW$362       .dwtag  DW_TAG_enumerator
    3817                            .dwattr $C$DW$362, DW_AT_name("HW_PSC_SHRAM")
    3818                            .dwattr $C$DW$362, DW_AT_const_value(0x1f)
    3819                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_C6
    3820                            .dwattr $C$DW$362, DW_AT_decl_line(0x6c)
    3821                            .dwattr $C$DW$362, DW_AT_decl_column(0x05)
    3822                    
    3823                            .dwattr $C$DW$T$698, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_
    3824                            .dwattr $C$DW$T$698, DW_AT_decl_line(0x4e)
    3825                            .dwattr $C$DW$T$698, DW_AT_decl_column(0x0e)
    3826                            .dwendtag $C$DW$T$698
    3827                    
    3828                    $C$DW$T$699     .dwtag  DW_TAG_typedef
    3829                            .dwattr $C$DW$T$699, DW_AT_name("Psc1Peripheral")
    3830                            .dwattr $C$DW$T$699, DW_AT_type(*$C$DW$T$698)
    3831                            .dwattr $C$DW$T$699, DW_AT_language(DW_LANG_C)
    3832                            .dwattr $C$DW$T$699, DW_AT_decl_file("C:/ti/OMAPL138_StarterWare_1_10_04_01/include/hw/hw_psc_
    3833                            .dwattr $C$DW$T$699, DW_AT_decl_line(0x6d)
    3834                            .dwattr $C$DW$T$699, DW_AT_decl_column(0x03)
    3835                    
    3836                    
    3837                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    3838                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x190)
    3839                    $C$DW$363       .dwtag  DW_TAG_member
    3840                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$155)
    3841                            .dwattr $C$DW$363, DW_AT_name("REVID")
    3842                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("REVID")
    3843                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3844                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3845                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3846                            .dwattr $C$DW$363, DW_AT_decl_line(0x41)
    3847                            .dwattr $C$DW$363, DW_AT_decl_column(0x15)
    3848                    
    3849                    $C$DW$364       .dwtag  DW_TAG_member
    3850                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$161)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   71

    3851                            .dwattr $C$DW$364, DW_AT_name("RSVD0")
    3852                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("RSVD0")
    3853                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3854                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3855                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3856                            .dwattr $C$DW$364, DW_AT_decl_line(0x42)
    3857                            .dwattr $C$DW$364, DW_AT_decl_column(0x14)
    3858                    
    3859                    $C$DW$365       .dwtag  DW_TAG_member
    3860                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$155)
    3861                            .dwattr $C$DW$365, DW_AT_name("DIEIDR0")
    3862                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("DIEIDR0")
    3863                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3864                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3865                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3866                            .dwattr $C$DW$365, DW_AT_decl_line(0x43)
    3867                            .dwattr $C$DW$365, DW_AT_decl_column(0x15)
    3868                    
    3869                    $C$DW$366       .dwtag  DW_TAG_member
    3870                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$155)
    3871                            .dwattr $C$DW$366, DW_AT_name("DIEIDR1")
    3872                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("DIEIDR1")
    3873                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3874                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3875                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3876                            .dwattr $C$DW$366, DW_AT_decl_line(0x44)
    3877                            .dwattr $C$DW$366, DW_AT_decl_column(0x15)
    3878                    
    3879                    $C$DW$367       .dwtag  DW_TAG_member
    3880                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$155)
    3881                            .dwattr $C$DW$367, DW_AT_name("DIEIDR2")
    3882                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("DIEIDR2")
    3883                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3884                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3885                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3886                            .dwattr $C$DW$367, DW_AT_decl_line(0x45)
    3887                            .dwattr $C$DW$367, DW_AT_decl_column(0x15)
    3888                    
    3889                    $C$DW$368       .dwtag  DW_TAG_member
    3890                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$155)
    3891                            .dwattr $C$DW$368, DW_AT_name("DIEIDR3")
    3892                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("DIEIDR3")
    3893                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3894                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3896                            .dwattr $C$DW$368, DW_AT_decl_line(0x46)
    3897                            .dwattr $C$DW$368, DW_AT_decl_column(0x15)
    3898                    
    3899                    $C$DW$369       .dwtag  DW_TAG_member
    3900                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$155)
    3901                            .dwattr $C$DW$369, DW_AT_name("DEVIDR0")
    3902                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("DEVIDR0")
    3903                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3904                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3905                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   72

    3906                            .dwattr $C$DW$369, DW_AT_decl_line(0x47)
    3907                            .dwattr $C$DW$369, DW_AT_decl_column(0x15)
    3908                    
    3909                    $C$DW$370       .dwtag  DW_TAG_member
    3910                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$161)
    3911                            .dwattr $C$DW$370, DW_AT_name("RSVD1")
    3912                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("RSVD1")
    3913                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3914                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3915                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3916                            .dwattr $C$DW$370, DW_AT_decl_line(0x48)
    3917                            .dwattr $C$DW$370, DW_AT_decl_column(0x14)
    3918                    
    3919                    $C$DW$371       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$155)
    3921                            .dwattr $C$DW$371, DW_AT_name("BOOTCFG")
    3922                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("BOOTCFG")
    3923                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3924                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3926                            .dwattr $C$DW$371, DW_AT_decl_line(0x49)
    3927                            .dwattr $C$DW$371, DW_AT_decl_column(0x15)
    3928                    
    3929                    $C$DW$372       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$155)
    3931                            .dwattr $C$DW$372, DW_AT_name("CHIPREVIDR")
    3932                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("CHIPREVIDR")
    3933                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3934                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3936                            .dwattr $C$DW$372, DW_AT_decl_line(0x4a)
    3937                            .dwattr $C$DW$372, DW_AT_decl_column(0x15)
    3938                    
    3939                    $C$DW$373       .dwtag  DW_TAG_member
    3940                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$162)
    3941                            .dwattr $C$DW$373, DW_AT_name("RSVD2")
    3942                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("RSVD2")
    3943                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3944                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3946                            .dwattr $C$DW$373, DW_AT_decl_line(0x4b)
    3947                            .dwattr $C$DW$373, DW_AT_decl_column(0x14)
    3948                    
    3949                    $C$DW$374       .dwtag  DW_TAG_member
    3950                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$155)
    3951                            .dwattr $C$DW$374, DW_AT_name("KICK0R")
    3952                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("KICK0R")
    3953                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3954                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3955                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3956                            .dwattr $C$DW$374, DW_AT_decl_line(0x4c)
    3957                            .dwattr $C$DW$374, DW_AT_decl_column(0x15)
    3958                    
    3959                    $C$DW$375       .dwtag  DW_TAG_member
    3960                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$155)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   73

    3961                            .dwattr $C$DW$375, DW_AT_name("KICK1R")
    3962                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("KICK1R")
    3963                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3964                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3965                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3966                            .dwattr $C$DW$375, DW_AT_decl_line(0x4d)
    3967                            .dwattr $C$DW$375, DW_AT_decl_column(0x15)
    3968                    
    3969                    $C$DW$376       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$161)
    3971                            .dwattr $C$DW$376, DW_AT_name("RSVD3")
    3972                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("RSVD3")
    3973                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3974                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3976                            .dwattr $C$DW$376, DW_AT_decl_line(0x4e)
    3977                            .dwattr $C$DW$376, DW_AT_decl_column(0x14)
    3978                    
    3979                    $C$DW$377       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$155)
    3981                            .dwattr $C$DW$377, DW_AT_name("HOST1CFG")
    3982                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("HOST1CFG")
    3983                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3984                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3985                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3986                            .dwattr $C$DW$377, DW_AT_decl_line(0x4f)
    3987                            .dwattr $C$DW$377, DW_AT_decl_column(0x15)
    3988                    
    3989                    $C$DW$378       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$163)
    3991                            .dwattr $C$DW$378, DW_AT_name("RSVD4")
    3992                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("RSVD4")
    3993                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3994                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3995                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    3996                            .dwattr $C$DW$378, DW_AT_decl_line(0x50)
    3997                            .dwattr $C$DW$378, DW_AT_decl_column(0x14)
    3998                    
    3999                    $C$DW$379       .dwtag  DW_TAG_member
    4000                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$155)
    4001                            .dwattr $C$DW$379, DW_AT_name("IRAWSTAT")
    4002                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("IRAWSTAT")
    4003                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4004                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4005                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4006                            .dwattr $C$DW$379, DW_AT_decl_line(0x51)
    4007                            .dwattr $C$DW$379, DW_AT_decl_column(0x15)
    4008                    
    4009                    $C$DW$380       .dwtag  DW_TAG_member
    4010                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$155)
    4011                            .dwattr $C$DW$380, DW_AT_name("IENSTAT")
    4012                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("IENSTAT")
    4013                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    4014                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4015                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   74

    4016                            .dwattr $C$DW$380, DW_AT_decl_line(0x52)
    4017                            .dwattr $C$DW$380, DW_AT_decl_column(0x15)
    4018                    
    4019                    $C$DW$381       .dwtag  DW_TAG_member
    4020                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$155)
    4021                            .dwattr $C$DW$381, DW_AT_name("IENSET")
    4022                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("IENSET")
    4023                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4024                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4025                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4026                            .dwattr $C$DW$381, DW_AT_decl_line(0x53)
    4027                            .dwattr $C$DW$381, DW_AT_decl_column(0x15)
    4028                    
    4029                    $C$DW$382       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$155)
    4031                            .dwattr $C$DW$382, DW_AT_name("IENCLR")
    4032                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("IENCLR")
    4033                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4034                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4036                            .dwattr $C$DW$382, DW_AT_decl_line(0x54)
    4037                            .dwattr $C$DW$382, DW_AT_decl_column(0x15)
    4038                    
    4039                    $C$DW$383       .dwtag  DW_TAG_member
    4040                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$155)
    4041                            .dwattr $C$DW$383, DW_AT_name("EOI")
    4042                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("EOI")
    4043                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4044                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4045                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4046                            .dwattr $C$DW$383, DW_AT_decl_line(0x55)
    4047                            .dwattr $C$DW$383, DW_AT_decl_column(0x15)
    4048                    
    4049                    $C$DW$384       .dwtag  DW_TAG_member
    4050                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$155)
    4051                            .dwattr $C$DW$384, DW_AT_name("FLTADDRR")
    4052                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("FLTADDRR")
    4053                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4054                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4055                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4056                            .dwattr $C$DW$384, DW_AT_decl_line(0x56)
    4057                            .dwattr $C$DW$384, DW_AT_decl_column(0x15)
    4058                    
    4059                    $C$DW$385       .dwtag  DW_TAG_member
    4060                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$155)
    4061                            .dwattr $C$DW$385, DW_AT_name("FLTSTAT")
    4062                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("FLTSTAT")
    4063                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    4064                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4065                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4066                            .dwattr $C$DW$385, DW_AT_decl_line(0x57)
    4067                            .dwattr $C$DW$385, DW_AT_decl_column(0x15)
    4068                    
    4069                    $C$DW$386       .dwtag  DW_TAG_member
    4070                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$164)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   75

    4071                            .dwattr $C$DW$386, DW_AT_name("RSVD5")
    4072                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("RSVD5")
    4073                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    4074                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4075                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4076                            .dwattr $C$DW$386, DW_AT_decl_line(0x58)
    4077                            .dwattr $C$DW$386, DW_AT_decl_column(0x14)
    4078                    
    4079                    $C$DW$387       .dwtag  DW_TAG_member
    4080                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$155)
    4081                            .dwattr $C$DW$387, DW_AT_name("MSTPRI0")
    4082                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("MSTPRI0")
    4083                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4084                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4085                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4086                            .dwattr $C$DW$387, DW_AT_decl_line(0x59)
    4087                            .dwattr $C$DW$387, DW_AT_decl_column(0x15)
    4088                    
    4089                    $C$DW$388       .dwtag  DW_TAG_member
    4090                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$155)
    4091                            .dwattr $C$DW$388, DW_AT_name("MSTPRI1")
    4092                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("MSTPRI1")
    4093                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4094                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4095                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4096                            .dwattr $C$DW$388, DW_AT_decl_line(0x5a)
    4097                            .dwattr $C$DW$388, DW_AT_decl_column(0x15)
    4098                    
    4099                    $C$DW$389       .dwtag  DW_TAG_member
    4100                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$155)
    4101                            .dwattr $C$DW$389, DW_AT_name("MSTPRI2")
    4102                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("MSTPRI2")
    4103                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    4104                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4105                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4106                            .dwattr $C$DW$389, DW_AT_decl_line(0x5b)
    4107                            .dwattr $C$DW$389, DW_AT_decl_column(0x15)
    4108                    
    4109                    $C$DW$390       .dwtag  DW_TAG_member
    4110                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$161)
    4111                            .dwattr $C$DW$390, DW_AT_name("RSVD6")
    4112                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("RSVD6")
    4113                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    4114                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4115                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4116                            .dwattr $C$DW$390, DW_AT_decl_line(0x5c)
    4117                            .dwattr $C$DW$390, DW_AT_decl_column(0x14)
    4118                    
    4119                    $C$DW$391       .dwtag  DW_TAG_member
    4120                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$155)
    4121                            .dwattr $C$DW$391, DW_AT_name("PINMUX0")
    4122                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("PINMUX0")
    4123                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    4124                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4125                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   76

    4126                            .dwattr $C$DW$391, DW_AT_decl_line(0x5d)
    4127                            .dwattr $C$DW$391, DW_AT_decl_column(0x15)
    4128                    
    4129                    $C$DW$392       .dwtag  DW_TAG_member
    4130                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$155)
    4131                            .dwattr $C$DW$392, DW_AT_name("PINMUX1")
    4132                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("PINMUX1")
    4133                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4134                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4135                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4136                            .dwattr $C$DW$392, DW_AT_decl_line(0x5e)
    4137                            .dwattr $C$DW$392, DW_AT_decl_column(0x15)
    4138                    
    4139                    $C$DW$393       .dwtag  DW_TAG_member
    4140                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$155)
    4141                            .dwattr $C$DW$393, DW_AT_name("PINMUX2")
    4142                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("PINMUX2")
    4143                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    4144                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4145                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4146                            .dwattr $C$DW$393, DW_AT_decl_line(0x5f)
    4147                            .dwattr $C$DW$393, DW_AT_decl_column(0x15)
    4148                    
    4149                    $C$DW$394       .dwtag  DW_TAG_member
    4150                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$155)
    4151                            .dwattr $C$DW$394, DW_AT_name("PINMUX3")
    4152                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("PINMUX3")
    4153                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    4154                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4155                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4156                            .dwattr $C$DW$394, DW_AT_decl_line(0x60)
    4157                            .dwattr $C$DW$394, DW_AT_decl_column(0x15)
    4158                    
    4159                    $C$DW$395       .dwtag  DW_TAG_member
    4160                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$155)
    4161                            .dwattr $C$DW$395, DW_AT_name("PINMUX4")
    4162                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("PINMUX4")
    4163                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    4164                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4165                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4166                            .dwattr $C$DW$395, DW_AT_decl_line(0x61)
    4167                            .dwattr $C$DW$395, DW_AT_decl_column(0x15)
    4168                    
    4169                    $C$DW$396       .dwtag  DW_TAG_member
    4170                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$155)
    4171                            .dwattr $C$DW$396, DW_AT_name("PINMUX5")
    4172                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("PINMUX5")
    4173                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    4174                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4175                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4176                            .dwattr $C$DW$396, DW_AT_decl_line(0x62)
    4177                            .dwattr $C$DW$396, DW_AT_decl_column(0x15)
    4178                    
    4179                    $C$DW$397       .dwtag  DW_TAG_member
    4180                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$155)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   77

    4181                            .dwattr $C$DW$397, DW_AT_name("PINMUX6")
    4182                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("PINMUX6")
    4183                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    4184                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4185                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4186                            .dwattr $C$DW$397, DW_AT_decl_line(0x63)
    4187                            .dwattr $C$DW$397, DW_AT_decl_column(0x15)
    4188                    
    4189                    $C$DW$398       .dwtag  DW_TAG_member
    4190                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$155)
    4191                            .dwattr $C$DW$398, DW_AT_name("PINMUX7")
    4192                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("PINMUX7")
    4193                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    4194                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4195                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4196                            .dwattr $C$DW$398, DW_AT_decl_line(0x64)
    4197                            .dwattr $C$DW$398, DW_AT_decl_column(0x15)
    4198                    
    4199                    $C$DW$399       .dwtag  DW_TAG_member
    4200                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$155)
    4201                            .dwattr $C$DW$399, DW_AT_name("PINMUX8")
    4202                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("PINMUX8")
    4203                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    4204                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4205                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4206                            .dwattr $C$DW$399, DW_AT_decl_line(0x65)
    4207                            .dwattr $C$DW$399, DW_AT_decl_column(0x15)
    4208                    
    4209                    $C$DW$400       .dwtag  DW_TAG_member
    4210                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$155)
    4211                            .dwattr $C$DW$400, DW_AT_name("PINMUX9")
    4212                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("PINMUX9")
    4213                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    4214                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4215                            .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4216                            .dwattr $C$DW$400, DW_AT_decl_line(0x66)
    4217                            .dwattr $C$DW$400, DW_AT_decl_column(0x15)
    4218                    
    4219                    $C$DW$401       .dwtag  DW_TAG_member
    4220                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$155)
    4221                            .dwattr $C$DW$401, DW_AT_name("PINMUX10")
    4222                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("PINMUX10")
    4223                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    4224                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4225                            .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4226                            .dwattr $C$DW$401, DW_AT_decl_line(0x67)
    4227                            .dwattr $C$DW$401, DW_AT_decl_column(0x15)
    4228                    
    4229                    $C$DW$402       .dwtag  DW_TAG_member
    4230                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$155)
    4231                            .dwattr $C$DW$402, DW_AT_name("PINMUX11")
    4232                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("PINMUX11")
    4233                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    4234                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   78

    4236                            .dwattr $C$DW$402, DW_AT_decl_line(0x68)
    4237                            .dwattr $C$DW$402, DW_AT_decl_column(0x15)
    4238                    
    4239                    $C$DW$403       .dwtag  DW_TAG_member
    4240                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$155)
    4241                            .dwattr $C$DW$403, DW_AT_name("PINMUX12")
    4242                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("PINMUX12")
    4243                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    4244                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4245                            .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4246                            .dwattr $C$DW$403, DW_AT_decl_line(0x69)
    4247                            .dwattr $C$DW$403, DW_AT_decl_column(0x15)
    4248                    
    4249                    $C$DW$404       .dwtag  DW_TAG_member
    4250                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$155)
    4251                            .dwattr $C$DW$404, DW_AT_name("PINMUX13")
    4252                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("PINMUX13")
    4253                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
    4254                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4255                            .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4256                            .dwattr $C$DW$404, DW_AT_decl_line(0x6a)
    4257                            .dwattr $C$DW$404, DW_AT_decl_column(0x15)
    4258                    
    4259                    $C$DW$405       .dwtag  DW_TAG_member
    4260                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$155)
    4261                            .dwattr $C$DW$405, DW_AT_name("PINMUX14")
    4262                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("PINMUX14")
    4263                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    4264                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4265                            .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4266                            .dwattr $C$DW$405, DW_AT_decl_line(0x6b)
    4267                            .dwattr $C$DW$405, DW_AT_decl_column(0x15)
    4268                    
    4269                    $C$DW$406       .dwtag  DW_TAG_member
    4270                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$155)
    4271                            .dwattr $C$DW$406, DW_AT_name("PINMUX15")
    4272                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("PINMUX15")
    4273                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
    4274                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4275                            .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4276                            .dwattr $C$DW$406, DW_AT_decl_line(0x6c)
    4277                            .dwattr $C$DW$406, DW_AT_decl_column(0x15)
    4278                    
    4279                    $C$DW$407       .dwtag  DW_TAG_member
    4280                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$155)
    4281                            .dwattr $C$DW$407, DW_AT_name("PINMUX16")
    4282                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("PINMUX16")
    4283                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
    4284                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4285                            .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4286                            .dwattr $C$DW$407, DW_AT_decl_line(0x6d)
    4287                            .dwattr $C$DW$407, DW_AT_decl_column(0x15)
    4288                    
    4289                    $C$DW$408       .dwtag  DW_TAG_member
    4290                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$155)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   79

    4291                            .dwattr $C$DW$408, DW_AT_name("PINMUX17")
    4292                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("PINMUX17")
    4293                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4294                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4295                            .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4296                            .dwattr $C$DW$408, DW_AT_decl_line(0x6e)
    4297                            .dwattr $C$DW$408, DW_AT_decl_column(0x15)
    4298                    
    4299                    $C$DW$409       .dwtag  DW_TAG_member
    4300                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$155)
    4301                            .dwattr $C$DW$409, DW_AT_name("PINMUX18")
    4302                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("PINMUX18")
    4303                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    4304                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4305                            .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4306                            .dwattr $C$DW$409, DW_AT_decl_line(0x6f)
    4307                            .dwattr $C$DW$409, DW_AT_decl_column(0x15)
    4308                    
    4309                    $C$DW$410       .dwtag  DW_TAG_member
    4310                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$155)
    4311                            .dwattr $C$DW$410, DW_AT_name("PINMUX19")
    4312                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("PINMUX19")
    4313                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
    4314                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4315                            .dwattr $C$DW$410, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4316                            .dwattr $C$DW$410, DW_AT_decl_line(0x70)
    4317                            .dwattr $C$DW$410, DW_AT_decl_column(0x15)
    4318                    
    4319                    $C$DW$411       .dwtag  DW_TAG_member
    4320                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$155)
    4321                            .dwattr $C$DW$411, DW_AT_name("SUSPSRC")
    4322                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("SUSPSRC")
    4323                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    4324                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4325                            .dwattr $C$DW$411, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4326                            .dwattr $C$DW$411, DW_AT_decl_line(0x71)
    4327                            .dwattr $C$DW$411, DW_AT_decl_column(0x15)
    4328                    
    4329                    $C$DW$412       .dwtag  DW_TAG_member
    4330                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$155)
    4331                            .dwattr $C$DW$412, DW_AT_name("CHIPSIG")
    4332                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("CHIPSIG")
    4333                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
    4334                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4335                            .dwattr $C$DW$412, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4336                            .dwattr $C$DW$412, DW_AT_decl_line(0x72)
    4337                            .dwattr $C$DW$412, DW_AT_decl_column(0x15)
    4338                    
    4339                    $C$DW$413       .dwtag  DW_TAG_member
    4340                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$155)
    4341                            .dwattr $C$DW$413, DW_AT_name("CHIPSIG_CLR")
    4342                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("CHIPSIG_CLR")
    4343                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    4344                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4345                            .dwattr $C$DW$413, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   80

    4346                            .dwattr $C$DW$413, DW_AT_decl_line(0x73)
    4347                            .dwattr $C$DW$413, DW_AT_decl_column(0x15)
    4348                    
    4349                    $C$DW$414       .dwtag  DW_TAG_member
    4350                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$155)
    4351                            .dwattr $C$DW$414, DW_AT_name("CFGCHIP0")
    4352                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("CFGCHIP0")
    4353                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
    4354                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4355                            .dwattr $C$DW$414, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4356                            .dwattr $C$DW$414, DW_AT_decl_line(0x74)
    4357                            .dwattr $C$DW$414, DW_AT_decl_column(0x15)
    4358                    
    4359                    $C$DW$415       .dwtag  DW_TAG_member
    4360                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$155)
    4361                            .dwattr $C$DW$415, DW_AT_name("CFGCHIP1")
    4362                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("CFGCHIP1")
    4363                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    4364                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4365                            .dwattr $C$DW$415, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4366                            .dwattr $C$DW$415, DW_AT_decl_line(0x75)
    4367                            .dwattr $C$DW$415, DW_AT_decl_column(0x15)
    4368                    
    4369                    $C$DW$416       .dwtag  DW_TAG_member
    4370                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$155)
    4371                            .dwattr $C$DW$416, DW_AT_name("CFGCHIP2")
    4372                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("CFGCHIP2")
    4373                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    4374                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4375                            .dwattr $C$DW$416, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4376                            .dwattr $C$DW$416, DW_AT_decl_line(0x76)
    4377                            .dwattr $C$DW$416, DW_AT_decl_column(0x15)
    4378                    
    4379                    $C$DW$417       .dwtag  DW_TAG_member
    4380                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$155)
    4381                            .dwattr $C$DW$417, DW_AT_name("CFGCHIP3")
    4382                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("CFGCHIP3")
    4383                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    4384                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4385                            .dwattr $C$DW$417, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4386                            .dwattr $C$DW$417, DW_AT_decl_line(0x77)
    4387                            .dwattr $C$DW$417, DW_AT_decl_column(0x15)
    4388                    
    4389                    $C$DW$418       .dwtag  DW_TAG_member
    4390                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$155)
    4391                            .dwattr $C$DW$418, DW_AT_name("CFGCHIP4")
    4392                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("CFGCHIP4")
    4393                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
    4394                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4395                            .dwattr $C$DW$418, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscfg0
    4396                            .dwattr $C$DW$418, DW_AT_decl_line(0x78)
    4397                            .dwattr $C$DW$418, DW_AT_decl_column(0x15)
    4398                    
    4399                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4400                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x40)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   81

    4401                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x11)
    4402                            .dwendtag $C$DW$T$165
    4403                    
    4404                    $C$DW$T$702     .dwtag  DW_TAG_typedef
    4405                            .dwattr $C$DW$T$702, DW_AT_name("CSL_SyscfgRegs")
    4406                            .dwattr $C$DW$T$702, DW_AT_type(*$C$DW$T$165)
    4407                            .dwattr $C$DW$T$702, DW_AT_language(DW_LANG_C)
    4408                            .dwattr $C$DW$T$702, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4409                            .dwattr $C$DW$T$702, DW_AT_decl_line(0x79)
    4410                            .dwattr $C$DW$T$702, DW_AT_decl_column(0x03)
    4411                    
    4412                    $C$DW$T$703     .dwtag  DW_TAG_volatile_type
    4413                            .dwattr $C$DW$T$703, DW_AT_type(*$C$DW$T$702)
    4414                    
    4415                    $C$DW$T$704     .dwtag  DW_TAG_pointer_type
    4416                            .dwattr $C$DW$T$704, DW_AT_type(*$C$DW$T$703)
    4417                            .dwattr $C$DW$T$704, DW_AT_address_class(0x20)
    4418                    
    4419                    $C$DW$T$705     .dwtag  DW_TAG_typedef
    4420                            .dwattr $C$DW$T$705, DW_AT_name("CSL_SyscfgRegsOvly")
    4421                            .dwattr $C$DW$T$705, DW_AT_type(*$C$DW$T$704)
    4422                            .dwattr $C$DW$T$705, DW_AT_language(DW_LANG_C)
    4423                            .dwattr $C$DW$T$705, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_syscf
    4424                            .dwattr $C$DW$T$705, DW_AT_decl_line(0x7e)
    4425                            .dwattr $C$DW$T$705, DW_AT_decl_column(0x2e)
    4426                    
    4427                    $C$DW$T$706     .dwtag  DW_TAG_const_type
    4428                            .dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$705)
    4429                    
    4430                    
    4431                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    4432                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x2c0)
    4433                    $C$DW$419       .dwtag  DW_TAG_member
    4434                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$155)
    4435                            .dwattr $C$DW$419, DW_AT_name("REVID")
    4436                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("REVID")
    4437                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4438                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4439                            .dwattr $C$DW$419, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4440                            .dwattr $C$DW$419, DW_AT_decl_line(0x67)
    4441                            .dwattr $C$DW$419, DW_AT_decl_column(0x15)
    4442                    
    4443                    $C$DW$420       .dwtag  DW_TAG_member
    4444                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$166)
    4445                            .dwattr $C$DW$420, DW_AT_name("RSVD0")
    4446                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("RSVD0")
    4447                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4448                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4449                            .dwattr $C$DW$420, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4450                            .dwattr $C$DW$420, DW_AT_decl_line(0x68)
    4451                            .dwattr $C$DW$420, DW_AT_decl_column(0x15)
    4452                    
    4453                    $C$DW$421       .dwtag  DW_TAG_member
    4454                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$155)
    4455                            .dwattr $C$DW$421, DW_AT_name("PFUNC")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   82

    4456                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("PFUNC")
    4457                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4458                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4459                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4460                            .dwattr $C$DW$421, DW_AT_decl_line(0x69)
    4461                            .dwattr $C$DW$421, DW_AT_decl_column(0x15)
    4462                    
    4463                    $C$DW$422       .dwtag  DW_TAG_member
    4464                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$155)
    4465                            .dwattr $C$DW$422, DW_AT_name("PDIR")
    4466                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("PDIR")
    4467                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4468                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4469                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4470                            .dwattr $C$DW$422, DW_AT_decl_line(0x6a)
    4471                            .dwattr $C$DW$422, DW_AT_decl_column(0x15)
    4472                    
    4473                    $C$DW$423       .dwtag  DW_TAG_member
    4474                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$155)
    4475                            .dwattr $C$DW$423, DW_AT_name("PDOUT")
    4476                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("PDOUT")
    4477                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4478                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4479                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4480                            .dwattr $C$DW$423, DW_AT_decl_line(0x6b)
    4481                            .dwattr $C$DW$423, DW_AT_decl_column(0x15)
    4482                    
    4483                    $C$DW$424       .dwtag  DW_TAG_member
    4484                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$155)
    4485                            .dwattr $C$DW$424, DW_AT_name("PDIN")
    4486                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("PDIN")
    4487                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4488                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4489                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4490                            .dwattr $C$DW$424, DW_AT_decl_line(0x6c)
    4491                            .dwattr $C$DW$424, DW_AT_decl_column(0x15)
    4492                    
    4493                    $C$DW$425       .dwtag  DW_TAG_member
    4494                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$155)
    4495                            .dwattr $C$DW$425, DW_AT_name("PDCLR")
    4496                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("PDCLR")
    4497                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4498                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4499                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4500                            .dwattr $C$DW$425, DW_AT_decl_line(0x6d)
    4501                            .dwattr $C$DW$425, DW_AT_decl_column(0x15)
    4502                    
    4503                    $C$DW$426       .dwtag  DW_TAG_member
    4504                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$167)
    4505                            .dwattr $C$DW$426, DW_AT_name("RSVD1")
    4506                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("RSVD1")
    4507                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4508                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4509                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4510                            .dwattr $C$DW$426, DW_AT_decl_line(0x6e)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   83

    4511                            .dwattr $C$DW$426, DW_AT_decl_column(0x15)
    4512                    
    4513                    $C$DW$427       .dwtag  DW_TAG_member
    4514                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$155)
    4515                            .dwattr $C$DW$427, DW_AT_name("GBLCTL")
    4516                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("GBLCTL")
    4517                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4518                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4519                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4520                            .dwattr $C$DW$427, DW_AT_decl_line(0x6f)
    4521                            .dwattr $C$DW$427, DW_AT_decl_column(0x15)
    4522                    
    4523                    $C$DW$428       .dwtag  DW_TAG_member
    4524                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$155)
    4525                            .dwattr $C$DW$428, DW_AT_name("AMUTE")
    4526                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("AMUTE")
    4527                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4528                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4529                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4530                            .dwattr $C$DW$428, DW_AT_decl_line(0x70)
    4531                            .dwattr $C$DW$428, DW_AT_decl_column(0x15)
    4532                    
    4533                    $C$DW$429       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$155)
    4535                            .dwattr $C$DW$429, DW_AT_name("DLBCTL")
    4536                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("DLBCTL")
    4537                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4538                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4540                            .dwattr $C$DW$429, DW_AT_decl_line(0x71)
    4541                            .dwattr $C$DW$429, DW_AT_decl_column(0x15)
    4542                    
    4543                    $C$DW$430       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$155)
    4545                            .dwattr $C$DW$430, DW_AT_name("DITCTL")
    4546                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("DITCTL")
    4547                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4548                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4550                            .dwattr $C$DW$430, DW_AT_decl_line(0x72)
    4551                            .dwattr $C$DW$430, DW_AT_decl_column(0x15)
    4552                    
    4553                    $C$DW$431       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$166)
    4555                            .dwattr $C$DW$431, DW_AT_name("RSVD2")
    4556                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("RSVD2")
    4557                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4558                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4560                            .dwattr $C$DW$431, DW_AT_decl_line(0x73)
    4561                            .dwattr $C$DW$431, DW_AT_decl_column(0x15)
    4562                    
    4563                    $C$DW$432       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$155)
    4565                            .dwattr $C$DW$432, DW_AT_name("RGBLCTL")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   84

    4566                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("RGBLCTL")
    4567                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4568                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4570                            .dwattr $C$DW$432, DW_AT_decl_line(0x74)
    4571                            .dwattr $C$DW$432, DW_AT_decl_column(0x15)
    4572                    
    4573                    $C$DW$433       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$155)
    4575                            .dwattr $C$DW$433, DW_AT_name("RMASK")
    4576                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("RMASK")
    4577                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4578                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4580                            .dwattr $C$DW$433, DW_AT_decl_line(0x75)
    4581                            .dwattr $C$DW$433, DW_AT_decl_column(0x15)
    4582                    
    4583                    $C$DW$434       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$155)
    4585                            .dwattr $C$DW$434, DW_AT_name("RFMT")
    4586                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("RFMT")
    4587                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4588                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4590                            .dwattr $C$DW$434, DW_AT_decl_line(0x76)
    4591                            .dwattr $C$DW$434, DW_AT_decl_column(0x15)
    4592                    
    4593                    $C$DW$435       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$155)
    4595                            .dwattr $C$DW$435, DW_AT_name("AFSRCTL")
    4596                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("AFSRCTL")
    4597                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4598                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4600                            .dwattr $C$DW$435, DW_AT_decl_line(0x77)
    4601                            .dwattr $C$DW$435, DW_AT_decl_column(0x15)
    4602                    
    4603                    $C$DW$436       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$155)
    4605                            .dwattr $C$DW$436, DW_AT_name("ACLKRCTL")
    4606                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("ACLKRCTL")
    4607                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4608                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4610                            .dwattr $C$DW$436, DW_AT_decl_line(0x78)
    4611                            .dwattr $C$DW$436, DW_AT_decl_column(0x15)
    4612                    
    4613                    $C$DW$437       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$155)
    4615                            .dwattr $C$DW$437, DW_AT_name("AHCLKRCTL")
    4616                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("AHCLKRCTL")
    4617                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4618                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4620                            .dwattr $C$DW$437, DW_AT_decl_line(0x79)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   85

    4621                            .dwattr $C$DW$437, DW_AT_decl_column(0x15)
    4622                    
    4623                    $C$DW$438       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$155)
    4625                            .dwattr $C$DW$438, DW_AT_name("RTDM")
    4626                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("RTDM")
    4627                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4628                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4630                            .dwattr $C$DW$438, DW_AT_decl_line(0x7a)
    4631                            .dwattr $C$DW$438, DW_AT_decl_column(0x15)
    4632                    
    4633                    $C$DW$439       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$155)
    4635                            .dwattr $C$DW$439, DW_AT_name("RINTCTL")
    4636                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("RINTCTL")
    4637                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4638                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4640                            .dwattr $C$DW$439, DW_AT_decl_line(0x7b)
    4641                            .dwattr $C$DW$439, DW_AT_decl_column(0x15)
    4642                    
    4643                    $C$DW$440       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$155)
    4645                            .dwattr $C$DW$440, DW_AT_name("RSTAT")
    4646                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("RSTAT")
    4647                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    4648                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4650                            .dwattr $C$DW$440, DW_AT_decl_line(0x7c)
    4651                            .dwattr $C$DW$440, DW_AT_decl_column(0x15)
    4652                    
    4653                    $C$DW$441       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$155)
    4655                            .dwattr $C$DW$441, DW_AT_name("RSLOT")
    4656                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("RSLOT")
    4657                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4658                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4660                            .dwattr $C$DW$441, DW_AT_decl_line(0x7d)
    4661                            .dwattr $C$DW$441, DW_AT_decl_column(0x15)
    4662                    
    4663                    $C$DW$442       .dwtag  DW_TAG_member
    4664                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$155)
    4665                            .dwattr $C$DW$442, DW_AT_name("RCLKCHK")
    4666                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("RCLKCHK")
    4667                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    4668                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4669                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4670                            .dwattr $C$DW$442, DW_AT_decl_line(0x7e)
    4671                            .dwattr $C$DW$442, DW_AT_decl_column(0x15)
    4672                    
    4673                    $C$DW$443       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$155)
    4675                            .dwattr $C$DW$443, DW_AT_name("REVTCTL")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   86

    4676                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("REVTCTL")
    4677                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    4678                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4680                            .dwattr $C$DW$443, DW_AT_decl_line(0x7f)
    4681                            .dwattr $C$DW$443, DW_AT_decl_column(0x15)
    4682                    
    4683                    $C$DW$444       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$168)
    4685                            .dwattr $C$DW$444, DW_AT_name("RSVD3")
    4686                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("RSVD3")
    4687                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    4688                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4689                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4690                            .dwattr $C$DW$444, DW_AT_decl_line(0x80)
    4691                            .dwattr $C$DW$444, DW_AT_decl_column(0x15)
    4692                    
    4693                    $C$DW$445       .dwtag  DW_TAG_member
    4694                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$155)
    4695                            .dwattr $C$DW$445, DW_AT_name("XGBLCTL")
    4696                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("XGBLCTL")
    4697                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4698                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4699                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4700                            .dwattr $C$DW$445, DW_AT_decl_line(0x81)
    4701                            .dwattr $C$DW$445, DW_AT_decl_column(0x15)
    4702                    
    4703                    $C$DW$446       .dwtag  DW_TAG_member
    4704                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$155)
    4705                            .dwattr $C$DW$446, DW_AT_name("XMASK")
    4706                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("XMASK")
    4707                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4708                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4709                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4710                            .dwattr $C$DW$446, DW_AT_decl_line(0x82)
    4711                            .dwattr $C$DW$446, DW_AT_decl_column(0x15)
    4712                    
    4713                    $C$DW$447       .dwtag  DW_TAG_member
    4714                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$155)
    4715                            .dwattr $C$DW$447, DW_AT_name("XFMT")
    4716                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("XFMT")
    4717                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4718                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4719                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4720                            .dwattr $C$DW$447, DW_AT_decl_line(0x83)
    4721                            .dwattr $C$DW$447, DW_AT_decl_column(0x15)
    4722                    
    4723                    $C$DW$448       .dwtag  DW_TAG_member
    4724                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$155)
    4725                            .dwattr $C$DW$448, DW_AT_name("AFSXCTL")
    4726                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("AFSXCTL")
    4727                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    4728                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4729                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4730                            .dwattr $C$DW$448, DW_AT_decl_line(0x84)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   87

    4731                            .dwattr $C$DW$448, DW_AT_decl_column(0x15)
    4732                    
    4733                    $C$DW$449       .dwtag  DW_TAG_member
    4734                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$155)
    4735                            .dwattr $C$DW$449, DW_AT_name("ACLKXCTL")
    4736                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("ACLKXCTL")
    4737                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    4738                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4739                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4740                            .dwattr $C$DW$449, DW_AT_decl_line(0x85)
    4741                            .dwattr $C$DW$449, DW_AT_decl_column(0x15)
    4742                    
    4743                    $C$DW$450       .dwtag  DW_TAG_member
    4744                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$155)
    4745                            .dwattr $C$DW$450, DW_AT_name("AHCLKXCTL")
    4746                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("AHCLKXCTL")
    4747                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    4748                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4749                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4750                            .dwattr $C$DW$450, DW_AT_decl_line(0x86)
    4751                            .dwattr $C$DW$450, DW_AT_decl_column(0x15)
    4752                    
    4753                    $C$DW$451       .dwtag  DW_TAG_member
    4754                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$155)
    4755                            .dwattr $C$DW$451, DW_AT_name("XTDM")
    4756                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("XTDM")
    4757                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    4758                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4759                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4760                            .dwattr $C$DW$451, DW_AT_decl_line(0x87)
    4761                            .dwattr $C$DW$451, DW_AT_decl_column(0x15)
    4762                    
    4763                    $C$DW$452       .dwtag  DW_TAG_member
    4764                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$155)
    4765                            .dwattr $C$DW$452, DW_AT_name("XINTCTL")
    4766                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("XINTCTL")
    4767                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4768                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4769                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4770                            .dwattr $C$DW$452, DW_AT_decl_line(0x88)
    4771                            .dwattr $C$DW$452, DW_AT_decl_column(0x15)
    4772                    
    4773                    $C$DW$453       .dwtag  DW_TAG_member
    4774                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$155)
    4775                            .dwattr $C$DW$453, DW_AT_name("XSTAT")
    4776                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("XSTAT")
    4777                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4778                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4779                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4780                            .dwattr $C$DW$453, DW_AT_decl_line(0x89)
    4781                            .dwattr $C$DW$453, DW_AT_decl_column(0x15)
    4782                    
    4783                    $C$DW$454       .dwtag  DW_TAG_member
    4784                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$155)
    4785                            .dwattr $C$DW$454, DW_AT_name("XSLOT")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   88

    4786                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("XSLOT")
    4787                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4788                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4789                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4790                            .dwattr $C$DW$454, DW_AT_decl_line(0x8a)
    4791                            .dwattr $C$DW$454, DW_AT_decl_column(0x15)
    4792                    
    4793                    $C$DW$455       .dwtag  DW_TAG_member
    4794                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$155)
    4795                            .dwattr $C$DW$455, DW_AT_name("XCLKCHK")
    4796                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("XCLKCHK")
    4797                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4798                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4799                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4800                            .dwattr $C$DW$455, DW_AT_decl_line(0x8b)
    4801                            .dwattr $C$DW$455, DW_AT_decl_column(0x15)
    4802                    
    4803                    $C$DW$456       .dwtag  DW_TAG_member
    4804                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$155)
    4805                            .dwattr $C$DW$456, DW_AT_name("XEVTCTL")
    4806                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("XEVTCTL")
    4807                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4808                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4809                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4810                            .dwattr $C$DW$456, DW_AT_decl_line(0x8c)
    4811                            .dwattr $C$DW$456, DW_AT_decl_column(0x15)
    4812                    
    4813                    $C$DW$457       .dwtag  DW_TAG_member
    4814                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$169)
    4815                            .dwattr $C$DW$457, DW_AT_name("RSVD4")
    4816                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("RSVD4")
    4817                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4818                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4819                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4820                            .dwattr $C$DW$457, DW_AT_decl_line(0x8d)
    4821                            .dwattr $C$DW$457, DW_AT_decl_column(0x15)
    4822                    
    4823                    $C$DW$458       .dwtag  DW_TAG_member
    4824                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$155)
    4825                            .dwattr $C$DW$458, DW_AT_name("DITCSRA0")
    4826                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("DITCSRA0")
    4827                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4828                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4829                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4830                            .dwattr $C$DW$458, DW_AT_decl_line(0x8e)
    4831                            .dwattr $C$DW$458, DW_AT_decl_column(0x15)
    4832                    
    4833                    $C$DW$459       .dwtag  DW_TAG_member
    4834                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$155)
    4835                            .dwattr $C$DW$459, DW_AT_name("DITCSRA1")
    4836                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("DITCSRA1")
    4837                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4838                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4839                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4840                            .dwattr $C$DW$459, DW_AT_decl_line(0x8f)
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   89

    4841                            .dwattr $C$DW$459, DW_AT_decl_column(0x15)
    4842                    
    4843                    $C$DW$460       .dwtag  DW_TAG_member
    4844                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$155)
    4845                            .dwattr $C$DW$460, DW_AT_name("DITCSRA2")
    4846                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("DITCSRA2")
    4847                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    4848                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4849                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4850                            .dwattr $C$DW$460, DW_AT_decl_line(0x90)
    4851                            .dwattr $C$DW$460, DW_AT_decl_column(0x15)
    4852                    
    4853                    $C$DW$461       .dwtag  DW_TAG_member
    4854                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$155)
    4855                            .dwattr $C$DW$461, DW_AT_name("DITCSRA3")
    4856                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("DITCSRA3")
    4857                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    4858                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4859                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4860                            .dwattr $C$DW$461, DW_AT_decl_line(0x91)
    4861                            .dwattr $C$DW$461, DW_AT_decl_column(0x15)
    4862                    
    4863                    $C$DW$462       .dwtag  DW_TAG_member
    4864                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$155)
    4865                            .dwattr $C$DW$462, DW_AT_name("DITCSRA4")
    4866                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("DITCSRA4")
    4867                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    4868                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4869                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4870                            .dwattr $C$DW$462, DW_AT_decl_line(0x92)
    4871                            .dwattr $C$DW$462, DW_AT_decl_column(0x15)
    4872                    
    4873                    $C$DW$463       .dwtag  DW_TAG_member
    4874                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$155)
    4875                            .dwattr $C$DW$463, DW_AT_name("DITCSRA5")
    4876                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("DITCSRA5")
    4877                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    4878                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4879                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4880                            .dwattr $C$DW$463, DW_AT_decl_line(0x93)
    4881                            .dwattr $C$DW$463, DW_AT_decl_column(0x15)
    4882                    
    4883                    $C$DW$464       .dwtag  DW_TAG_member
    4884                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$155)
    4885                            .dwattr $C$DW$464, DW_AT_name("DITCSRB0")
    4886                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("DITCSRB0")
    4887                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    4888                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4889                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4890                            .dwattr $C$DW$464, DW_AT_decl_line(0x94)
    4891                            .dwattr $C$DW$464, DW_AT_decl_column(0x15)
    4892                    
    4893                    $C$DW$465       .dwtag  DW_TAG_member
    4894                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$155)
    4895                            .dwattr $C$DW$465, DW_AT_name("DITCSRB1")
TMS320C6x Assembler PC v8.1.3 Fri Apr 14 08:40:18 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
AudioInterface.asm                                                   PAGE   90

    4896                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("DITCSRB1")
    4897                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    4898                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4900                            .dwattr $C$DW$465, DW_AT_decl_line(0x95)
    4901                            .dwattr $C$DW$465, DW_AT_decl_column(0x15)
    4902                    
    4903                    $C$DW$466       .dwtag  DW_TAG_member
    4904                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$155)
    4905                            .dwattr $C$DW$466, DW_AT_name("DITCSRB2")
    4906                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("DITCSRB2")
    4907                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    4908                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4909                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
    4910                            .dwattr $C$DW$466, DW_AT_decl_line(0x96)
    4911                            .dwattr $C$DW$466, DW_AT_decl_column(0x15)
    4912                    
    4913                    $C$DW$467       .dwtag  DW_TAG_member
    4914                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$155)
    4915                            .dwattr $C$DW$467, DW_AT_name("DITCSRB3")
    4916                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("DITCSRB3")
    4917                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4918                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4919                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/pdk_OMAPL138_1_01_00_02/packages/ti/csl/cslr_mcasp.h
